<template>
<q-page padding>
  <div class="row q-col-gutter-sm">
    <div class="col-12">
      <span class="text-grey-10 text-h3">Факультет инфокоммуникаций</span>
      <br>
      <span class="text-grey-10 text-h6">На факультете проводится подготовка по образовательным программам бакалавриата по двум направлениям подготовки:</span>
    </div>
    <div class="col-12 col-md-6 q-my-md">
      <span class="text-h6">11.03.02 Инфокоммуникационные технологии и системы связи, профили:</span>
      <ul>
        <li>Многоканальные телекоммуникационные системы;</li>
        <li>Сети связи и системы коммутации;</li>
        <li>Защищенные системы и сети связи;</li>
        <li>Системы радиосвязи и радиодоступа.</li>
      </ul>
    </div>
    <div class="col-12 col-md-6 q-my-md">
      <span class="text-h6">09.03.01 Информатика и вычислительная техника, профили:</span>
      <ul>
        <li>Вычислительные машины, комплексы, системы и сети;</li>
        <li>Программное обеспечение и интеллектуальные системы.</li>
      </ul>
    </div>
    <div class="col-12">
      <q-card>
        <q-card-section class="text-subtitle1">
          Студенты могут получать образование по очной и заочной формам обучения. <br>
          При получении образования по очной форме обучения срок освоения образовательных программ для получения квалификации бакалавр — 4 года.
          <br>
          При получении образования по заочной форме обучения срок освоения основной образовательной программы с полным сроком обучения — 4 года 8 месяцев. Также возможно ускоренное освоение образовательной программы по индивидуальному учебному плану.
        </q-card-section>
      </q-card>
    </div>
    <div class="col-12">
      <q-card>
        <q-card-section class="text-subtitle1">
          На основную образовательную программу с полным сроком обучения поступают лица, имеющие среднее общее, начальное профессиональное, среднее профессиональное или высшее образование. Лица, имеющие профильное среднее профессиональное или высшее образование после поступления в университет могут перейти на ускоренное обучение по индивидуальному учебному плану при наличии у них способности и (или) уровня развития, позволяющие освоить образовательную программу в более короткий срок по сравнению со сроком получения высшего образования по образовательной программе, установленным в соответствии с образовательным стандартом.
        </q-card-section>
      </q-card>
    </div>
    <div class="col-12">
      <q-card>
        <q-card-section>
          Прием студентов на все направления подготовки по очной и заочной формам обучения по основной образовательной программе с полным сроком обучения производится на места в рамках контрольных цифр приема и на места по договорам об оказании платных образовательных услуг.
        </q-card-section>
      </q-card>
    </div>
    <div class="col-12">
      <q-card>
        <q-card-section>
          Прием студентов на 1-й курс организует приемная комиссия филиала согласно правилам приема. При обучении на договорной основе между участвующими сторонами заключается двух или трехсторонний договор о подготовке бакалавра с высшим образованием на условиях полного возмещения затрат, связанных с обучением. Ускоренное обучение ведется только на договорной основе. Лица, имеющие незаконченное высшее образование, могут переводиться или восстанавливаться в СКФ МТУСИ на второй и старшие курсы в начале учебного года на вакантные бюджетные или коммерческие места. Прием документов производится до 15 сентября. Перевод и восстановления производятся на основании аттестационных испытаний на конкурсной основе в соответствии с Положением о переводе, восстановлении и отчислении обучающихся. Восстанавливаться в филиал могут лица, перерыв в обучении которых не превышает пяти лет. Курс, на который производится перевод или восстановление, определяется аттестационной комиссией филиала на основании представленных документов о высшем образовании (справка об обучении (академическая справка).
        </q-card-section>
      </q-card>
    </div>
    <div class="col-12 q-my-md">
      <span class="text-grey-10 text-h3">Сотрудники факультета:</span>
    </div>
    <div class="col-12">
      <div class="row q-col-gutter-sm">
        <div
          class="col-12 col-md-6 col-lg-4"
          v-for="item in empl"
          :key="item.name"
        >
          <q-card>
            <q-item>
              <q-item-section>
                <span class="text-overline">{{item.position}}</span>
              </q-item-section>
            </q-item>
            <q-card-section>
              <span class="text-h6">{{item.name}}</span><br>
              <span class="text-subtitle2">Телефон: {{item.phone}}</span>
              <ul v-if="item.profiles">
                <li v-for="prof in item.profiles">{{prof}}</li>
              </ul>
            </q-card-section>
          </q-card>
        </div>
      </div>
    </div>
    <div class="col-12 q-mt-md">
      <ul>
        <li><b>Адрес факультета инфокоммуникаций СКФ МТУСИ</b>: 344002, г. Ростов-на-Дону, ул. Серафимовича, 62, СКФ МТУСИ, к. 203. Телефоны деканата: 8(863) 310-69-66.</li>
        <li>E-mail: sosnоvskii@skf-mtusi.ru</li>
      </ul>
      <span>График работы деканата факультета:</span>
      <ul>
        <li>Пн-Пт с 8.00 до 17.00, перерыв с 13.00 до 14.00</li>
        <li>Суббота с 08.00 до 13.00</li>
      </ul>
    </div>
  </div>
</q-page>
</template>

<script>
export default {
  name: "Infocommunications",
  setup() {
    const empl = [
      {
        position: 'Декан факультета',
        name: '-',
        phone: '8(863) 310-69-71',
        profiles: null
      },
      {
        position: 'Заместитель декана факультета',
        name: 'Коршун Анна Михайловна',
        phone: '8(863) 310-69-66',
        profiles: null
      },
      {
        position: 'Заместитель декана факультета',
        name: 'Ефимов Сергей Викторович',
        phone: '8(863) 310-69-66',
        profiles: null
      },
      {
        position: 'Специалист по работе с молодёжью',
        name: 'Павленко Светлана Евгеньевна',
        phone: '8(863) 310-69-66',
        profiles: null
      },
      {
        position: 'Техник факультета',
        name: 'Коломиец Елена Анатольевна',
        phone: '8(863) 310-69-66',
        profiles: null
      },
      {
        position: 'Техник факультета',
        name: 'Гендриксон Ева Алексеевна',
        phone: '8(863) 310-69-66',
        profiles: null
      },
      {
        position: 'Методист',
        name: 'Гуденко Олеся Александровна',
        phone: '8(863) 310-69-66',
        profiles: ['Заочная форма обучения.', 'Направление подготовки 11.03.02 «Инфокоммуникационные технологии и системы связи».', 'Профиль подготовки «Защищенные системы и сети связи».', 'Занимается решением вопросов трудоустройства студентов.']
      },
      {
        position: 'Методист',
        name: 'Гуденко Ирина Юрьевна',
        phone: '8(863) 310-69-66',
        profiles: ['Очная форма обучения.', 'Направление подготовки 09.03.01 «Информатика и вычислительная техника».', ' Профиль подготовки «Вычислительные машины, комплексы, системы и сети».', 'Заочная форма обучения.', 'Направление подготовки 11.03.02 «Инфокоммуникационные технологии и системы связи».', 'Профиль подготовки «Многоканальные телекоммуникационные системы».', 'Направление подготовки 09.03.01 «Информатика и вычислительная техника».', 'Профиль подготовки «Вычислительные машины, комплексы, системы и сети».']
      },
      {
        position: 'Методист',
        name: 'Петухова Татьяна Анатольевна',
        phone: '8(863) 310-69-66',
        profiles: ['Очная форма обучения.', 'Направление подготовки 11.03.02 «Инфокоммуникационные технологии и системы связи».', ' Профили подготовки «Сети связи и системы коммутации», «Многоканальные телекоммуникационные системы», «Защищенные системы и сети связи».', 'Заочная форма обучения.', 'Направление подготовки 11.03.02 «Инфокоммуникационные технологии и системы связи».', 'Профиль подготовки «Сети связи и системы коммутации».']
      }
    ]

    return {
      empl
    }
  }
}
</script>

<style scoped>

</style>
