<template>
<q-page padding>
  <div class="row q-col-gutter-sm">
    <div class="col-12">
      <span class="text-grey-10 text-h3">Кафедра инфокоммуникационных технологий и систем связи</span>
    </div>
    <div class="col-12 q-my-md">
      <q-card>
        <q-card-section>
          <b>Кафедра инфокоммуникационных технологий и систем связи (ИТСС)</b> создана в 2017 году путем объединения двух ранее существовавших кафедр – сетей связи и систем коммутации и многоканальных телекоммуникационных систем. Необходимость такого объединения обусловлена окончательным переходом филиала на образовательные стандарты нового поколения, предусматривающие подготовку связистов разных профилей по единому направлению подготовки <b>11.03.02 «Инфокоммуникационные технологии и системы связи».</b>
        </q-card-section>
        <q-card-section>
          Лаборатории кафедры ИТСС оснащены самыми современными техническими средствами обучения, а также аппаратурой связи. В процессе обучения студенты получают практические навыки конфигурирования и эксплуатации самого различного инфокоммуникационного оборудования – от систем традиционной телефонии до систем унифицированных коммуникаций. Кафедра имеет в своем составе учебный центр компании «Unify Communications», на базе которого студенты, обучающиеся по профилю «Сети связи и системы коммутации», проходят курс практических занятий, по результатам которого выдается сертификат международного образца.
        </q-card-section>
        <q-card-section>
          Коллектив кафедры активно занимается научными исследованиями в области инфокоммуникационных технологий. Труды преподавательского состава ежегодно публикуются как в сборниках филиала и других организаций, так и в научных рецензируемых журналах. Многие преподаватели участвуют в хоздоговорных научно-исследовательских и опытно-конструкторских работах, проводимых филиалом. К научным исследованиям привлекаются и студенты, обучающиеся на кафедре, многие из них выступают с докладами о своих достижениях на конференциях всероссийского и международного уровней.
        </q-card-section>
        <q-card-section>
          Учебные дисциплины кафедры ИТСС предусматривают изучение всех современных инфокоммуникационных технологий и стандартов связи. Выпускные квалификационные работы, подготавливаемые студентами выпускных курсов, имеют, как правило, практическую направленность, а тематика работ формируется в процессе прохождения практик. Практики студентов кафедры ИТСС организуются в основном на базе операторов фиксированной и подвижной связи, присутствующих в Южном и Северо-Кавказском федеральных округах. Это позволяет студентам выпускных курсов определиться с местами будущего трудоустройства, а выпускникам – быстро адаптироваться на новом рабочем месте.
        </q-card-section>
        <q-card-section>
          В подготовке студентов принимают участие не только штатные преподаватели кафедры ИТСС, но и приглашенные специалисты, работающие в отрасли, что обеспечивает неразрывную связь учебы, науки и производства. В настоящее время это специалисты из ПАО «Ростелеком», ПАО «Вымпелком», Ростовского-на-Дону научно-исследовательского институт радиосвязи, и многих других организаций. Направление подготовки 11.03.02 «Инфокоммуникационные технологии и системы связи», реализуемое кафедрой, в 2017 году успешно прошло независимую оценку качества образования, а также государственную аккредитацию основных образовательных программ.
        </q-card-section>
        <q-card-section>
          <b>Руководит кафедрой кандидат технических наук, доцент Юхнов Василий Иванович.</b>
        </q-card-section>
      </q-card>
    </div>
  </div>
</q-page>
</template>

<script>
export default {
  name: "Itss"
}
</script>

<style scoped>

</style>
