<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12">
        <span class="text-grey-10 text-h3">Кафедра информатики и вычислительной техники</span>
      </div>
      <div class="col-12 q-my-md">
        <q-card>
          <q-img
            src="http://www.skf-mtusi.ru/images/sved/struct/spoi.jpg"
            height="360px"
            fit="contain"
          ></q-img>
          <q-card-section>
            Информатика и вычислительная техника-это область науки и техники, которая включает в себя совокупность средств, способов и методов человеческой деятельности, направленных на создание и применение: ЭВМ, систем и сетей; автоматизированных систем обработки информации и управления; систем автоматизированного проектирования; программного обеспечения вычислительной техники и автоматизированных систем.
          </q-card-section>
          <q-card-section>
            У истоков создания кафедры (в сентябре 1993 года) стояли: Ерашов Алексей Никифорович, Жабинский Юрий Владиславович, Конева Светлана Ивановна, Ломаш Виктор Константинович, Капитанова Алла Николаевна.
            <br>
            Первым заведующим кафедрой был кандидат технических наук, доцент Алексей Никифорович Ерашов, выпускник Таганрогского радиотехнического института.
          </q-card-section>
          <q-card-section>
            С 2003 года кафедру возглавляет доктор технических наук профессор Соколов Сергей Викторович – ученый с российским и мировым признанием. По рейтингу Кембриджского университета (Великобритания) Сергей Викторович вошел в список 2000 выдающихся ученых 20-го столетия. Являясь действительным членом академий Навигации и управления движением, Военных наук, Информатизации образования, профессор Соколов С.В. продолжает свою научную деятельность. В его арсенале более 200 патентов, 14 монографий, более 250 статей в Российских и зарубежных изданиях.
          </q-card-section>
          <q-card-section>
            Сергей Викторович длительное время был участником и исполнителем научно-исследовательских работ в системе обороны государства, за что удостаивался наивысшего титула «Лучший изобретатель Вооруженных Сил РФ» с 1996г. по 2002г.
            <br>
            Профессор Соколов С.В. ведет работу по разработке современных тем исследования: «Оптимальная обработка сигналов и изображений», «Оптические компьютеры», «Управление подвижными объектами».
          </q-card-section>
          <q-card-section>
            Под его руководством кафедра постоянно ведет работу по совершенствованию методики преподавания дисциплин.
            В начале 2008 года кафедра была реорганизована. В настоящее время кафедра “Информатики и вычислительной техники” является выпускающей по направлению подготовки 09.03.01 «Информатика и вычислительная техника» (профили подготовки: «Вычислительные машины, комплексы, системы и сети», «Программное обеспечение и интеллектуальные системы»).
          </q-card-section>
          <q-card-section>
            Со дня своего образования кафедра главное внимание сосредотачивает на основных объектах профессиональной деятельности: вычислительные машины, комплексы, системы и сети; автоматизированные системы обработки информации и управления; системы автоматизированного проектирования; программное обеспечение средств вычислительной техники и автоматизированных систем (программы, программные комплексы и системы); математическое, информационное, техническое, эргономическое, организационное и правовое обеспечение перечисленных систем.
          </q-card-section>
          <q-card-section>
            Другим важным направлением приложения усилий коллектива кафедры является методическая работа.
            В общей сложности коллективом кафедры подготовлено, издано и внедрено в учебный процесс более 450 методических и учебно-методических трудов и разработок.
          </q-card-section>
          <q-card-section>
            В эпоху стремительного научно-технического прогресса, информатизации и компьютеризации всех сфер человеческой деятельности учебный процесс в ВУЗе немыслим без активного научно-исследовательского поиска, творческого преломления его результатов при проведении различных видов занятий.
          </q-card-section>
          <q-card-section>
            <span class="text-subtitle2">Кафедра в научно-исследовательской работе выделяет три основных направления:</span>
            <ul>
              <li>Решение проблем повышения качества и эффективности процесса реализации современных информационных технологий обучения. Создание и развитие материальной базы системы дистанционного образования;</li>
              <li>Разработка новых перспективных принципов построения телекоммуникационных систем, аппаратных и программных средств путем их моделирования, производства и научно-технического сопровождения;</li>
              <li>Разработка современных аппаратных и программных средств обучения и тренажа специалистов отрасли различных категорий.</li>
            </ul>
          </q-card-section>
          <q-card-section>
            Преподаватели кафедры не только успешно выполняют научные исследования, но и активно работают в вопросах апробации их результатов, внедрения в практическую деятельность отрасли связи, в учебный процесс СКФ МТУСИ и других вузов страны.
            Преподавателями кафедры подготовлено и издано более 800 научных работ (в том числе 17 монографий). На научно-технических конференциях и семинарах сотрудники кафедры более 350 раз выступали с докладами и научными сообщениями (в том числе, на международных). Их труды (более 300), опубликованы в научно-технических журналах и сборниках РАН, в зарубежных изданиях.
            На счету кафедры более 250 авторских свидетельств и патентов на изобретения, что говорит о приоритете и высоком уровне результатов исследований, их существенной практической значимости.
          </q-card-section>
          <q-card-section>
            Многочисленные творческие находки и идеи сотрудников кафедры нашли оперативное и качественное воплощение в виде патентов на изобретения (более 200) и программ для ЭВМ. Большинство из них внедрено в учебный процесс СКФ МТУСИ: на счету кафедры более 80 внедренных программных разработок.
          </q-card-section>
          <q-card-section>
            Любая научная школа и кафедра, как основной элемент вуза, с особой тщательностью подходит к вопросам отбора и подготовки новых поколений специалистов высшей квалификации. Преподаватели кафедры участвуют в работе диссертационных Советов ряда вузов региона, занимаются оппонированием диссертаций, написанием на них отзывов.
            Под руководством опытных преподавателей разрабатывают и защищают диссертации соискатели и аспиранты. Доктором технических наук профессором Соколовым С.В. подготовлено 10 кандидатов технических наук.
          </q-card-section>
          <q-card-section>
            К исследовательской работе широко привлекаются студенты кафедры в рамках студенческих научных кружков.
            Диапазон форм участия студентов в научно-исследовательской работе весьма широк — от совместного с преподавателями (руководителем) оформления научных работ и методических разработок, до самостоятельной подготовки научных статей, диссертаций и представления их результатов на научных семинарах и конференциях, от простейших учебных программ-до Web–cтраниц сайта СКФ МТУСИ в глобальной сети Internet.
          </q-card-section>
          <q-card-section>
            Под руководством преподавателей кафедры в научных кружках занимаются 20 студентов младших курсов.
          </q-card-section>
        </q-card>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "Ivt"
}
</script>

<style scoped>

</style>
