<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12">
        <span class="text-grey-10 text-h3">Кафедра общенаучной подготовки</span>
      </div>
      <div class="col-12 q-my-md">
        <q-card>
          <q-img
            fit="contain"
            src="images/onp_title.jpg"
            height="240px"
          ></q-img>
          <q-card-section>
            Общенаучная подготовка специалистов в области телекоммуникаций является основополагающей. Работа соответствующей кафедры направлена на формирование фундамента основных знаний и умений, на базе которого будет происходить дальнейшее профессиональное становление будущего специалиста.
            История кафедры берет свое начало с предметно-методической комиссии общенаучной подготовки, которая входила в состав кафедры «Высшая математика» ВЗЭИС, ОЭИС, затем кафедры «Теории вероятностей» МТУСИ. У истоков формирования ПМК стояли Ефименко В.Н., Золотарева Ю.М., Прушинская Л.А., Стрюков М.Б.
          </q-card-section>
          <q-card-section>
            Кафедра общенаучной подготовки была образована в январе 1993 года. В ее составе было 9 преподавателей: Ефименко В.Н., Стрюков М.Б, Золотарева Ю.М., Прушинская Л.А., Зарецкая Г.И., Матвиенко А.И., Колдынская Л.М., Лобачева Е.М., Астен Т.Б.
          </q-card-section>
          <q-card-section>
            В то время кафедру возглавлял Владимир Николаевич Ефименко. Под его руководством произошли серьезные изменения в кадровой политике, вопросах организации научно-методической работы, выработке уровня требований к студентам.
          </q-card-section>
          <q-card-section>
            В настоящее время на кафедре трудятся 15 преподавателей. Среди них 3 профессор и 9 доцентов, имеющих ученые степени докторов и кандидатов наук. Профессорско-преподавательский состав кафедры обеспечивает учебный процесс по дисциплинам естественнонаучного профиля: математика, алгебра, физика, педагогика, психология, иностранные языки, русский язык и культура речи, физическая культура.
          </q-card-section>
          <q-card-section>
            Коллектив кафедры наряду с учебной работой принимает активное участие в научно-исследовательской деятельности, основными направлениями которой являются:
            <ul>
              <li>Математическое моделирование систем и процессов.</li>
              <li>Проблемы педагогики высшей школы. Информационные технологии в образовательном процессе.</li>
              <li>Повышение безопасности на предприятиях ЮФО (по плану Донского центра МАНЭБ).</li>
              <li>Исследование нётеровости и вычисление индекса бисингулярных операторов с нераспадающимся сдвигом.</li>
              <li>Пироэлектрический эффект и электрофизические свойства в области фазовых переходов.</li>
              <li>Сегнетоэлектрики перовскитовой структуры, области морфотропных переходов.</li>
            </ul>
            Результаты научных исследований регулярно докладываются на международных и внутрироссийских конференциях, симпозиумах, выставках.
          </q-card-section>
          <q-card-section>
            В настоящее время преподаватели занимаются активным поиском объединяющей всех научно-методической тематики. И эта задача в значительной степени решена по линии создания модели информационно-обучающей среды по дисциплинам. В частности разработана и активно используется интерактивная контрольно-обучающая среда по физике.
          </q-card-section>
          <q-card-section>
            Под руководством опытных преподавателей студенты участвуют в научно-исследовательской работе, включающей в себя подготовку докладов для студенческих научно-практических конференций. Одна из задач кафедры – сформировать навык осуществления коммуникаций в профессиональной среде, в том числе на иностранном языке. Результаты своей работы студенты регулярно представляют не только на научно — практической конференции СКФ МТУСИ, но и на различных международных конференциях России и дальнего зарубежья.
          </q-card-section>
          <q-card-section>
            Итак, кафедра общенаучной подготовки обеспечивает стратегическую линию в становлении будущих связистов. Именно специалисты кафедры первыми приобщают студентов к научным исследованиям, передавая эстафету кафедрам, занимающимся общетехнической и общепрофессиональной подготовкой студентов.
          </q-card-section>
          <q-card-section>
            Кроме того, задачей кафедры общенаучной подготовки является организация взаимодействия с абитуриентами по всем предметам вступительных испытаний. Именно эта кафедра обеспечивает учебный процесс на подготовительных курсах. С этой целью ежегодно обновляются учебные пособия по материалам вступительных экзаменов, а сами преподаватели, помимо участия во вступительных испытаниях, активно занимаются профориентационной работой на предприятиях связи региона, совмещая эту деятельность, с консультационной помощью студентам по дисциплинам кафедры в опорных пунктах Южного Федерального округа.
          </q-card-section>
          <q-card-section>
            <div class="row q-col-gutter-sm">
              <div class="col-md-3 col-12">
                <q-img
                  fit="contain"
                  height="300px"
                  src="/images/onp1_1.jpg"
                ></q-img>
              </div>
              <div class="col-md-3 col-12">
                <q-img
                  fit="contain"
                  height="300px"
                  src="/images/onp2_1.jpg"
                ></q-img>
              </div>
              <div class="col-md-3 col-12">
                <q-img
                  fit="contain"
                  height="300px"
                  src="/images/onp3_1.jpg"
                ></q-img>
              </div>
              <div class="col-md-3 col-12">
                <q-img
                  fit="contain"
                  height="300px"
                  src="/images/onp4_1.jpg"
                ></q-img>
              </div>
            </div>
          </q-card-section>
          <q-card-section>
            Особенностью кафедры является ее учебно-методическая работа, направленная на приобщение студентов к рациональному учебному труду, оптимальной организации учения. Одним из направлений такой работы является обучение студентов возможностям использования информационно-обучающих материалов, которыми располагает филиал, включая электронные курсы, а с другой стороны, включение студентов в информационное пространство всех вузов связи, а также родственных по профилю учебных заведений. С этим связана и научно-методическая работа, активно проводимая преподавателями кафедры, в том числе и совместно с головным университетом.
          </q-card-section>
          <q-card-section>
            Кафедра имеет собственный фонд учебно-методических изданий, многие из которых изданы под грифом УМО по образованию в области телекоммуникаций и пригодны для межвузовского использования.
          </q-card-section>
        </q-card>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "Onp"
}
</script>

<style scoped>

</style>
