<template>
  <q-page padding>
    <div class="row">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Документы</span>
      </div>
      <div class="col-12 q-my-xl">
        <div class="row">
          <div class="col-4 q-pa-md" v-for="(document, index) in documents" :key="index">
            <q-card>
              <q-item>
                <q-item-avatar>
                  <q-avatar size="64px">
                    <q-icon name="mdi-pdf-box" color="red"></q-icon>
                  </q-avatar>
                </q-item-avatar>
                <q-item-section class="text-body1">
                  <q-item-label>{{document.label}}</q-item-label>
                </q-item-section>
              </q-item>
              <q-card-actions>
                <q-space></q-space>
                <q-btn flat type="a" color="primary" :href="document.link">Ссылка</q-btn>
              </q-card-actions>
            </q-card>
          </div>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  setup() {
    const documents = [
      { type: 'pdf', label: 'Устав МТУСИ', link: '' },
      { type: 'pdf', label: 'Лицензия на осуществление образовательной деятельности', link: '' },
      { type: 'pdf', label: 'Свидетельство о государственной аккредитации', link: '' },
      { type: 'pdf', label: 'Приложение №1 к свидетельству о государственной аккредитации', link: '' },
      { type: 'pdf', label: 'Приложение №2 к свидетельству о государственной аккредитации', link: '' },
      { type: 'pdf', label: 'План финансово-хозяйственной деятельности', link: '' },
      { type: 'pdf', label: 'Правила приема в Северо-Кавказский филиал ордена Трудового Красного Знамени федерального государственного бюджетного образовательного учреждения высшего образования «Московский технический университет связи и информатики» (СКФ МТУСИ)', link: '' },
      { type: 'pdf', label: 'Положение о режиме занятий обучающихся', link: '' },
      { type: 'pdf', label: 'Положение О порядке осуществления образовательной деятельности по индивидуальным учебным планам, в том числе ускоренного обучения', link: '' },
      { type: 'pdf', label: 'Положение о практической подготовке обучающихся в СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение об условиях и порядке зачисления экстернов в СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение об обучении лиц с ограниченными возможностями здоровья', link: '' },
      { type: 'pdf', label: 'Положение о текущем контроле успеваемости и промежуточной аттестации студентов очного факультета с использованием модульно-рейтинговой системы организации учебного процесса', link: '' },
      { type: 'pdf', label: 'Положение О текущем контроле успеваемости и промежуточной аттестации студентов очной формы обучения с использованием модульно-рейтинговой системы организации учебного процесса (2019 год)', link: '' },
      { type: 'pdf', label: 'Положение о текущем контроле и промежуточной аттестации студентов заочной формы обучения', link: '' },
      { type: 'pdf', label: 'Положение о переводе, восстановлении и отчислении обучающихся', link: '' },
      { type: 'pdf', label: 'Положение о переводе студентов СКФ МТУСИ с платного обучения на бесплатное', link: '' },
      { type: 'pdf', label: 'Положение о порядке оформления возникновения, приостановления и прекращения отношений между СКФ МТУСИ и обучающимися и (или) родителями (законными представителями) несовершеннолетних обучающихся', link: '' },
      { type: 'pdf', label: 'Правила внутреннего распорядка обучающихся', link: '' },
      { type: 'pdf', label: 'Правила внутреннего трудового распорядка для сотрудников и преподавателей', link: '' },
      { type: 'pdf', label: 'Коллективный договор СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Дополнительное соглашение №1 Коллективному договору СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Отчет о результатах самообследования 2020 г.', link: '' },
      { type: 'pdf', label: 'Об утверждении стоимости платных образовательных услуг ордена Трудового Красного Знамени федерального государственного бюджетного образовательного учреждение высшего образования «Московский технический университет связи и информатики» (МТУСИ) по образовательным программам высшего и среднего профессионального образования – программам бакалавриата, специалитета, магистратуры, аспирантуры очной и заочной форм обучения на 2021-2022 учебный год', link: '' },
      { type: 'pdf', label: 'Положение об установлении оснований и порядка снижения стоимости платных образовательных услуг', link: '' },
      { type: 'pdf', label: 'Предписания органов, осуществляющих государственный контроль (надзор) в сфере образования: предписаний нет', link: '' },
      { type: 'pdf', label: 'Отчёты об исполнении предписаний органов, осуществляющих государственный контроль (надзор) в сфере образования: предписаний нет', link: '' },
      { type: 'pdf', label: 'Положение о СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение об Ученом совете СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Приказ о мерах по предупреждению распространения коронавирусной инфекции', link: '' },
      { type: 'pdf', label: 'Меры по профилактике распространения коронавирусной инфекции среди работников и студентов', link: '' },
      { type: 'pdf', label: 'Приказ по студенческому составу факультета инфокоммуникаций о мерах по противодействия распространения коронавирусной инфекции №1', link: '' },
      { type: 'pdf', label: 'Приказ по студенческому составу факультета инфокоммуникаций о мерах по противодействия распространения коронавирусной инфекции №2', link: '' },
      { type: 'pdf', label: 'Распоряжение о порядке взаимодействия профессорско-преподавательского состава и студентов СКФ МТУСИ в период распространения коронавирусной инфекции на территории РФ путем перехода на дистанционные методы обучения', link: '' },
      { type: 'pdf', label: 'Приказ о мерах по реализации СКФ МТУСИ Указа Президента Российской Федерации от 02 апреля 2020 года № 239 «О мерах по обеспечению санитарно-эпидемиологического благополучия населения на территории Российской Федерации в связи с распространением новой коронавирусной инфекции (COVID-19)»»', link: '' },
      { type: 'pdf', label: 'Положение «О реализации образовательных программ с применением электронного обучения и дистанционных образовательных технологий в условиях распространения коронавирусной инфекции на территории Российской Федерации»', link: '' },
      { type: 'pdf', label: 'Положение об организации оформления, выдачи и использования разрешений для следования к месту (от места) осуществления деятельности (в том числе работы) на территории муниципального образования «Город Ростов-на-Дону» в СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Приказ о продлении нерабочих дней с сохранением заработной платы и продлении работы в дистанционном режиме', link: '' },
      { type: 'pdf', label: 'Положение «О проведении всех видов практик в условиях применения электронного обучения и дистанционных образовательных технологий в условиях распространения коронавирусной инфекции на территории Российской Федерации»', link: '' },
      { type: 'pdf', label: 'Положение о рабочих программах дисциплин, практик', link: '' },
      { type: 'pdf', label: 'Положение о расписании учебных занятий СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение о порядке усвоения учебных курсов, дисциплин, модулей, не входящих в осваиваемую образовательную программу', link: '' },
      { type: 'pdf', label: 'Положение о воспитательной работе со студентами', link: '' },
      { type: 'pdf', label: 'Положение об аттестационных комиссиях и порядке аттестации дисциплин, практик и учебных планов', link: '' },
      { type: 'pdf', label: 'Положение о контроле образовательной деятельности в СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение о контрольных и курсовых работах (проектах)', link: '' },
      { type: 'pdf', label: 'Положение о выпускных квалификационных работах бакалавра', link: '' },
      { type: 'pdf', label: 'Положение о государственной итоговой аттестации (ГИА)', link: '' },
      { type: 'pdf', label: 'Временное положение «О проведении государственной итоговой аттестации по образовательным программам бакалавриата с применением электронного обучения и дистанционных образовательных технологий в условиях распространения коронавирусной инфекции на территории Российской Федерации»', link: '' },
      { type: 'pdf', label: 'Положение об основной профессиональной образовательной программе высшего образования (ОПОП ВО)', link: '' },
      { type: 'pdf', label: 'Положение об электронной информационно-образовательной среде СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение об организации занятий по физической культуре', link: '' },
      { type: 'pdf', label: 'Инструкция по оформлению учебной документации, отражающей выполнение студентом образовательной программы в СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение о контактной работе в СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение о порядке выбора и организации освоения дисциплин по выбору обучающихся, факультативных и элективных дисциплин', link: '' },
      { type: 'pdf', label: 'Положение «О порядке и основаниях предоставления академического отпуска обучающимся»', link: '' },
      { type: 'pdf', label: 'Положение о студенческом совете', link: '' },
      { type: 'pdf', label: 'Положение о кураторе студенческой группы', link: '' },
      { type: 'pdf', label: 'Положение о размещении учебно-методической и научно-исследовательский документации в электронно-информационной образовательной среде', link: '' },
      { type: 'pdf', label: 'Положение о проведении экспертизы материалов, предназначенных к открытому опубликованию (оглашению), вывозу за границу, представлению на мероприятия с участием иностранных граждан', link: '' },
      { type: 'pdf', label: 'Положение о повышении квалификации педагогических работников и сотрудников СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение об оценочных материалах дисциплин, практик, государственных итоговых аттестаций', link: '' },
      { type: 'pdf', label: 'Порядок размещения и хранения личных дел обучающихся СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Нормы времени СКФ МТУСИ 2021-2022', link: '' },
      { type: 'pdf', label: 'Положение. Планирование и проведение заседаний кафедры', link: '' },
      { type: 'pdf', label: 'Планирование и отчет о работе подразделения', link: '' },
      { type: 'pdf', label: 'Политика в отношении обработки персональных данных', link: '' },
      { type: 'pdf', label: 'Приказ об утверждении показателей эффективности деятельности профессорско-преподавательского состава', link: '' },
      { type: 'pdf', label: 'Положение о премировании работников СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Договора об оказании платных образовательных услуг', link: '' },
      { type: 'pdf', label: 'Об установлении стоимости платных государственных образовательных услуг', link: '' },
      { type: 'pdf', label: 'Положение об оказании платных образовательных услуг', link: '' },
      { type: 'pdf', label: 'Положение об оказании платных образовательных услуг по дополнительным профессиональным программ (ДПП)', link: '' },
      { type: 'pdf', label: 'Положение о правилах приема на обучение по дополнительным профессиональным программам (ДПП)', link: '' },
      { type: 'pdf', label: 'Положение об итоговой аттестации слушателей, обучающихся по дополнительным профессиональным программам', link: '' },
      { type: 'pdf', label: 'Порядок приема в СКФ МТУСИ для обучения по договорам об оказании платных образовательных услуг', link: '' },
      { type: 'pdf', label: 'Положение об установлении оснований и порядка снижения стоимости платных образовательных услуг', link: '' },
      { type: 'pdf', label: 'Положение о порядке проведения аттестации работников, занимающих должности педагогических работников, относящихся к профессорско-преподавательскому составу СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение о конкурсной комиссии по проведению конкурса на замещение должностей научных работников СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Порядок проведения конкурса на замещение должностей научных работников СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Приказ Рособрнадзора от 29.06.2017 №1078 О государственной аккредитации образовательной деятельности ордена Трудового Красного Знамени федерального государственного бюджетного образовательного учреждения высшего образования «Московский технический университет связи и информатики»', link: '' },
      { type: 'pdf', label: 'Распоряжение Федеральной службы по надзору в сфере образования и науки от 18.03.2015 № 778-06 О переоформлении лицензии федеральному государственному образовательному бюджетному учреждению высшего профессионального образования Московскому техническому университету связи и информатики', link: '' },
      { type: 'pdf', label: 'Приказ о закреплении дисциплин по кафедрам 2020-2021', link: '' },
      { type: 'pdf', label: 'Положение о комиссии по урегулированию споров между участниками образовательных отношений', link: '' },
      { type: 'pdf', label: 'Положение о порядке пользования учебниками и учебными пособиями обучающимися, осваивающими учебные курсы, дисциплины (модули) за пределами ФГОС ВО и (или) получающими платные образовательные услуги', link: '' },
      { type: 'pdf', label: 'Порядок представления к присвоению ученого звания профессора и доцента по научной специальности', link: '' },
      { type: 'pdf', label: 'Положение об оплате труда работников СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Положение о профориентационной работе в СКФ МТУСИ', link: '' },
      { type: 'pdf', label: 'Функциональные обязанности руководителей и членов создаваемых комиссий, звеньев и постов', link: '' },
      { type: 'pdf', label: 'Сводная ведомость результатов проведения специальной оценки условий труда 2015', link: '' },
      { type: 'pdf', label: 'Сводная ведомость результатов проведения специальной оценки условий труда 2017', link: '' },
      { type: 'pdf', label: 'Сводная ведомость результатов проведения специальной оценки условий труда 2018', link: '' },
      { type: 'pdf', label: 'Сводная ведомость результатов проведения специальной оценки условий труда 2019', link: '' }
    ]

    return {
      documents
    }
  },
}
</script>