<template>
  <q-page padding>
    <div class="row" >
      <div class="col-12 q-my-xl">
        <span class="text-h3 text-grey-10">Внеучебная деятельность</span>
      </div>
      <div class="col-12 text-subtitle1">
          <span class="text-h5 text-grey-10">О деятельности Студенческого совета</span>
      </div>
      <div class="col-12">
        <div class="row">
          <div class="col-md-8 col-12 text-subtitle1 q-my-xl">
            На базе СКФ МТУСИ действует Студенческий совет, деятельность которого регламентируется Положением о Студенческом совете.
            Студенческий совет СКФ МТУСИ является высшим органом студенческого самоуправления и создается в целях обеспечения реализации прав обучающихся на участие в управлении образовательным процессом, информирования подразделений Филиала об удовлетворенности учебным процессом внутренних потребителей (студенческой молодежи), развития социальной активности, поддержки и реализации социальных инициатив молодежи.
          </div>
          <div class="col-md-4 col-12">
            <q-img
              class="rounded-2rem" src="/images/extracurricular/01_1.jpg"
            ></q-img>
          </div>
        </div>
      </div>
      <div class="col-12 text-subtitle1">
          <span class="text-h5 text-grey-10">О деятельности Студенческого отряда волонтеров</span>
      </div>
      <div class="col-12">
        <div class="row">
          <div class="col-md-3 col-12 q-my-xl">
            <q-img
              class="rounded-2rem" src="/images/extracurricular/02_2.jpg" width = "300px"
            ></q-img>
          </div>
          <div class="col-md-8 col-12 text-subtitle1 q-my-xl">
            На базе СКФ МТУСИ действует Студенческий отряд волонтеров, деятельность которого регламентируется Положением о Студенческом отряде волонтеров. Студенческий отряд волонтеров СКФ МТУСИ (далее — Филиал) — это добровольное общественное объединение студенческой молодежи, созданное по инициативе студентов и преподавателей. Основная цель – осуществление полезной для общества деятельности (оказание различных видов помощи больным и осиротевшим детям, профилактика асоциальных форм поведения) в свободное от учебы время.
            В своей деятельности Студенческий отряд Филиала руководствуется Конституцией Российской Федерации, федеральными законами, постановлениями и распоряжениями федеральных органов управления образованием, органов местного самоуправления, положением о Филиале и настоящим Положением.
            Членами Студенческого отряда Филиала могут быть студенты дневного и заочного факультетов, не имеющие медицинских противопоказаний для выполняемых отрядом видов деятельности, признающие настоящие Положение.
            Не первый год студенты нашего филиала активно участвуют в волонтерской программе. С сентября 2018г. волонтерский отряд СКФ МТУСИ проводит свою миссию в «Союзе пенсионеров России — Союзе пенсионеров Дона».
            Ребята активно и с энтузиазмом взялись помогать гражданам старшего поколения осваивать компьютерную азбуку, знакомить их с возможностями всемирной сети Интернет, помогают обучиться пользованию современными мобильными телефонными устройствами. Пожилые люди, несмотря на возраст, занимают активную жизненную позицию.
            Сотрудничество СКФ МТУСИ и «Союза пенсионеров России – Союза пенсионеров Дона» взаимно полезно и приятно. А еще в 2018г. в подготовке и организации Чемпионата мира по футболу FIFA 2018 принимал участие наш волонтер Давид Довжанский. 
            Чтобы стать волонтером, необходимо хорошо владеть английским языком, иметь отличные коммуникативные навыки, организаторские способности, уметь работать в команде. Давид успешно прошел все отборочные туры и на Чемпионате работал в команде волонтеров, которая помогала прессе, а также ребята помогали в проведении всех игр, проходивших на стадионе «Ростов-Арена» в г.Ростове-на-Дону.
          </div>
          <div class="col-md-4 col-12">
            <q-img class = "q-ma-md rounded-2rem"
              src="/images/extracurricular/03_2.jpg" width = "400px" :ratio="4/3"
            ></q-img>
          </div>
          <div class="col-md-4 col-12">
            <q-img class = "q-ma-md rounded-2rem"
              src="/images/extracurricular/03_1.jpg" width = "400px" :ratio="4/3" :img-style="{ borderRadius: '2rem' }"
            ></q-img>
          </div>
          <div class="col-md-4 col-12">
            <q-img class = "q-ma-md rounded-2rem"
              src="/images/extracurricular/03_3.jpg" width = "400px" :ratio="4/3" :img-style="{ borderRadius: '2rem' }"
            ></q-img>
          </div> 
        </div>
      </div>
      <div class="col-12 text-subtitle1 q-my-xl">
          <span class="text-h5 text-grey-10">Профилактика противоправного поведения молодежи</span>
      </div>
      <div class="col-12">
        <div class="row"> 
          <div class="col-md-8 col-12 text-subtitle1">
            Одной из самых актуальных и социально значимых задач, стоящих перед нашим обществом сегодня, а соответственно, и перед наших вузом, является поиск путей снижения роста преступности среди молодежи. В целях повышения эффективности проводимой работы по предотвращению правонарушений в нашем вузе проводятся адаптационные информационно-разъяснительные мероприятия для студентов первых курсов, где проходит беседа в рамках предотвращения правонарушений и террористической деятельности.
            В течение учебного года для всех обучающихся проводятся встречи с представителями правоохранительных органов, рассказывающих об ответственности за противоправные нарушения.<br>
            В вузе осуществляется реализация программ и проектов, направленных против употребления молодежью психоактивных веществ и на формирование навыков здорового образа жизни.
          </div>
          <div class="col-md-4 col-12 q-mb-xl">
            <q-img
              class="rounded-2rem" src="/images/extracurricular/04_1.jpg" width = "450px"
            ></q-img>
          </div>
          <div class="col-md-4 col-12 q-pa-md" v-for="pic in prevent" :key="pic">
            <q-img class="rounded-2rem" :src="pic" :ratio="4/3" width="400px"></q-img>
          </div>
        </div>
      </div>
      <div class="col-12 text-subtitle1 q-my-xl">
          <span class="text-h5 text-grey-10">Студенты и наука</span>
      </div>
      <div class="row"> 
          <div class="col-12 text-subtitle1">
            Так как мы технический вуз, то наравне с различными творческими кружками у нас при кафедрах работают и научные кружки. Под руководством научных руководителей- преподавателей нашего вуза — ребята занимаются интересными разработками, ежегодно участвуют в международной научно-практической конференции «Инфоком», а также в Донском образовательном фестивале «Образование. Карьера. Бизнес».
          </div>
      </div>
        <div class="col-md-4 col-12">
            <q-img class = "q-ma-md rounded-2rem"
              src="/images/extracurricular/05_1.jpg" width = "400px" :ratio="4/3"
            ></q-img>
        </div>
        <div class="col-md-4 col-12">
            <q-img class = "q-ma-md rounded-2rem"
              src="/images/extracurricular/05_2.jpg" width = "400px" :ratio="4/3"
            ></q-img>
        </div>
        <div class="col-md-4 col-12">
            <q-img class = "q-ma-md rounded-2rem"
              src="/images/extracurricular/05_3.jpg" width = "400px" :ratio="4/3"
            ></q-img>
        </div>
      <div class="col-12 text-subtitle1 q-my-xl">
          <span class="text-h5 text-grey-10">Патриотическое воспитание, проводимое в СКФ МТУСИ</span>
      </div>
      <div class="col-12">
        <div class="row"> 
          <div class="col-md-8 col-12 text-subtitle1">
            В настоящее время в России патриотическое воспитание стало одной из основных задач национальной политики. Вся учебно-воспитательная работа в СКФ МТУСИ направлена на формирование патриотизма, который включает в себя:
          </div>
        </div>
      </div>
      <div class="col-12 text-subtitle1">
          <ul class="text-subtitle1">
            <li>чувство привязанности к тем местам, где человек родился и вырос;</li>
            <li>уважительное отношение к языку своего народа;</li>
            <li>заботу об интересах Родины;</li>
            <li>осознание долга перед Родиной, отстаивание ее чести и достоинства, свободы и независимости;</li>
            <li>проявление гражданских чувств и сохранение верности Родине;</li>
            <li>гордость за социальные и культурные достижения своего Отечества, за символы государства и его народ;</li>
            <li>чувство уважения к истории Родины и народа, его обычаям и традициям;</li>
            <li>ответственность за судьбу государства и его народа, за их будущее, которое выражается в стремлении посвящать весь свой труд и способности укреплению могущества и расцвету Родины;</li>
            <li>гуманизм, милосердие, общечеловеческие ценности.</li>
          </ul>
      </div>
      <div class="col-12">
        <div class="row"> 
          <div class="col-12 text-subtitle1">
            В вузе проводится множество различных мероприятий, способствующих патриотическому воспитанию. К ним относятся встречи с представителями Вооруженных Сил России, а также праздничные концерты, посвященные государственным праздникам, таким как «День Победы», «День защитника Отечества», «День освобождения г.Ростова-на-Дону от немецко-фашистских захватчиков», «День России», а также мероприятия, посвященные памятным датам России, таким как «День солидарности в борьбе с терроризмом» и «День памяти и скорби».
          </div>
        </div>
      </div>
      <div class="col-md-6 col-12">
        <q-img class = "q-ma-md rounded-2rem"
            src="/images/extracurricular/06_1.jpg" width = "500px" :ratio="4/3"
        ></q-img>
      </div>
      <div class="col-md-6 col-12">
        <q-img class = "q-ma-md rounded-2rem"
            src="/images/extracurricular/06_2.jpg" width = "500px" :ratio="4/3"
        ></q-img>
      </div>
      <div class="col-12">
        <div class="row"> 
          <div class="col-8 text-subtitle1 q-my-xl">
            Также к патриотическим мероприятиям можно отнести и возложение цветов к памятнику изобретателю радио, русскому ученому А.С. Попову.
            Не менее важным событием в жизни первокурсников является традиция устраивать в первых числах сентября «Посвящение в студенты» у скульптурной композиции «Связистам Дона» в парке им. Островского. В церемонии посвящения в студенты-связисты принимают участие Министр информационных технологий и связи Ростовской области Герман Анатолиевич Лопаткин и председатель Ростовского областного комитета профсоюза работников связи России Алексей Иванович Машкин, а также другие почетные гости.
          </div>
          <div class="col-md-4 col-12">
            <q-img class = "q-ma-md rounded-2rem"
                src="/images/extracurricular/06_3.jpg" width = "500px" :ratio="4/3"
            ></q-img>
          </div>
        </div>
      </div>
      <div class="col-12 text-subtitle1 q-my-xl">
          <span class="text-h5 text-grey-10">Деятельность студенческой художественной самодеятельности</span>
      </div>
      <div class="col-12">
        <div class="row"> 
          <div class="col-12 text-subtitle1">
            Одной из наиболее эффективных форм воспитания студенческой молодежи является вовлечение студентов в творческую деятельность, органически связанную с их профессиональным становлением. Ведь будущий связист – это человек, разбирающийся не только в технике, но нравственно и духовно развитый.
            В СФК МТУСИ работают следующие творческие мастерские и клубы:
            танцевальная студия «Вольта», эстрадно-джазовая студия «Надежда», СТЭМ «На связи». Ребята увлекаются спортом. Есть у нас и клуб шахматистов «На коне». В 2015 г. танцевальная студия «Вольта» получила звание Лауреата VI молодежного областного фестиваля театрального искусства «Мельница», лауреата Межвузовского фестиваля «Наследники Победы», в 2016 г. награждена почетной грамотой за участие в фестивале «Мельница» в номинации «Лучший авторский номер».
            В 2018г. коллектив художественной самодеятельности СКФ МТУСИ в полном составе выступил на Фестивале творческих коллективов организаций связи Ростовской области. Выступление наших ребят отличалось изяществом и экспрессией, что было оценено строгим жюри. Мы заняли 1 место среди учебных заведений.
          </div>
          <div class="col-md-4 col-12 q-my-xl" v-for="pic in artwork" :key="pic">
            <q-img class="rounded-2rem" :src="pic" :ratio="4/3" width="400px"></q-img>
          </div>
        </div>
      </div>
      <div class="col-12 text-subtitle1 q-my-xl">
          <span class="text-h5 text-grey-10">Расписание работы творческих мастерских и клубов</span>
      </div>
      <div class="col-md-4 col-12 q-pa-md" v-for="c in club" :key="c.title">
            <q-card class="text-center shadow-10">
              <q-card-section>
                  <q-icon class="rounded-2rem" size="70px" :name="c.icon" color="primary">
                  </q-icon>
              </q-card-section>
              <q-card-section>
                <span class="text-h5">{{c.title}}</span>
              </q-card-section>
              <q-card-section>
                <span v-html="c.description"></span>
              </q-card-section>
            </q-card>
          </div>
    </div>
  </q-page>
</template>

<script>
export default {
  setup() {
      const prevent = [
          "/images/extracurricular/04_2.jpg",
          "/images/extracurricular/04_3.jpg",
          "/images/extracurricular/04_4.jpg",
          "/images/extracurricular/04_5.jpg",
          "/images/extracurricular/04_6.jpg",
          "/images/extracurricular/04_7.jpg"
      ]
      const artwork = [
          "/images/extracurricular/07_1.jpg",
          "/images/extracurricular/07_3.jpg",
          "/images/extracurricular/07_4.jpg",
      ]
      const club = [
      { icon: 'mdi-dance-ballroom', title: 'Танцевальная студия «Вольта»', description: 'Руководитель танцевальной студии – тренер по спортивным танцам, <br/>судья по Спортивным танцам 3 категории Майоров Глеб Николаевич.<br/>Расписание занятий:<br/>Вторник 13.00. — 15.00.<br/>Четверг – 13.00 – 15.00\nМесто проведения: Зал репетиций (ауд.115)' },
      { icon: 'mdi-microphone-variant', title: 'Вокальная эстрадно-джазовая студия «Надежда»', description: 'Руководитель эстрадно-джазовой студии — преподаватель вокала Баратова Кристина Михайловна.<br/>Расписание занятий:<br/>Среда – 13.00 – 15.00<br/>Пятница – 13.00 – 15.00<br/>Место проведения: Зал репетиций (ауд.115, актовый зал (ауд.307))' },
      { icon: 'mdi-drama-masks', title: '«СТЭМ» — студенческий театр эстрадных миниатюр', description: 'Организатор и ответственный – студент гр. ДЗ-31 Алиев Мустафа Иссаевич.<br/>Расписание занятий:<br/>Понедельник – 13.00 – 14.30<br/>Пятница – 13.00 – 14.30<br/>Место проведения: Зал репетиций (ауд.115)' },
      { icon: 'mdi-chess-pawn', title: 'Шахматный кружок «На коне»', description: 'Ответственный – студент гр. ДИ-21 Тайсунов Микаил<br/>Расписание занятий:<br/>Понедельник – 13.00. – 14.00.' },
      { icon: 'mdi-guitar-acoustic', title: 'Студия по обучению игре на гитаре', description: 'Руководитель студии — преподаватель по классу струнных инструментов,<br/>Лауреат международных конкурсов Буцаленко Сергей Николаевич<br/>Расписание занятий:<br/>Пятница – 13.00. — 15.00<br/>Суббота – 13.00.- 15.00.<br/>Место проведения: Зал репетиций (ауд.115)' },
      { icon: 'mdi-gamepad', title: 'Киберспортивный клуб', description: 'Капитан — студент гр. ДС-31 Ухов Павел Эдуардович<br/>Расписание тренировок – по договоренности игроков.' },
    ]
  return {prevent,
          artwork,
          club}
  }
  }
</script>

<style scoped>
ul {
  list-style: none;
  margin-left: 0;
  padding-left: 0;
}
li {
  padding-left: 1em;
  text-indent: -1em;
  margin-bottom: 1.5em;
}
li:before {
  content: "—";
  padding-right: 5px;
}
</style>