<template>
  <q-page padding>
    <div class="row">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Модульно рейтинговая система</span>
      </div>
      <div class="col-12 q-my-xl">
        <div class="row">
            <div class="col-12 col-md-10">
                <span class="text-h6 text-grey-9">
                    Модульно-рейтинговая система – это совокупность правил, методических указаний и соответствующего математического аппарата, реализованного в программном комплексе, обеспечивающем обработку информации, как по количественным, так и по качественным показателям индивидуальной учебной деятельности студентов, позволяющем присвоить персональный рейтинг (интегральную оценку, число) каждому студенту в разрезе любой учебной дисциплины, любого вида занятий.
                    Цель модульно-рейтингового обучения состоит в том, чтобы создать условия для мотивации самостоятельности учащихся средствами своевременной и систематической оценки результатов их работы в соответствии с реальными достижениями.
                </span>
            </div>
            <div class="col-12 col-md-10 q-my-xl">
                <span class="text-h4 text-grey-9">
                    Основной алгоритм рейтинговой системы контроля знаний:<br>
                </span>
                <div class="text-h6 text-grey-9 q-my-md">
                    <span class="text-h4 text-primary">01.</span>&nbsp;весь курс обучения по дисциплине разбивается на тематические разделы, контроль по которым обязателен;<br><br>
                    <span class="text-h4 text-primary">02.</span>&nbsp;по окончании изучения каждого раздела проводится достаточно полный контроль знаний учащийся с оценкой в баллах;<br><br>
                    <span class="text-h4 text-primary">03.</span>&nbsp;в конце обучения определяется сумма баллов набранных за весь период и выставляется общая отметка.<br><br>
                </div>
            </div>
        </div>
      </div>
    </div>
  </q-page>
</template>