<template>
  <q-page padding>
    <div class="row">
      <div class="col-12 q-my-xl">
        <span class="text-grey-10 text-h3">Приемная комиссия</span>
      </div>
      <div class="col-12 text-subtitle1">
        Дорогие наши абитуриенты! Студенчество – самая удивительная пора, когда нужно успеть многое: и взрослеть, и постигать науку, и делать первые шаги в будущей профессии.<br/><br/>
        Желаем Вам успешного поступления!
      </div>
      <div class="col-12 q-my-xl">
        <span class="text-grey-10 text-h4">Перечень необходимых документов:</span>
      </div>
      <div class="col-12 q-mb-xl">
        <ul class="text-subtitle1">
          <li>документ (документы), удостоверяющий личность, гражданство;</li>
          <li>документ установленного образца об образовании или об образовании и квалификации (аттестат/диплом);</li>
          <li>СНИЛС;</li>
          <li>документ (документы), подтверждающий особое право или преимущество при поступлении (при наличии);</li>
          <li>2 фотографии размером 3х4 см (для сдающих вступительные испытания, проводимые СКФ МТУСИ самостоятельно);</li>
          <li>копия трудовой книжки или справка с места работы (для поступающих на заочную форму обучения);</li>
          <li>иные документы (представляются по усмотрению поступающего).</li>
        </ul>
      </div>
      <div class="col-12 q-mb-xl">
        <span class="text-grey-10 text-h4">Сроки приема документов:</span>
      </div>
      <div class="col-12 q-mb-xl">
        <div class="row">
          <div class="col-md-6 col-12">
            <div class="row q-px-md">
              <div class="col-1 text-h4 text-primary">01.</div>
              <div class="col-11 text-h4">Очная форма обучения</div>
              <div class="col-11 offset-1">
                <ul class="text-subtitle1">
                  <li>
                    <span class="text-h5 q-mb-md">15 июня — 19 июля 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ по результатам вступительных испытаний, проводимых вузом самостоятельно, на места в рамках контрольных цифр приема
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">15 июня — 25 июля 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ только по результатам ЕГЭ, на места в рамках контрольных цифр приема
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">15 июня — 16 августа 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ по результатам вступительных испытаний, проводимых вузом самостоятельно, по договорам об оказании платных образовательных услуг
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">15 июня — 20 августа 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ только по результатам ЕГЭ, по договорам об оказании платных образовательных услуг
                  </li>
                </ul>
              </div>
            </div>
          </div>
          <div class="col-md-6 col-12">
            <div class="row q-px-md">
              <div class="col-1 text-h4 text-primary">02.</div>
              <div class="col-11 text-h4">Заочная форма обучения</div>
              <div class="col-11 offset-1">
                <ul class="text-subtitle1">
                  <li>
                    <span class="text-h5 q-mb-md">1 марта — 16 августа 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ по результатам вступительных испытаний, проводимых вузом самостоятельно, на места в рамках контрольных цифр приема
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">1 марта — 20 августа 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ только по результатам ЕГЭ, на места в рамках контрольных цифр приема
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">1 марта — 13 сентября 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ по результатам вступительных испытаний, проводимых вузом самостоятельно, по договорам об оказании платных образовательных услуг
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">1 марта — 17 сентября 2021 г.</span> <br/>
                    для лиц, поступающих в СКФ МТУСИ только по результатам ЕГЭ, по договорам об оказании платных образовательных услуг
                  </li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div class="col-12 q-mb-xl">
        <span class="text-grey-10 text-h4">Варианты подачи документов</span>
      </div>
      <div class="col-12 q-mb-xl">
        <div class="row">
          <div class="col-md-4 col-12">
            <q-card flat>
              <q-card-section>
                <span class="text-h4">Лично</span>
              </q-card-section>
              <q-card-section class="text-subtitle1">
                Прием документов проводится в помещении приемной комиссии по адресу: ул. Серафимовича 62, комната №105, с 9 до 18 часов в будние дни, с 9 до 13 часов в субботу.
              </q-card-section>
              <q-card-section class="text-subtitle1">
                Ответственный секретарь приемной комиссии — <br/>
                Докучаев Сергей Аркадьевич.
              </q-card-section>
              <q-card-actions vertical>
                <span>Телефон: <span class="text-primary">8(863)310-69-70</span></span>

                <span>E-mail: <span class="text-primary">priem@skf-mtusi.ru</span></span>
              </q-card-actions>
            </q-card>
          </div>
          <div class="col-md-4 col-12">
            <q-card flat>
              <q-card-section>
                <span class="text-h4">Онлайн</span>
              </q-card-section>
              <q-card-section class="text-subtitle1">
                 Документы, необходимые для поступления, направляются в СКФ МТУСИ в электронной форме одним из следующих способов:
              </q-card-section>
              <q-card-section class="text-subtitle1">
                а) посредством электронной информационной системы МТУСИ (личный кабинет абитуриента) <a href="https://abitur.mtuci.ru#!register_skf">https://abitur.mtuci.ru#!register_skf</a>;
              </q-card-section>
              <q-card-section class="text-subtitle1">
                б) на электронный адрес priem@skf-mtusi.ru.
              </q-card-section>
              <q-card-section class="text-subtitle1">
                Документы представляются в СКФ МТУСИ в форме их электронных образов (документов на бумажном носителе, преобразованных в электронную форму путем сканирования или фотографирования с обеспечением машиночитаемого распознавания его реквизитов)
              </q-card-section>
            </q-card>
          </div>
          <div class="col-md-4 col-12">
            <q-card flat>
              <q-card-section>
                <span class="text-h4">Почтой</span>
              </q-card-section>
              <q-card-section class="text-subtitle1">
                 Документы поступающих в СКФ МТУСИ могут быть высланы почтовой связью по адресу:
              </q-card-section>
              <q-card-section class="text-subtitle1">
               344002, г. Ростов-на-Дону, ул. Серафимовича д.62, Приёмная комиссия.
              </q-card-section>
            </q-card>
          </div>
        </div>
      </div>
      <div class="col-12 q-mb-xl">
        <span class="text-grey-10 text-h4">Сроки зачисления</span>
      </div>
      <div class="col-12 q-mb-xl">
        <div class="row">
          <div class="col-md-6 col-12">
            <div class="row q-px-md">
              <div class="col-1 text-h4 text-primary">01.</div>
              <div class="col-11 text-h4">Очная форма обучения</div>
              <div class="col-11 offset-1">
                <ul class="text-subtitle1">
                  <li>
                    <span class="text-h5 q-mb-md">27 июля 2021 г.</span> <br/>
                    осуществляется публикация конкурсных списков
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">28 – 30 июля 2021 г.</span> <br/>
                    проводится этап приоритетного зачисления, на котором осуществляется зачисление лиц, поступающих без вступительных испытаний, поступающих на места в пределах квот;
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">3 – 5 августа 2021 г.</span> <br/>
                    проводится основной этап зачисления, на котором осуществляется зачисление лиц, поступающих по результатам вступительных испытаний на основные места в рамках контрольных цифр, оставшиеся после зачисления без вступительных испытаний (далее – основные конкурсные места);
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">28 июля 2021 г.</span> <br/>
                    день завершения приема заявлений о согласии на зачисление от лиц, подлежащих зачислению на этапе приоритетного зачисления
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">3 августа 2021 г.</span> <br/>
                    день завершения приема заявлений о согласии на зачисление от лиц, подлежащих зачислению на на основном этапе зачисления
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">30 июля 2021 г.</span> <br/>
                    издание приказа (приказов) о зачислении на этапе приоритетного зачисления
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">5 августа 2021 г.</span> <br/>
                    издание приказа (приказов) о зачислении на основном этапе зачисления
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">до 23 августа 2021 г. (платное)</span> <br/>
                    подачи заявления о согласии на зачисление на места по договорам об оказании платных образовательных услуг:
                    успешная сдача вступительных испытаний;
                    подача заявления о согласии на зачисление, к которому прилагается оригинал документа установленного образца либо его копия, заверенная в установленном порядке, либо его копия с предъявлением оригинала для заверения копии приемной комиссией до 23 августа 2021 г. включительно;
                    заключение договора об оказании платных образовательных услуг и подтверждения оплаты по договору за первый семестр обучения в Университете до 23 августа 2021 г. включительно
                  </li>
                </ul>
              </div>
            </div>
          </div>
          <div class="col-md-6 col-12">
            <div class="row q-px-md">
              <div class="col-1 text-h4 text-primary">02.</div>
              <div class="col-11 text-h4">Заочная форма обучения</div>
              <div class="col-11 offset-1">
                <ul class="text-subtitle1">
                  <li>
                    <span class="text-h5 q-mb-md">21 августа 2021 г.</span> <br/>
                    осуществляется публикация конкурсных списков
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">22 августа 2021 г.</span> <br/>
                    день завершения приема заявлений о согласии на зачисление от лиц, подлежащих зачислению на этапе приоритетного зачисления
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">23 августа 2021 г</span> <br/>
                    день завершения приема заявлений о согласии на зачисление от лиц, подлежащих зачислению на на основном этапе зачисления
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">24 августа 2021 г.</span> <br/>
                    издание приказа (приказов) о зачислении на этапе приоритетного зачисления
                  </li>
                  <li>
                    <span class="text-h5 q-mb-md">до 23 сентября 2021 г. (платное)</span> <br/>
                    подачи заявления о согласии на зачисление на места по договорам об оказании платных образовательных услуг:
                    успешная сдача вступительных испытаний;
                    подача заявления о согласии на зачисление, к которому прилагается оригинал документа установленного образца либо его копия, заверенная в установленном порядке, либо его копия с предъявлением оригинала для заверения копии приемной комиссией до 23 сентября 2021 г. включительно;
                    заключение договора об оказании платных образовательных услуг и подтверждения оплаты по договору за первый семестр обучения в Университете до 23 сентября 2021 г. включительно.
                  </li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>

export default ({
  name: 'AbitureintJoin',
  setup() {
    
  },
})
</script>

<style scoped>
ul {
  list-style: none;
  margin-left: 0;
  padding-left: 0;
}
li {
  padding-left: 1em;
  text-indent: -1em;
  margin-bottom: 1.5em;
}
li:before {
  content: "—";
  padding-right: 5px;
}
</style>
