<template>
  <q-page padding>
    <div class="row q-mx-xl">
      <div class="col-12 q-my-xl">
        <span class="text-h3 text-grey-10">Формы обучения: очная и заочная</span>
      </div>
      <q-card class="text-subtitle1" flat>
        <q-card-section>
          В соответствии со Свидетельством о государственной аккредитации от 29.06.2017 г. № 2631, СКФ МТУСИ ведет образовательную деятельность в сфере высшего образования и имеет право на выдачу выпускникам, прошедшим итоговую государственную аттестацию, документов государственного образца с указанием квалификации по реализуемым образовательным программам.
        </q-card-section>
        <q-card-section>
          Прием граждан в университет осуществляется в соответствии с лицензией Федеральной службы по надзору в сфере образования и науки № 2103 от 21.04.2016, на ведение образовательной деятельности по соответствующим направлениям подготовки.
        </q-card-section>
        <q-card-section>
          СКФ МТУСИ осуществляет прием студентов по очной и заочной формам обучения по следующим направлениям:<br/>
          <b>09.03.01</b> «Информатика и вычислительная техника»<br/>
          <b>11.03.02</b> «Инфокоммуникационные технологии и системы связи»<br/>
          С профилированием в области:
          <ul>
            <li>Сети связи и системы коммутации</li>
            <li>Многоканальные телекоммуникационные системы</li>
            <li>Защищенные системы и сети связи</li>
            <li>Системы радиосвязи и радиодоступа</li>
            <li>Вычислительные машины, комплексы, системы и сети</li>
            <li>Программное обеспечение и интеллектуальные системы</li>
          </ul>
        </q-card-section>
        <q-card-section>
          Задачи совершенствования и развития средств связи могут решать только всесторонне подготовленные специалисты, имеющие глубокие и прочные знания по таким общеобразовательным предметам, как русский язык, математика, информатика и физика. Именно эти предметы определяют перечень вступительных испытаний на первый курс университета. По этой же причине изучению специальных дисциплин на старших курсах предшествует многосторонняя, глубокая подготовка по математике, физике, информатике, а также по теории электрических цепей, теории электрической связи, по вычислительной технике, программированию и др.
          <br/>
          <br/>
          Приобретение специальных знаний обеспечивается рядом таких дисциплин, как автоматические системы коммутации, системы многоканальной связи, технические средства обработки информации, линии связи и др.
          <br/>
          <br/>
          На направления «Инфокоммуникационные технологии и системы связи» и «Информатика и вычислительная техника» предоставляются свидетельства ЕГЭ или проводятся вступительные испытания (для имеющих среднее профессиональное образование) по математике, русскому языку, физике или информатике
        </q-card-section>
      </q-card>
    </div>
  </q-page>
</template>

<script>

export default ({
  setup() {
    
  },
})
</script>
