<template>
  <q-page padding>
    <div class="row q-mx-xl">
      <div class="col-12 q-my-xl">
        <span class="text-grey-10 text-h3">Образование</span><br/>
        <span class="text-overline">Информация об общественной аккредитации: «Общественная аккредитация не проводилась»</span>
      </div>
      <div class="col-12">
        <q-table
          title="Информация о сроке действия государственной аккредитации образовательной программы, о языках, на которых осуществляется образование (обучение)"
          :rows="programsEducationRow"
          :columns="programsEducationKey"
          row-key="name"
          wrap-cells
        ></q-table>
      </div>
      <div class="col-12 q-my-xl">
        <q-table
          title="Численность обучающихся (на 01.10.2021)"
          :rows="countLearnersRow"
          :columns="countLearnersKey"
          row-key="name"
          wrap-cells
        ></q-table>
      </div>
      <div class="col-12">
        <q-table
          title="Перевод, восстановление и отчисление студентов (на 01.10 2021)"
          :rows="movmentStudentsRow"
          :columns="movmentStudentsKey"
          row-key="name"
          wrap-cells
        ></q-table>
      </div>
      <div class="col-12 q-my-xl">
        <q-table
          title="Информация по образовательным программам"
          :rows="programmInfRow"
          :columns="programmInfKey"
          row-key="name"
          wrap-cells
        ></q-table>
      </div>
      <div class="col-12">
        <q-table
          title="Направления и результаты научной деятельности"
          :rows="directResultsRow"
          :columns="directResultsKey"
          row-key="name"
          wrap-cells
        ></q-table>
      </div>
    </div>
  </q-page>
</template>

<script>
  export default {
    name: 'Education',
    setup() {
      const programsEducationKey = [
        { name: 'code', label: 'Код', field: 'code', align: 'left' },
        { name: 'named', label: 'Наименование профессии, специальности, направления подготовки', field: 'named', align: 'left' },
        { name: 'level', label: 'Уровень образования', field: 'level', align: 'left' },
        { name: 'forms', label: 'Формы обучения', field: 'forms', align: 'left' },
        { name: 'time', label: 'Нормативный срок обучения', field: 'time', align: 'left' },
        { name: 'acriditated', label: 'Срок действия государственной аккредитации (дата окончания действия свидетельства о государственной аккредитации)', field: 'acriditated', align: 'left' },
        { name: 'lang', label: 'Языки, на которых осуществляется образование (обучение)', field: 'lang', align: 'left' }
      ]
      const programsEducationRow = [
        { code: '09.03.01', named: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Вычислительные машины, комплексы, системы и сети', level: 'Бакалавриат академический', forms: 'Очная', time: '4 года', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '09.03.01', named: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Вычислительные машины, комплексы, системы и сети', level: 'Бакалавриат академический', forms: 'Заочная', time: '4 года 8 мес.', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '09.03.01', named: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Программное обеспечение и интеллектуальные системы', level: 'Бакалавриат академический', forms: 'Очная', time: '4 года', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '09.03.01', named: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Программное обеспечение и интеллектуальные системы', level: 'Бакалавриат академический', forms: 'Заочная', time: '4 года 8 мес', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: 'Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Защищенные системы и сети связи', level: 'Бакалавриат академический', forms: 'Очная', time: '4 года', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: 'Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Защищенные системы и сети связи', level: 'Бакалавриат академический', forms: 'Заочная', time: '4 года 8 мес.', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: 'Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Многоканальные телекоммуникационные системы', level: 'Бакалавриат академический', forms: 'Очная', time: '4 года', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: 'Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Многоканальные телекоммуникационные системы', level: 'Бакалавриат академический', forms: 'Заочная', time: '4 года 8 мес.', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: 'Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Сети связи и системы коммутации', level: 'Бакалавриат академический', forms: 'Очная', time: '4 года', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: '	Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Сети связи и системы коммутации', level: 'Бакалавриат академический', forms: 'Заочная', time: '4 года 8 мес', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: 'Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Системы радиосвязи и радиодоступа', level: 'Бакалавриат академический', forms: 'Очная', time: '4 года', acriditated: '29.06.2023', lang: 'Русский' },
        { code: '11.03.02', named: 'Направление подготовки: Инфокоммуникационные технологии и системы связи; Профиль подготовки: Системы радиосвязи и радиодоступа', level: 'Бакалавриат академический', forms: 'Заочная', time: '4 года 8 мес', acriditated: '29.06.2023', lang: 'Русский' }
      ]

      const countLearnersKey = [
        { name: 'code', label: 'Код', field: 'code', align: 'left' },
        { name: 'direction', label: 'Направление подготовки, специальность', field: 'direction', align: 'left' },
        { name: 'level', label: 'Уровень образования', field: 'level', align: 'left' },
        { name: 'form', label: 'Форма обучения', field: 'form', align: 'left' },
        { name: 'federal', label: 'Численность обучающихся бюджетных ассигнований федерального бюджета', field: 'federal', align: 'left' },
        { name: 'subject', label: 'Численность обучающихся бюджетов субъектов Российской Федерации', field: 'subject', align: 'left' },
        { name: 'local', label: 'Численность обучающихся местных бюджетов', field: 'local', align: 'left' },
        { name: 'offer', label: 'Численность обучающихся по договорам об оказании платных образовательных услуг', field: 'offer', align: 'left' },
        { name: 'general', label: 'Общая численность обучающихся', field: 'general', align: 'left' }
      ]

      const countLearnersRow = [
        { code: '09.03.01', direction: 'Информатика и вычислительная техника', level: 'Бакалавриат академический', from: 'очная', federal: '90 / 0', subject: '0 / 0', local: '0 / 0', offer: '15 / 0', general: '105' },
        { code: '09.03.01', direction: 'Информатика и вычислительная техника', level: 'Бакалавриат академический', from: 'заочная', federal: '54 / 0', subject: '0 / 0	', local: '0 / 0	', offer: '87 / 0', general: '141' },
        { code: '11.03.02', direction: 'Инфокоммуникационные технологии и системы связи', level: 'Бакалавриат академический', from: 'очная', federal: '162 / 0', subject: '0 / 0', local: '0 / 0', offer: '13 / 0', general: '175' },
        { code: '11.03.02', direction: 'Инфокоммуникационные технологии и системы связи', level: 'Бакалавриат академический', from: 'заочная', federal: '160 / 0', subject: '0 / 0', local: '0 / 0', offer: '395 / 0', general: '555' }
      ]

      const movmentStudentsRow = [
        {
          code: '09.03.01',
          direction: 'ИВТ',
          level: 'Бакалавриат академический',
          form: 'очная',
          countOut: '2',
          countIn: '0',
          recovery: '0',
          dismiss: '3',
        },
        {
          code: '09.03.01',
          direction: 'ИВТ',
          level: 'Бакалавриат академический',
          form: 'заочная',
          countOut: '0',
          countIn: '0',
          recovery: '3',
          dismiss: '1',
        },
        {
          code: '11.03.02',
          direction: 'ИТСС',
          level: 'Бакалавриат академический',
          form: 'очная',
          countOut: '1',
          countIn: '0',
          recovery: '0',
          dismiss: '14',
        },
        {
          code: '11.03.02',
          direction: 'ИТСС',
          level: 'Бакалавриат академический',
          form: 'заочная',
          countOut: '0',
          countIn: '1',
          recovery: '6',
          dismiss: '0',
        }
      ]
      const movmentStudentsKey = [
        { name: 'code', label: 'Код', field: 'code', align: 'left' },
        { name: 'direction', label: 'Направление подготовки, специальность', field: 'direction', align: 'left' },
        { name: 'level', label: 'Уровень образования', field: 'level', align: 'left' },
        { name: 'form', label: 'Форма обучения', field: 'form', align: 'left' },
        { name: 'countOut', label: 'Численность обучающихся, переведенных в другие образовательные организации', field: 'countOut', align: 'left' },
        { name: 'countIn', label: 'Численность обучающихся, переведенных из других образовательных организаций', field: 'countIn', align: 'left' },
        { name: 'recovery', label: 'Численность восстановленных обучающихся', field: 'recovery', align: 'left' },
        { name: 'dismiss', label: 'Численность отчисленных обучающихся', field: 'dismiss', align: 'left' }
      ]

      const programmInfRow = [
        {
          code:'09.03.01',
          direction: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Вычислительные машины, комплексы, системы и сети(ФГОС-3++ 2021)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2021',
          plan: 'очная форма: 2021 заочная форма:2021',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2021 заочная форма: 2021',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'09.03.01',
          direction: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Программное обеспечение и интеллектуальные системы (ФГОС-3+)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2017',
          plan: 'очная форма: 2018 заочная форма: 2017, 2018',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2018 заочная форма: 2017, 2018',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'09.03.01',
          direction: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Программное обеспечение и интеллектуальные системы (ФГОС-3++ 2019)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2019',
          plan: 'очная форма: 2019, 2020 заочная форма: 2019, 2020',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2019, 2020 заочная форма: 2019, 2020',
          documents: 'Список методических и иных документов',
          practice: 'Учебная (ознакомительная) Производственная (технологическая) Производственная (проектно-технологическая)',
          distant: 'не используются',
        },
        {
          code:'09.03.01',
          direction: 'Направление подготовки: Информатика и вычислительная техника; Профиль подготовки: Программное обеспечение и интеллектуальные системы (ФГОС-3++ 2021)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2021',
          plan: 'очная форма: 2021 заочная форма: 2021',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2021 заочная форма: 2021',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Защищенные системы и сети связи (ФГОС-3+)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2017',
          plan: 'очная форма: 2018 заочная форма: 2017, 2018',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2018 заочная форма: 2017, 2018',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Защищенные системы и сети связи (ФГОС-3++ 2019)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2019',
          plan: 'очная форма: 2019, 2020 заочная форма: 2019, 2020',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2019,2020 заочная форма: 2019, 2020',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Защищенные системы и сети связи (ФГОС-3++ 2021)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2021',
          plan: 'очная форма: 2021 заочная форма: 2021',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2021 заочная форма: 2021',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Многоканальные телекоммуникацион-ные системы (ФГОС-3+)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2017',
          plan: 'очная форма:  заочная форма: 2017, 2018',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма:  заочная форма: 2017, 2018',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Многоканальные телекоммуникацион-ные системы (ФГОС-3++ 2019)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2019',
          plan: 'очная форма:  заочная форма: 2019',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма:  заочная форма: 2019',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Многоканальные телекоммуникацион-ные системы (ФГОС-3++ 2021)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2021',
          plan: 'очная форма: 2021 заочная форма: 2021',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2021 заочная форма: 2021',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Сети связи и системы коммутации (ФГОС-3+)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2017',
          plan: 'очная форма: 2018 заочная форма: 2017, 2018',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2018 заочная форма: 2017, 2018',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Сети связи и системы коммутации (ФГОС-3++ 2019)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2019',
          plan: 'очная форма: 2019, 2020 заочная форма: 2019, 2020',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2019, 2020 заочная форма: 2019, 2020',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Сети связи и системы коммутации (ФГОС-3++ 2021)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2021',
          plan: 'очная форма: 2021 заочная форма: 2021',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2021 заочная форма: 2021',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
        {
          code:'11.03.02',
          direction: 'Направление подготовки: Инфокоммуникацион-ные технологии и системы связи; Профиль подготовки: Системы радиосвязи и радиодоступа (ФГОС-3++ 2021)',
          level: 'Бакалавриат академический',
          form: 'Очная, заочная',
          discription: 'ООП 2021',
          plan: 'очная форма: 2021 заочная форма: 2021',
          annotation: 'аннотации',
          studyProg: 'не реализуем',
          calendar: 'очная форма: 2021 заочная форма: 2021',
          documents: 'Список методических и иных документов',
          practice: 'учебная практика производств. практика преддипл. практика',
          distant: 'не используются',
        },
      ]

      const programmInfKey = [
        { name: 'code', label: 'Код', field: 'code', align: 'left'},
        { name: 'direction', label: 'Наименование специальности, направления подготовки', field: 'direction', align: 'left'},
        { name: 'level', label: 'Уровень образования', field: 'level', align: 'left'},
        { name: 'form', label: 'Реализуемые формы обучения', field: 'form', align: 'left'},
        { name: 'discription', label: 'Ссылка на описание образовательной программы с приложением ее копии (в том числе РПД)', field: 'discription', align: 'left'},
        { name: 'plan', label: 'Ссылка на учебный план', field: 'plan', align: 'left'},
        { name: 'annotation', label: 'Ссылка на аннотации к рабочим программам дисциплин (по каждой дисциплине в составе образовательной программы)', field: 'annotation', align: 'left'},
        { name: 'studyProg', label: 'Ссылка на рабочие программы (по каждой дисциплине в составе образова- тельной программы) в виде электронного документа, подписанного электронной подписью', field: 'studyProg', align: 'left'},
        { name: 'calendar', label: 'Ссылка на календарный учебный график', field: 'calendar', align: 'left'},
        { name: 'documents', label: 'Ссылка на методические и иные документы, разработанные образовательной организацией для обеспечения образовательного процесса', field: 'documents', align: 'left'},
        { name: 'practice', label: 'Ссылка на рабочие программы практик, предусмотренных соответствующей образовательной программой', field: 'practice', align: 'left'},
        { name: 'distant', label: 'Использование при реализации образовательных программ электронного обучения и дистанционных образовательных технологий', field: 'distant', align: 'left'},
      ]

      const directResultsRow = [
        {
          code: '11.03.02',
          direction: 'ИТСС',
          level: 'бакалавриат',
          list: '1. Использование прикладного программного обеспечения для моделирования инфокоммуникационных сетей. 2. Разработка и исследование алгоритмов функционирования датчиков фазового фронта в адаптивных оптических системах передачи информации. 3. Разработка методов автоматизированного анализа результатов измерений для выделения контуров объектов в изображениях. 4. Разработка и исследование высокоэффективных помехоустойчивых алгоритмов в каналах радиосвязи, функционирующих в условиях плотной городской застройки. 5. Разработка и исследование системы обеспечения информационной безопасности.',
          results: '1.Количество студентов, принимающих участие в научной (научно-исследовательской) деятельности – 21 чел. 2.Количество из-данных и принятых к публикации статей в изданиях, рекомендованных ВАК/зарубежных для публикации научных работ за последний год — 8/3 3.Количество патентов, полученных на разработки за послед-ний год: российских -1. 4.Количество свидетельств о регистрации объекта интеллектуальной собственности, выданных на разработки за последний год: российских- 5.',
          basics: 'Лаборатория сетей связи и систем коммутации Лаборатория направляющих средств электросвязи Лаборатория систем радиосвязи и телевидения Лаборатория МТС'
        },
        {
          code: '09.03.01',
          direction: 'ИВТ',
          level: 'бакалавриат',
          list: '1. Диагностика и мониторинг стохастических динамических объектов, распознавание нелинейных динамических структур, сверхбыстродействующие системы обработки информации, управление стохастическими динамическими объектами. 2. Инерциально-спутниковая навигация, помехоустойчивое обнаружение и фильтрация сигналов.',
          results: '1.Количество студентов, принимающих участие в научной (научно-исследовательской) деятельности – 29 чел. 2.Количество из-данных и принятых к публикации статей в изданиях, рекомендованных ВАК/зарубежных для публикации научных работ за последний год — 16/7 3.Количество патентов, полученных на разработки за послед-ний год: российских -3. 4.Количество свидетельств о регистрации объекта интеллектуальной собственности, выданных на разработки за последний год: российских- 5.',
          basics: 'Лаборатория Вычислительной техники и информатики'
        }
      ]

      const directResultsKey = [
        {name: 'code', label: 'Код', field: 'code', align: 'left'},
        {name: 'direction', label: 'Наименование специальности, направления подготовки', field: 'direction', align: 'left'},
        {name: 'level', label: 'Уровень образования', field: 'level', align: 'left'},
        {name: 'list', label: 'Перечень научных направлений, в рамках которых ведется научная (научно-исследовательская) деятельность', field: 'list', align: 'left'},
        {name: 'results', label: 'Результаты научной (научно-исследовательской) деятельности', field: 'results', align: 'left'},
        {name: 'basics', label: 'Сведения о научно-исследовательской базе для осуществления научной (научно-исследовательской) деятельности', field: 'basics', align: 'left'},
      ]

      return {
        programsEducationKey,
        programsEducationRow,
        countLearnersKey,
        countLearnersRow,
        movmentStudentsKey,
        movmentStudentsRow,
        programmInfKey,
        programmInfRow,
        directResultsKey,
        directResultsRow
      }
    }
  }

</script>
