<template>
  <div class="row q-ma-xl">
    <div class="col-12">
      <span class="text-h3 text-grey-10">Основные сведения</span>
    </div>
    <div class="col-8 q-pr-xl">

      <p class="text-h6 q-my-md">В июне 1967 года <b>Приказом Министерства связи СССР от 03.06.1967 г.
          № 403 «О состоянии заочной подготовки инженерно-технических работников
          связи и мерах по ее улучшению»</b> был образован Ростовский учебно-консультационный
        пункт Всесоюзного заочного электротехнического института связи (ВЗЭИС).</p>
      <p class="text-h6 q-my-md">В июле 1974 года Приказом Министерства связи СССР от 15.07.1974 № 360 Ростовский
        учебно-консультационный пункт ВЗЭИС был преобразован в Северо-Кавказский филиал ВЗЭИС.
        В апреле 1988 года Приказом Министерства связи СССР от 01.04.1988 г. № 51 Филиал был передан Одесскому
        электротехническому университету связи им. А.С.Попова (ОЭИС).
      </p>
      <p class="text-h6 q-my-md">В связи с передачей с 01.01.1992 г. Московского института связи в ведение Минсвязи
        РСФСР, а Одесского электротехнического института связи им. А.С. Попова в подчинение Госкомитета по связи при
        Кабинете Министров Украины, приказом Министерства связи СССР от 27.11.1991 г. № 301, Северо-Кавказский филиал
        ОЭИС был переподчинен Московскому институту связи.</p>
      <p class="text-h6 q-my-md">Распоряжением Правительства Российской Федерации от 18.01.1992 г. № 99-р и приказом
        Министерства связи Российской Федерации от 24.01.1992 г. № 60 Московский институт связи преобразован в
        Московский технический университет связи и информатики (МТУСИ). Филиал приобрел наименование: Северо-Кавказский
        филиал федерального государственного образовательного бюджетного учреждения высшего профессионального
        образования Московского технического университета связи и информатики (СКФ МТУСИ).
      </p>
      <p class="text-h6 q-my-md">В связи с принятием Федерального закона от 29.12.2012 № 273-ФЗ «Об образовании в
        Российской Федерации», а также в соответствии с приказом ректора МТУСИ от 28.08.2015 №172-О, Северо-Кавказский
        филиал федерального государственного образовательного бюджетного учреждения высшего профессионального
        образования Московского технического университета связи и информатики переименован в Северо-Кавказский филиал
        ордена Трудового Красного Знамени федерального государственного бюджетного образовательного учреждения высшего
        образования «Московский технический университет связи и информатики» (СКФ МТУСИ).</p>

      <p class="text-h3 text-grey-10 q-my-xl">
        Режим и график работы
      </p>

      <p class="text-h6">Общий режим работы филиала:</p>
      <p>
        <span class="text-h6">С понедельника по пятницу: </span>с 8.00 до 22.00
      </p>
      <p>
        <span class="text-h6">Перерыв </span>с 13.00 до 14.00
      </p>

      <p class="text-h3 text-grey-10 q-my-xl">
       Единые часы работы с посетителями:
      </p>

      <p>
        <span class="text-h6">С понедельника по четверг:  </span>с 09.00 до 11.00 и с 16.00 до 18.00
      </p>
      <p>
        <span class="text-h6">В пятницу: </span>с 14.00 до 16.00 
        <span class="text-h6">Суббота:  </span>с 10.00 до 12.00
      </p>


    </div>
    <div class="col-4">
      <p class="text-h4 text-grey-10 q-mb-xl">Сведения об учредителе</p>
      <p class="text-h6 q-md-sm">Министерство цифрового развития, связи и массовых коммуникаций РФ.</p>
      <p class="text-h6">ФИО руководителя учредителя образовательной организации:</p>
      <p class="q-md-sm">Шадаев Максут Игоревич</p>
      <p class="text-h6">Юридический адрес учредителя:</p>
      <p class="q-md-sm">1123112, г. Москва, Пресненская наб., д.10, стр.2:</p>
      <p class="text-h6">Контактные телефоны:</p>
      <p class="q-md-sm">Справочная: +7 495 771-80-00,
8 800 222-15-01<br/>
Справки по документам: +7 495 771-81-00</p>
      <p class="text-h6">Контактные телефоны:</p>
      <p class="q-mb-xl">Справочная: +7 495 771-80-00, 8 800 222-15-01</p>

      <p class="text-h4 text-grey-10 q-my-xl">Контактная информация</p>

      <p class="text-h6">Адрес:</p>
      <p class="q-mb-sm">344002, г.Ростов-на-Дону, ул.Серафимовича, 62</p>
      <p class="text-h6">Телефон:</p>
      <p class="q-mb-sm">(863) 310-69-60</p>
      <p class="text-h6">Факс:</p>
      <p class="q-mb-sm">(863) 310-69-68</p>
      <p class="text-h6">Телекс::</p>
      <p class="q-mb-sm">123432 VOLT RU</p>
      <p class="text-h6">Приёмная комиссия:	</p>
      <p class="q-mb-sm">(863) 310-69-70</p>
      <p class="text-h6">E-mail:</p>
      <p class="q-mb-sm">mаil@skf-mtusi.ru</p>
      <p class="text-h6">Соц.сеть:</p>
      <p class="q-mb-sm">Официальный аккаунт СКФ МТУСИ в Instagram</p>
    </div>
    <div class="col-12"></div>
  </div>
</template>

<script>
  export default {
    name: 'Education',
    setup() {

    }
  }

</script>
