<template>
  <div class="row q-ma-xl">
    <div class="col-12">
      <span class="text-h5 text-grey-10">
        Преподавательский состав
      </span>
    </div>
    <div class="col-12 q-my-xl">
      <q-input
        standout
        filled
        label="Поиск преподавателей"
      >
        <template v-slot:prepend>
          <q-icon name="search"></q-icon>
        </template>
      </q-input>
    </div>
    <div class="col-12 q-mb-xl" v-for="(empl, i) in empls" :key="i">
        <span class="text-h3 text-grey-10">{{empl.direction.name}}</span>
      <div class="row q-my-xl">
        <div class="col-6" v-for="structure in empl.direction.structure" :key="structure.name">
          <q-card flat>
            <q-card-section horizontal>
              <q-card-section class="col-3">
                <q-avatar size="120px">
                  <q-img src="Zhukov.png"></q-img>
                </q-avatar>
              </q-card-section>
              <q-card-section>
                <div class="text-h6">{{structure.name}}</div>
                <div class="text-grey-8">{{structure.rank}}</div>
              </q-card-section>
            </q-card-section>
          </q-card>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Empl',
  setup() {
    return {
      empls: [
        {
          direction: 
            {
              name: 'Кафедра информатики и вычислительной техники', structure: [
                { name: 'Лобзенко Павел Владимирович', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Погорелов Вадим Алексеевич', rank: 'Извините, произошла ошибка или данные обновляются.', img: '' },
                { name: 'Соколов Сергей Викторович', rank: 'Заведующий кафедрой, профессор, доктор технич. наук', img: '' },
                { name: 'Ткачук Евгений Остапович', rank: 'Кандидат технических наук, ст. научный сотрудник, доцент', img: '' },
                { name: 'Чикалов Андрей Николаевич', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Швидченко Светлана Александровна', rank: 'Кандидат технических наук, доцент', img: '' }
              ]
            }
        },
        {
          direction: 
            {
              name: 'Кафедра инфокоммуникационных технологий и систем связи', structure: [
                { name: 'Болдырихин Николай Вячеславович', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Борисов Борис Петрович', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Боярчук Андрей Эдуардович', rank: 'Кандидат технических наук, профессор', img: '' },
                { name: 'Елисеев Александр Вячеславович', rank: 'Доктор, доцент', img: '' },
                { name: 'Енгибарян Ирина Алешаевна', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Ершов Валерий Васильевич', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Жуковский Александр Георгиевич', rank: 'Доктор политических наук, кандидат технических наук, доцент', img: '' },
                { name: 'Лабунько Олег Степанович', rank: 'Кандидат физико-математических наук, доцент', img: '' },
                { name: 'Манин Александр Анатольевич', rank: 'Директор, кандидат технических наук, доцент', img: '' },
                { name: 'Нерсесянц Альфред Аванесович', rank: 'Доктор технических наук, cтарший научный сотрудник', img: '' },
                { name: 'Панков Геннадий Климович', rank: 'Старший преподаватель', img: '' },
                { name: 'Решетникова Ирина Витальевна', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Рыбалко Игорь Петрович', rank: 'Кандидат технических наук, доцент', img: '' },
                { name: 'Сосновский Иван Александрович', rank: 'Декан факультета, доцент, кандидат технических наук', img: '' },
                { name: 'Юхнов Василий Иванович', rank: 'Заведующий кафедрой, кандидат технических наук, доцент', img: '' }
              ]
            }
        },
        {
          direction: 
            {
              name: 'Кафедра общенаучной подготовки', structure: [
                { name: 'Бинеев Энвер Абдулхакович', rank: 'Кандидат химических наук, профессор', img: '' },
                { name: 'Бородин Алексей Викторович', rank: 'Кандидат физико-математических наук, доцент', img: '' },
                { name: 'Боярчук Андрей Эдуардович', rank: 'Кандидат технических наук, профессор', img: '' },
                { name: 'Гаевская Любовь Александровна', rank: 'Старший преподаватель', img: '' },
                { name: 'Головина Ирина Витальевна', rank: 'Кандидат экономических наук, доцент', img: '' },
                { name: 'Докучаев Сергей Аркадьевич', rank: 'Старший преподаватель', img: '' },
                { name: 'Ефимов Сергей Викторович', rank: 'Кандидат физико-математических наук, доцент', img: '' },
                { name: 'Жуковский Денис Александрович', rank: 'Кандидат политических наук, доцент', img: '' },
                { name: 'Колдынская Лариса Михайловна', rank: 'Заведующий СУМР, ст. преподаватель', img: '' },
                { name: 'Конкин Борис Борисович', rank: 'Заведующий кафедрой, кандидат физико-математических наук, доцент', img: '' },
                { name: 'Константинова Яна Борисовна', rank: 'Кандидат физико-математических наук, доцент', img: '' },
                { name: 'Коршун Анна Михайловна', rank: 'Кандидат географических наук, доцент', img: '' },
                { name: 'Костецкая Галина Сергеевна', rank: 'Кандидат физико-математических наук, доцент', img: '' },
                { name: 'Светличная Наталия Олеговна', rank: 'Кандидат филологических наук, доцент', img: '' },
                { name: 'Устименко Дмитрий Леонидович', rank: 'Кандидат философских наук, доцент', img: '' }
              ]
            }
        },
        {
          direction:
            {
              name: 'Отдел научно-исследовательской работы', structure: [
                { name: 'Головской Василий Андреевич', rank: 'Кандидат технических наук, доцент, старший научный сотрудник', img: '' },
                { name: 'Мозоль Александр Анатольевич', rank: 'Кандидат технических наук, старший научный сотрудник', img: '' },
                { name: 'Рыбалко Игорь Петрович', rank: 'Кандидат технических наук, доцент ', img: '' }
              ]
            }
        }
      ]
    }
  }
}
</script>