<template>
  <q-page padding>
    <div class="row">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Стипендии</span>
      </div>
      <div class="col-12 q-my-xl">
        <span class="text-grey-10 text-h4">Виды стипендий</span>
      </div>
      <div class="col-12 text-subtitle1">
        а) академическую стипендию получают 120 студента,<br><br>
        б) социальную стипендию получают 14 студентов.
      </div>
      <div class="col-12 q-my-xl">
        <span class="text-grey-10 text-h4">Условия предоставления стипендий</span>
      </div>
      <div class="col-12 text-subtitle1">
        а) академическую стипендию получают студенты очной формы обучения факультета инфокоммуникаций бюджетной основы обучения, сдавшие плановую сессию в установленные сроки с оценками не ниже «хорошо», либо поступившие на 1 курс (в первом семестре),<br><br>
        б) социальную стипендию получают студенты очной формы обучения факультета инфокоммуникаций бюджетной основы обучения, предоставившие письменное заявление и документ, подтверждающий принадлежность хотя бы к одной из следующих категорий лиц:
      </div>
      <div class="col-12 q-mb-xl">
        <ul class="text-subtitle1">
          <li>дети-сироты и дети, оставшиеся без попечения родителей, лица из числа детей-сирот и детей, оставшихся без попечения родителей,</li>
          <li>лица, потерявшие в период обучения обоих родителей или единственного родителя,</li>
          <li>дети-инвалиды (до 18 лет), инвалиды I и II групп, инвалиды с детства,</li>
          <li>студенты, подвергшиеся воздействию радиации вследствие катастрофы на Чернобыльской АЭС и иных радиационных катастроф, вследствие ядерных испытаний на Семипалатинском полигоне,</li>
          <li>студенты, являющиеся инвалидами вследствие военной травмы или заболевания, полученных в период прохождения военной службы, и ветеранами боевых действий,</li>
          <li>студенты из числа граждан, проходивших в течение не менее трех лет военную службу по контракту на воинских должностях, подлежащих замещению солдатами, матросами, сержантами, старшинами, и уволенных с военной службы по основаниям, предусмотренным подпунктами «б» — «г» пункта 1, подпунктом «а» пункта 2 и подпунктами «а» — «в» пункта 3 статьи 51 Федерального закона от 28 марта 1998 года N 53-ФЗ «О воинской обязанности и военной службе»,</li>
          <li>студенты, получивше государственную социальную помощь (справка органа социальной защиты населения по месту постоянной регистрации).</li>
        </ul>
      </div>
      <div class="col-12 q-my-xl">
        <span class="text-grey-10 text-h4">Нормативные документы</span>
      </div>
      <div class="col-12 q-mt-md">
        <ul>
          <li
            v-for="(doc, i) in docs"
            :key="i"
            class="q-my-md text-primary"
          >{{doc.name}}</li>
        </ul>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: 'Documents',
  setup() {
    const docs = [
      { name: 'Постановление Правительства Российской Федерации от 17.12.2016 № 1390 «О формировании стипендиального фонда»', dId: '' },
      { name: 'Приказ Министерства образования и науки Российской Федерации от 27.12.2016 г. № 1663 «Об утверждении Порядка назначения государственной академической стипендии и (или) государственной социальной стипендии студентам, обучающимся по очной форме обучения за счет бюджетных ассигнований федерального бюджета, государственной стипендии аспирантам, ординаторам, ассистентам-стажерам, обучающимся по очной форме обучения за счет бюджетных ассигнований федерального бюджета, выплаты стипендий слушателям подготовительных отделений федеральных государственных образовательных организаций высшего образования, обучающимся за счет бюджетных ассигнований федерального бюджета»', dId: '' },
      { name: 'Положение о стипендиальной комиссии СКФ МТУСИ', dId: '' },
      { name: 'Приказ о размере государственных академических стипендий для студентов и государственных стипендий для аспирантов', dId: '' },
      { name: 'Информация о наличии общежития, интерната', dId: '' },
    ]

    return {
      docs
    }
  }
}
</script>