<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-h3 text-grey-10">Стипендии и меры поддержки обучающихся</span>
        <br>
        <span class="text-grey-10 text-h3">Наличие и условия предоставления стипендий</span>
      </div>
      <div class="col-12">
        <span class="text-grey-10 text-h4">Виды стипендий</span>
      </div>
      <div class="col-12 text-subtitle1">
        а) академическую стипендию получают 120 студента,<br><br>
        б) социальную стипендию получают 14 студентов.
      </div>
      <div class="col-12">
        <span class="text-grey-10 text-h4">Условия предоставления стипендий</span>
      </div>
      <div class="col-12 text-subtitle1">
        а) академическую стипендию получают студенты очной формы обучения факультета инфокоммуникаций бюджетной основы обучения, сдавшие плановую сессию в установленные сроки с оценками не ниже «хорошо», либо поступившие на 1 курс (в первом семестре),<br><br>
        б) социальную стипендию получают студенты очной формы обучения факультета инфокоммуникаций бюджетной основы обучения, предоставившие письменное заявление и документ, подтверждающий принадлежность хотя бы к одной из следующих категорий лиц:
      </div>
      <div class="col-12">
        <ul class="text-subtitle1">
          <li>дети-сироты и дети, оставшиеся без попечения родителей, лица из числа детей-сирот и детей, оставшихся без попечения родителей,</li>
          <li>лица, потерявшие в период обучения обоих родителей или единственного родителя,</li>
          <li>дети-инвалиды (до 18 лет), инвалиды I и II групп, инвалиды с детства,</li>
          <li>студенты, подвергшиеся воздействию радиации вследствие катастрофы на Чернобыльской АЭС и иных радиационных катастроф, вследствие ядерных испытаний на Семипалатинском полигоне,</li>
          <li>студенты, являющиеся инвалидами вследствие военной травмы или заболевания, полученных в период прохождения военной службы, и ветеранами боевых действий,</li>
          <li>студенты из числа граждан, проходивших в течение не менее трех лет военную службу по контракту на воинских должностях, подлежащих замещению солдатами, матросами, сержантами, старшинами, и уволенных с военной службы по основаниям, предусмотренным подпунктами «б» — «г» пункта 1, подпунктом «а» пункта 2 и подпунктами «а» — «в» пункта 3 статьи 51 Федерального закона от 28 марта 1998 года N 53-ФЗ «О воинской обязанности и военной службе»,</li>
          <li>студенты, получивше государственную социальную помощь (справка органа социальной защиты населения по месту постоянной регистрации).</li>
        </ul>
      </div>
      <div class="col-12">
        <span class="text-grey-10 text-h4">Нормативные документы</span>
      </div>
      <div class="col-12 row q-col-gutter-sm justify-center">
        <div class="col-12 col-md-7" v-for="doc in docs">
          <essential-link
            :title="doc.name"
            :link="doc.link"
            icon="mdi-pdf-box"
          ></essential-link>
        </div>
      </div>
      <div class="col-12">
        <span class="text-grey-10 text-h4">Информации о трудоустройстве выпускников Северо-Кавказского филиала ордена Трудового Красного Знамени ФГБОУ ВО «Московский технический университет связи и информатики» за последние 3 года</span>
      </div>
      <div class="col-12 row q-col-gutter-sm">
        <div class="col-12 col-md-6" v-for="stat in statistic">
          <q-card>
            <q-item>
              <q-item-section>
                <q-item-label>{{stat.direction}}</q-item-label>
                <q-item-label caption>{{stat.code}}</q-item-label>
              </q-item-section>
            </q-item>
            <q-item>
              <q-item-section>
                {{stat.year}}
              </q-item-section>
              <q-item-section>
                <q-item-label>
                  {{stat.graduate}}
                </q-item-label>
                <q-item-label caption>Выпущено</q-item-label>
              </q-item-section>
              <q-item-section>
                <q-item-label>
                  {{stat.employed}}
                </q-item-label>
                <q-item-label caption>Трудоустроено</q-item-label>
              </q-item-section>
            </q-item>
          </q-card>
        </div>
        <div class="col-12">
          <q-card>
            <q-card-section>
              Содействие трудоустройству студентов и выпускников в настоящее время является одним из направлений деятельности СКФ МТУСИ.
            </q-card-section>
            <q-card-section class="row q-col-gutter-sm justify-center">
              <div class="col-12 col-md-3">
                <q-img
                  src="http://www.skf-mtusi.ru/images/sved/st_pod/1.jpg"
                ></q-img>
              </div>
              <div class="col-12 col-md-3">
                <q-img
                  src="http://www.skf-mtusi.ru/images/sved/st_pod/2.jpg"
                ></q-img>
              </div>
            </q-card-section>
          </q-card>
        </div>
        <div class="col-12">
          <q-card>
            <q-card-section>
              Этим вопросом начали заниматься с 2007 года. Были поставлены основные задачи:
              <ul>
                <li>подбор вакантных мест для трудоустройства студентов в течение года и в летний период;</li>
                <li>подбор вакантных мест для выпускников филиала;</li>
                <li>ведение и постоянное обновление вакансий на сайте СКФ МТУСИ в разделе «Студенту» — «Работа»;</li>
                <li> консультационная работа со студентами и выпускниками по составлению резюме, технике эффективной самопрезентации, информирование о правилах построения карьеры, способах поиска работы.</li>
              </ul>

              <div class="row q-col-gutter-sm justify-center">
                <div class="col-12 col-md-3">
                  <q-img
                    src="http://www.skf-mtusi.ru/images/sved/st_pod/3.jpg"
                  ></q-img>
                </div>
                <div class="col-12 col-md-3">
                  <q-img
                    src="http://www.skf-mtusi.ru/images/sved/st_pod/4.jpg"
                  ></q-img>
                </div>
              </div>

              <p>Совместно с городским Центром занятости населения один раз в учебном году проводится Ярмарка вакансий, в которой принимают участие предприятия связи г. Ростова-на-Дону. Специалисты центра занятости разъясняют студентам и выпускникам их права и обязанности, как молодых специалистов.</p>
            </q-card-section>
          </q-card>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
import EssentialLink from "components/EssentialLink";
export default {
  name: 'Documents',
  components: {
    EssentialLink
  },
  setup() {
    const docs = [
      { name: 'Постановление Правительства Российской Федерации от 17.12.2016 № 1390 «О формировании стипендиального фонда»', link: 'http://www.skf-mtusi.ru/files/info/stip/0001201612210031.pdf' },
      { name: 'Приказ Министерства образования и науки Российской Федерации от 27.12.2016 г. № 1663 «Об утверждении Порядка назначения государственной академической стипендии и (или) государственной социальной стипендии студентам, обучающимся по очной форме обучения за счет бюджетных ассигнований федерального бюджета, государственной стипендии аспирантам, ординаторам, ассистентам-стажерам, обучающимся по очной форме обучения за счет бюджетных ассигнований федерального бюджета, выплаты стипендий слушателям подготовительных отделений федеральных государственных образовательных организаций высшего образования, обучающимся за счет бюджетных ассигнований федерального бюджета»', link: 'http://www.skf-mtusi.ru/files/info/stip/45376.pdf' },
      { name: 'Положение о стипендиальной комиссии СКФ МТУСИ', link: 'http://www.skf-mtusi.ru/files/info/stip/stip_kom_skf-mtusi_19.pdf' },
      { name: 'Приказ о размере государственных академических стипендий для студентов и государственных стипендий для аспирантов', link: 'http://www.skf-mtusi.ru/files/info/stip/703-c_stip_stud-asp.pdf' },
      { name: 'Информация о наличии общежития, интерната', link: 'http://www.skf-mtusi.ru/files/info/stip/internat.pdf' },
    ]

    const statistic = [
      {
        code: '09.03.01',
        direction: 'Информатика и вычислительная техника',
        year: '2018/2019',
        graduate: '14',
        employed: '11'
      },
      {
        code: '09.03.01',
        direction: 'Информатика и вычислительная техника',
        year: '2019/2020',
        graduate: '21',
        employed: '17'
      },
      {
        code: '09.03.01',
        direction: 'Информатика и вычислительная техника',
        year: '2020/2021',
        graduate: '19',
        employed: '14'
      },
      {
        code: '11.03.02',
        direction: 'Инфокоммуникационные технологии и системы связи',
        year: '2018/2019',
        graduate: '13',
        employed: '11'
      },
      {
        code: '11.03.02',
        direction: 'Инфокоммуникационные технологии и системы связи',
        year: '2019/2020',
        graduate: '21',
        employed: '16'
      },
      {
        code: '11.03.02',
        direction: 'Инфокоммуникационные технологии и системы связи',
        year: '2020/2021',
        graduate: '17',
        employed: '13'
      }
    ]

    return {
      docs,
      statistic
    }
  }
}
</script>
