<template>
  <q-page padding>
    <div class="row">
      <div class="col-12 q-my-xl">
        <span class="text-h3 text-grey-10">Работа</span>
      </div>
      <div class="col-12">
        <div class="row">
          <div class="col-md-8 col-12 text-subtitle1 q-pr-xl">
            <span>Несмотря на распространённое мнение, что высшее образование не является показателем каких-либо способностей и навыков, с каждым годом дипломы получают все больше студентов. Совершенно не стоит отрицать, что академические знания вносят лепту в развитие будущего специалиста и этот фактор положительно влияет на решение поступить в университет. Основная причина, по которой выпускникам трудно найти работу, — это явная конкуренция. Каждый год по определенным специальности поступает невероятное количество выпускников. И, безусловно, им придётся приложить усилия, чтобы начать свой профессиональный путь.</span>
            <br><br>
            <span>Почему важна первая работа?<br><br>
            Первая работа выпускника после университета часто оказывает значительное влияние на его дальнейшую карьеру. Например, выпускники, получившие должность, которая мало связана с их областью обучения (или вообще не требует степени), с большей вероятностью останутся либо на этой, либо на связанной должности в течение следующих пяти лет. Людям трудно отклониться от однажды избранного пути, что снижает их шансы получить работу в своей области.</span>
          </div>
          <div class="col-md-4 col-12">
            <q-img
              src="/images/stdworks1.svg"
            ></q-img>
          </div>
        </div>
      </div>
      <div class="col-12 q-my-xl">
        <span class="text-h3 text-grey-10">Советы по поиску работы</span>
      </div>
      <div class="col-12">
        <div class="row">
          <div class="col-md-4 col-12 q-pa-md" v-for="a in advice" :key="a.title">
            <q-card class="text-center shadow-10">
              <q-card-section>
                <q-img :src="a.icon" width="70px"></q-img>
              </q-card-section>
              <q-card-section>
                <span class="text-h5">{{a.title}}</span>
              </q-card-section>
              <q-card-section>
                <span class="text-h6" v-html="a.description"></span>
              </q-card-section>
            </q-card>
          </div>
        </div>
      </div>
      <div class="col-12 q-my-xl">
        <span class="text-h3 text-grey-10">Сайты для поиска работы</span>
      </div>
      <div class="col-12">
        <div class="row">
          <div class="col-md-6 col-12">
            <div class="row">
              <div class="col-2"><span class="text-h4 text-primary">01.</span></div>
              <div class="col-10"><span class="text-h4">Neuvoo</span></div>
              <div class="col-10 offset-2">
                <span class="text-h5 text-primary">https://neuvoo.ru/</span><br>
                <span class="text-subtitle1">В помощь студентам и выпускникам! Сайт для поиска работы</span>
              </div>
            </div>
          </div>
          <div class="col-md-6 col-12">
            <div class="row">
              <div class="col-2"><span class="text-h4 text-primary">02.</span></div>
              <div class="col-10"><span class="text-h4">Jobsora</span></div>
              <div class="col-10 offset-2">
                <span class="text-h5 text-primary">https://ru.jobsora.com/</span><br>
                <span class="text-subtitle1">Jobsora.com — сайт, главной и единственной задачей которого является помощь в поиске хорошей работы. На Jobsora Вы найдете актуальные вакансии по всей стране.</span>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div class="col-12 q-my-xl">
        <span class="text-h3 text-grey-10">Вакансии</span>
      </div>
      <div class="col-12">
        <div class="row">
          <div class="col-md-6 col-12 q-mb-xl" v-for="v in vacancy" :key="v.id">
            <div class="row q-pa-sm">
              <div class="col-2"><span class="text-h4 text-primary">{{v.id}}</span></div>
              <div class="col-10"><span class="text-h4">{{v.title}}</span></div>
              <div class="col-10 offset-2 q-my-md">
                <span class="text-h5">{{v.subtitle}}</span><br>
                <span class="text-subtitle1">{{v.company}}</span>
              </div>
              <div class="col-10 offset-2 q-my-sm" v-for="d in v.description" :key="d.title">
                <span class="text-h5">— {{d.title}}</span>
                <ul>
                  <li v-for="(u, i) in d.description" :key="i">{{u}}</li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  setup() {
    const advice = [
      { icon: '/icons/group-people.svg', title: 'Нетворкинг', description: 'Один из важнейших компонентов <br/> успешного поиска работы' },
      { icon: '/icons/screen-search.svg', title: 'Вакансии', description: 'Постоянно изучайте <br/> вакансии на рынке' },
      { icon: '/icons/user.svg', title: 'Личный профиль', description: 'Создайте личный профиль <br/> на сайтах по поиску работы' },
      { icon: '/icons/person-workspace.svg', title: 'Стажировка', description: 'Подайте заявку <br/> на стажировку' },
      { icon: '/icons/briefcase-eye.svg', title: 'Резюме', description: 'Не забывайте <br/> совершенствовать резюме' },
      { icon: '/icons/top.svg', title: 'Стремление', description: 'Никогда не сдавайтесь <br/> и идите до конца' },
    ]

    const vacancy = [
      { id: '01.', title: 'Junior-программист 1С', subtitle: 'от 20 000 до 35 000 руб. до вычета налогов', company: 'ООО Метод, Ростов-на-Дону, проспект Сельмаш, 90А', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['разработка отчетов, обработок, внесение изменений в конфигурации на платформе 1С;', 'поиск и устранение ошибок пользователей;', 'работа с типовыми и нетиповыми конфигурациями.'] },
        { title: 'Ожидания от кандидата:', description: ['профильное высшее или среднее техническое образование;', 'знание основ программирования на платформе 1с v8.'] },
        { title: 'Мы предлагаем:', description: ['официальное трудоустройство согласно ТК РФ;', ' график работы 5/2 с 8:00 до 17:00, в пятницу — до 16:00;', '«белая» заработная плата, которая не зависит от оплат клиентов, + квартальные и годовые премии;', ' офис на Сельмаше: удобная транспортная развязка, всё необходимое в шаговой доступности;', 'работа под наставничеством сертифицированного специалиста, заинтересованного в вашем развитии;', 'приятная атмосфера, хороший коллектив'] },
        { title: 'Перспективы:', description: ['Наша компания быстро растет, и, соответственно, растет профессионализм наших сотрудников. Поэтому у нас есть карьерный рост: горизонтальный и вертикальный. 1. Горизонтальный рост — профессионально, проходя сертификацию 1С (Профессионал — Специалист — Руководитель проектов — Эксперт по технологическим вопросам). Мы покупаем книги, курсы, оплачиваем сертификацию. 2. Вертикальный рост — по должностям (Программист — Ведущий программист — Аналитик — Руководитель отдела — Заместитель директора). Не верь на слово — убедись сам.'] },
        { title: 'Контактная информация:', description: ['Донскова Татьяна', ' +7 (951) 8445126', '+7 (863) 3100525', ' hr@metod-rnd.ru', ' Ростов-на-Дону, проспект Сельмаш, 90А'] }
      ] },
      { id: '02.', title: 'Инженер эксплуатации радиоподсистемы', subtitle: 'Заработная плата от 42 000 рублей', company: 'ПАО «МТС», Ростов-на-Дону, Лермонтовская улица, 177Б', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['Участвовать в мероприятиях по контролю устранения недостатков, допущенных при строительстве и модернизации объектов радиоподсистемы;', 'Организовывать выполнение строительно-монтажных работ при модернизации АМС;', 'Проводить работы по техническому обслуживанию объектов сети радиодоступа (включая верхолазные работы);', 'Выполнять плановое ТО и ремонт оборудовании сети;', 'Оформлять и своевременно представлять отчетные документы.'] },
        { title: 'Ожидания от кандидата:', description: ['Соискатель с высшим техническим образованием;', 'С опытом работы в сфере телекоммуникаций (будет преимуществом);', 'С опытом работы в сфере телекоммуникаций (будет преимуществом);'] },
        { title: 'Мы предлагаем:', description: ['Трудоустройство в соответствии с ТК РФ в штат компании;', 'Стабильная, белая заработная плата два раза в месяц + бонусы;', 'График работы 5/2 (с 8.30 до 17.30);', 'Корпоративная сотовая связь и автомобиль;', 'Расширенный социальный пакет (ДМС со стоматологией, страхование жизни, страхование при поездках за рубеж);', 'Доступное обучение в одном из лучших в стране корпоративных университетов;', 'Возможность реализации инициатив и даже собственной бизнес-идеи (идеи по автоматизации внутренних процессов можно реализовать в программе iDA, а перспективные бизнес-идеи сотрудников МТС развивает акселератор Гараж);', 'Работа и развитие в экспертных командах профессионалов, которые готовы делиться опытом и обмениваться идеями;', 'Волонтерское движение, поддержку хобби и интересов сотрудников, корпоративные конкурсы с возможностью проявить себя.'] },
        { title: 'Контактная информация:', description: ['Максим 89185585999', 'Олеся 89185358705'] }
      ] },
      { id: '03.', title: 'Инженер-монтажник', subtitle: 'от 41 000 руб. до вычета налогов', company: 'ПАО «МТС», Ростов-на-Дону', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, сменный график'] },
        { title: 'Задачи:', description: ['Работа на входящих звонках:', 'Консультирование и оперативное решение вопросов абонентов;', 'Работа на входящих звонках: • Консультирование и оперативное решение вопросов абонентов; • Продвижение дополнительных услуг компании.'] },
        { title: 'Ожидания от кандидата:', description: ['Высшее или неоконченное высшее, среднее специальное образование', 'Уверенный пользователь ПК (MS office, Internet, Outlook);', 'Четкая, грамотная речь;', 'Способность работать с большим объемом информации;', 'Ориентация на результат.'] },
        { title: 'Мы предлагаем:', description: ['Оформление по ТК РФ;', 'Оплачиваемое обучение;', 'Окладная часть 21 000 + премия по результатам работы, совокупный доход от 29 000', 'Компенсация мобильной связи; ДМС, частичная компенсация абонемента на фитнес;', 'Возможность профессионального и карьерного роста.'] },
        { title: 'Контактная информация:', description: ['270-40-15', ' 89281835801 – Наталья ,специалист по подбору персонала', ' Наш инстаграмм: @megafonhrrostov'] }

      ] },
      { id: '04.', title: 'Инженер-монтажник', subtitle: 'От 30 000 рублей', company: 'ПАО «МТС», Ростов-на-Дону', description: [
        { title: 'Требуемый опыт работы: 1 год', description: ['Сменный режим работы. 2/2'] },
        { title: 'Задачи:', description: ['Подключение абонентов', 'Консультирование клиентов', ' Продажа услуг фиксированной связи', 'Проведение монтажа и демонтажа абонентского оборудования'] },
        { title: 'Ожидания от кандидата:', description: ['Высшее техническое или среднее специальное образование', ' стаж работы не менее 1 года', 'Коммуникабельность', 'Клиентоориентированность', 'Нацеленность на результат'] },
        { title: 'Контактная информация:', description: ['Дитц Наталья', ' +79185813855', ' Адрес компании', 'г. Ростов-на-Дону, Лермонтовская 177 Б'] }
      ] },
      { id: '05.', title: 'Инженер-монтажник', subtitle: '40 т.р. + премия.', company: 'ООО «Донсвязьстрой», Ростов-на-Дону', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['Выполнение эксплуатационно-технического обслуживания сетей связи;', 'Устранение неисправностей и модернизации сети', 'Выполнение работ по подключению абонентов к услугам телевидения, интернет, телефонии, IP;', 'Поиск и локализация неисправностей у действующих абонентов'] },
        { title: 'Ожидания от кандидата:', description: [' коммуникабельность, обучаемость', 'водительское удостоверение категории «В»'] },
        { title: 'Мы предлагаем:', description: ['Трудоустройство в соответствии с ТК РФ в штат федеральной компании;', 'Стабильная белая заработная плата два раза в месяц: фиксированный оклад + премия; • Возможность работать в удобном для Вас районе города;', ' Рабочий график: понедельник-пятница, с 9-00 до 18-00'] },
        { title: 'Контактная информация:', description: ['Максим Кервалидзе', ' Менеджер по управлению проектами ООО «Донсвязьстрой»', 'тел. (863) 308-00-88', ' моб. +7(938)-111-22-37', 'e-mail: m.kervalidze@dss-rnd.ru'] }
      ] },
      { id: '06.', title: 'Инженер по эксплуатации сетей связи', subtitle: '35т.р. на испытательный срок (2 месяца), после 40т.р.', company: 'ООО «Донсвязьстрой», Ростов-на-Дону', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['Настройка телекоммуникационного оборудования и каналов связи, удаленная диагностика оборудования по сервисным заявкам', 'Планово-профилактические работы на технологической сети;', ' Выявление и устранение неисправностей на действующей сети'] },
        { title: 'Ожидания от кандидата:', description: ['знание основ построения сетей; - знания по настройке сетевого оборудования и IT-технологий;', 'грамотная речь;', 'коммуникабельность, обучаемость.'] },
        { title: 'Мы предлагаем:', description: ['Трудоустройство в соответствии с ТК РФ в штат федеральной компании;', ' Стабильная белая заработная плата два раза в месяц: фиксированный оклад + премия;', 'Возможность работать в удобном для Вас районе города;', ' Рабочий график: понедельник-пятница, с 9-00 до 18-00'] },
        { title: 'Контактная информация:', description: ['Максим Кервалидзе', ' Менеджер по управлению проектами ООО «Донсвязьстрой»', ' тел. (863) 308-00-88', ' моб. +7(938)-111-22-37', ' e-mail: m.kervalidze@dss-rnd.ru'] }
      ] },
      { id: '07.', title: 'Специалист по поддержке в Контактном центре:', subtitle: 'Окладная часть 21 000 + премия', company: '«Мегафон»', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['Настройка телекоммуникационного оборудования и каналов связи, удаленная диагностика оборудования по сервисным заявкам', 'Планово-профилактические работы на технологической сети;', ' Выявление и устранение неисправностей на действующей сети'] },
        { title: 'Ожидания от кандидата:', description: ['знание основ построения сетей; - знания по настройке сетевого оборудования и IT-технологий;', 'грамотная речь;', 'коммуникабельность, обучаемость.'] },
        { title: 'Мы предлагаем:', description: ['Трудоустройство в соответствии с ТК РФ в штат федеральной компании;', ' Стабильная белая заработная плата два раза в месяц: фиксированный оклад + премия;', 'Возможность работать в удобном для Вас районе города;', ' Рабочий график: понедельник-пятница, с 9-00 до 18-00'] },
        { title: 'Контактная информация:', description: ['Максим Кервалидзе', ' Менеджер по управлению проектами ООО «Донсвязьстрой»', ' тел. (863) 308-00-88', ' моб. +7(938)-111-22-37', ' e-mail: m.kervalidze@dss-rnd.ru'] }
      ] },
      { id: '08.', title: 'Специалист по продажам в Федеральном телемаркетинге', subtitle: 'Окладная часть 16 000 + премия', company: '«Мегафон»', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['Настройка телекоммуникационного оборудования и каналов связи, удаленная диагностика оборудования по сервисным заявкам', 'Планово-профилактические работы на технологической сети;', ' Выявление и устранение неисправностей на действующей сети'] },
        { title: 'Ожидания от кандидата:', description: ['знание основ построения сетей; - знания по настройке сетевого оборудования и IT-технологий;', 'грамотная речь;', 'коммуникабельность, обучаемость.'] },
        { title: 'Мы предлагаем:', description: ['Трудоустройство в соответствии с ТК РФ в штат федеральной компании;', ' Стабильная белая заработная плата два раза в месяц: фиксированный оклад + премия;', 'Возможность работать в удобном для Вас районе города;', ' Рабочий график: понедельник-пятница, с 9-00 до 18-00'] },
        { title: 'Контактная информация:', description: ['Максим Кервалидзе', ' Менеджер по управлению проектами ООО «Донсвязьстрой»', ' тел. (863) 308-00-88', ' моб. +7(938)-111-22-37', ' e-mail: m.kervalidze@dss-rnd.ru'] }
      ] },
      { id: '09.', title: 'Почтальон', subtitle: 'Заработная плата 17 810 руб + премия', company: 'АО «Почта России»', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['Настройка телекоммуникационного оборудования и каналов связи, удаленная диагностика оборудования по сервисным заявкам', 'Планово-профилактические работы на технологической сети;', ' Выявление и устранение неисправностей на действующей сети'] },
        { title: 'Ожидания от кандидата:', description: ['знание основ построения сетей; - знания по настройке сетевого оборудования и IT-технологий;', 'грамотная речь;', 'коммуникабельность, обучаемость.'] },
        { title: 'Мы предлагаем:', description: ['Трудоустройство в соответствии с ТК РФ в штат федеральной компании;', ' Стабильная белая заработная плата два раза в месяц: фиксированный оклад + премия;', 'Возможность работать в удобном для Вас районе города;', ' Рабочий график: понедельник-пятница, с 9-00 до 18-00'] },
        { title: 'Контактная информация:', description: ['Максим Кервалидзе', ' Менеджер по управлению проектами ООО «Донсвязьстрой»', ' тел. (863) 308-00-88', ' моб. +7(938)-111-22-37', ' e-mail: m.kervalidze@dss-rnd.ru'] }
      ] },
      { id: '10.', title: 'Инсталлятор', subtitle: 'Совокупный доход 40-50 тыс.руб.', company: 'ПАО «Ростелеком»', description: [
        { title: 'Требуемый опыт работы: не требуется', description: ['Полная занятость, полный день'] },
        { title: 'Задачи:', description: ['Настройка телекоммуникационного оборудования и каналов связи, удаленная диагностика оборудования по сервисным заявкам', 'Планово-профилактические работы на технологической сети;', ' Выявление и устранение неисправностей на действующей сети'] },
        { title: 'Ожидания от кандидата:', description: ['знание основ построения сетей; - знания по настройке сетевого оборудования и IT-технологий;', 'грамотная речь;', 'коммуникабельность, обучаемость.'] },
        { title: 'Мы предлагаем:', description: ['Трудоустройство в соответствии с ТК РФ в штат федеральной компании;', ' Стабильная белая заработная плата два раза в месяц: фиксированный оклад + премия;', 'Возможность работать в удобном для Вас районе города;', ' Рабочий график: понедельник-пятница, с 9-00 до 18-00'] },
        { title: 'Контактная информация:', description: ['Максим Кервалидзе', ' Менеджер по управлению проектами ООО «Донсвязьстрой»', ' тел. (863) 308-00-88', ' моб. +7(938)-111-22-37', ' e-mail: m.kervalidze@dss-rnd.ru'] }
      ] }
    ]

    return {
      advice,
      vacancy
    }
  },
}
</script>
