<template>
  <q-page padding>
    <div class="row q-col-gutter">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Материально-техническое обеспечение и оснащенность <br> образовательного процесса</span>
      </div>
      <div class="col-12 q-my-xl">
        <q-table
          title="Места осуществления образовательной деятельности, в том числе не указываемые в приложении к лицензии на осуществление образовательной деятельности"
          :columns="[
          {
            name: 'item',
            label: '№',
            field: 'item',
            align: 'center'
          },
          {
            name: 'address',
            label: 'Адрес места осуществления образовательной деятельности',
            field: 'address',
            align: 'center'
          }
        ]"
          :rows="[
            {
              item: 1,
              address: '344002, Ростовская область, г.Ростов-на-Дону, ул.Серафимовича, 62.'
            }
        ]"
          row-key="name"
        />
      </div>
      <div class="col-12">
        <q-table
          title="Сведения о наличии оборудованных учебных кабинетов"
          :rows="edEquipRow"
          :columns="edEquipKey"
          row-key="name"
          wrap-cells
        >
          <template v-slot:body="props">
            <q-tr :props="props">
              <q-td key="name" :props="props">
                {{props.row.name}}
              </q-td>
              <q-td key="address" :props="props">
                {{props.row.address}}
              </q-td>
              <q-td key="cabinet" :props="props">
                {{props.row.cabinet}}
              </q-td>
              <q-td key="equipment" :props="props">
                <ul>
                  <li v-for="e in props.row.equipment" :key="e">{{e}}</li>
                </ul>
              </q-td>
            </q-tr>
          </template>
        </q-table>
      </div>
      <div class="col-12 q-my-xl">
        <q-table
          title="Сведения о наличии объектов для проведения практических занятий."
          :rows="objEquipRow"
          :columns="objEquipKey"
          row-key="name"
          wrap-cells
          :pagination="{
            rowsPerPage: 0
          }"
        >
          <template v-slot:body="props">
            <q-tr :props="props">
              <q-td key="name" :props="props">
                {{props.row.name}}
              </q-td>
              <q-td key="adress" :props="props">
                {{props.row.adress}}
              </q-td>
              <q-td key="objects" :props="props">
                {{props.row.objects}}
              </q-td>
              <q-td key="equipment" :props="props">
                <ul>
                  <li v-for="e in props.row.equipment" :key="e">{{e}}</li>
                </ul>
              </q-td>
            </q-tr>
          </template>
        </q-table>
      </div>
      <div class="col-12">
        <q-table
          title="Сведения о наличии у образовательной организации на праве собственности или ином законном основании зданий, строений, сооружений, территорий, необходимых для осуществления образовательной деятельности"
          :columns="[
          {
            name: 'item',
            label: '№',
            field: 'item',
            align: 'center'
          },
          {
            name: 'objName',
            label: 'Наименование объекта',
            field: 'objName',
            align: 'center'
          },
          {
            name: 'address',
            label: 'Адрес объекта',
            field: 'address',
            align: 'center'
          },
          {
            name: 'objDo',
            label: 'Назначение объекта',
            field: 'objDo',
            align: 'center'
          },
          {
            name: 'objS',
            label: 'Площадь, м2',
            field: 'objS',
            align: 'center'
          }
        ]"
          :rows="[
            {
              item: 1,
              objName: 'Учебный корпус',
              address: 'г. Ростов-на-Дону, ул Серафимовича, 62',
              objDo: 'Осуществление образовательной деятельности',
              objS: '3661,5'
            }
        ]"
          row-key="name"
        />
      </div>
      <div class="col-12 q-mt-sm">
        <q-table
          :rows="specDirectionRow"
          :columns="specDirectionKey"
        >
          <template v-slot:body="props">
            <q-tr :props="props">
              <q-td key="item" :props="props">
                {{props.row.item}}
              </q-td>
              <q-td key="name" :props="props">
                {{props.row.name}}
              </q-td>
              <q-td key="direction" :props="props">
                <q-btn
                  tag="a"
                  :href="props.row.direction.link"
                  flat
                  color="primary"
                >{{props.row.direction.label}}</q-btn>
              </q-td>
            </q-tr>
          </template>
        </q-table>
      </div>
      <div class="col-12 q-mt-sm">
        <q-table
          title="Сведения о наличии библиотек, объектов питания и охраны здоровья обучающихся"
          :rows="mtoRows"
          :columns="mtoColumns"
          :pagination="{
            rowsPerPage: 0
          }"
        ></q-table>
      </div>
      <div class="col-12 q-mt-md">
        <span class="text-grey-10 text-h4">Сведения о наличии средств обучения и воспитания</span>
      </div>
      <div class="col-12 q-mt-md">
        <q-card>
          <q-card-section class="text-subtitle1">
            В качестве средств воспитания студентов организована работа секций: Хореографическая студия, Вокальная студия, Театральный кружок. Занятия по каждой секции проводятся два раза в неделю по соответствующему расписанию.
            <br>
            В Филиале существует отряд волонтеров, которые принимают участие в различных акция, проводимых администрацией города, района и комитета по молодежной политике. Сформирован студенческий актив ВУЗа, активно принимающий участие в различных мероприятиях: патриотические мероприятия по возложению цветов 14 февраля в день освобождения Ростова, 23 февраля в день Защитника Отечества, мероприятия, посвященные Дню Победы.
            <br>
            Проводится индивидуальная и разъяснительная работа со студентами нуждающимися в психологической помощи, студентами, имеющим академические задолженности. Во внеучебное время организуются экскурсионные поездки по Ростовской области.
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 q-mt-md">
        <span class="text-grey-10 text-h4">Сведения об условиях питания и охраны здоровья обучающихся</span>
      </div>
      <div class="col-12 q-mt-md">
        <q-card>
          <q-card-section class="text-subtitle1">
            Для питания студентов имеется в наличии буфет на 32 посадочных места с широким ассортиментом вторых блюд, напитков и кондитерских изделий.
            Для охраны здоровья коллектива, студенты и преподаватели ежегодно проходят медицинские осмотры в прикрепленных медучреждениях согласно графику.
            В качестве мер по сохранению здоровья, студенты оснащены достаточным числом аудиторий с удобной мебелью и хорошим освещением. Четко соблюдаются перемены между занятиями. Проводятся профилактические беседы о вреде курения, наркомании и употребления алкоголя.
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 q-mt-md">
        <span class="text-grey-10 text-h4">Сведения о доступе к информационным системам и информационно-телекоммуникационным сетям</span>
      </div>
      <div class="col-12 q-mt-md">
        <q-card>
          <q-card-section class="text-subtitle1">
            Материально-техническая база СКФ МТУСИ располагает 432 ед. учебно-лабораторной техники, в том числе 289 ед. компьютерной техники, 143 ед. контрольно измерительной техники и 38 ед. техники связи. В СКФ МТУСИ действуют две ЛВС: административная и учебная. Количество персональных компьютеров в сети — 282, количество серверов — 7. Филиал имеет подключение к сети Интернет на общей скорости 30 Мб/c. Студенты филиала имеют доступ к методическим материалам на сайте филиала, а также к необходимой литературе через электронно-библиотечные системы.
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 q-mt-md">
        <q-table
          title="Размещение информации о наличии электронных образовательных и информационных ресурсов"
          :columns="[
            { name: 'name', field: 'name', label: 'Наименование', align: 'center' },
            { name: 'count', field: 'count', label: 'Количество', align: 'center' }
          ]"
          :rows="[
            {
              name: 'Наличие собственных электронных образовательных и информационных ресурсов',
              count: '1'
            },
            {
              name: 'Наличие сторонних электронных образовательных и информационных ресурсов',
              count: '1'
            },
            {
              name: 'Наличие базы данных электронного каталога',
              count: '1'
            }
          ]"
        ></q-table>
      </div>
      <div class="col-12 q-mt-md">
        <span class="text-grey-10 text-h4">ССЫЛКИ НА ПЕРЕЧЕНЬ ЭЛЕКТРОННЫХ РЕСУРСОВ, К КОТОРЫМ ОБЕСПЕЧИВАЕТСЯ ДОСТУП ОБУЧАЮЩИХСЯ:</span>
      </div>
      <div class="col-12 q-mt-md">
        <div class="row q-col-gutter-sm">
          <div class="col-12 col-md-6" v-for="resource in webResources">
            <essential-link
              :title="resource.label"
              :link="resource.link"
              icon="mdi-share-variant"
              iconColor="primary"
              caption="Переход на внешний Веб-ресурс"
            ></essential-link>
          </div>
        </div>
      </div>
      <div class="col-12 q-mt-md">
        <span class="text-grey-10 text-h4">СВЕДЕНИЯ ОБ ЭЛЕКТРОННЫХ ОБРАЗОВАТЕЛЬНЫХ РЕСУРСАХ, В ТОМ ЧИСЛЕ ПРИСПОСОБЛЕННЫХ ДЛЯ ИСПОЛЬЗОВАНИЯ ИНВАЛИДАМИ И ЛИЦАМИ С ОГРАНИЧЕННЫМИ ВОЗМОЖНОСТЯМИ ЗДОРОВЬЯ</span>
      </div>
      <div class="col-12 q-mt-md">
        <div class="row q-col-gutter-sm">
          <div class="col-md-6 col-12">
            <essential-link
              title="ЭБС «IPRbooks» режим доступа"
              link="www.iprbookshop.ru"
              icon="mdi-share-variant"
              iconColor="primary"
              caption="Имеет обязательную для ЭБС версию сайта для слабовидящих общества слепых, полученное по результатам исследования специалистами отдела информационных технологий НУ ИПРПП"
            ></essential-link>
          </div>
          <div class="col-md-6 col-12">
            <essential-link
              title="ЭБС « Знаниум.ком» режим доступа"
              link="znanium.com"
              icon="mdi-share-variant"
              iconColor="primary"
              caption="Имеет обязательную для ЭБС версию сайта для слабовидящих."
            ></essential-link>
          </div>
          <div class="col-md-6 col-12">
            <essential-link
              title="СКФ МТУСИ Учебно-методические материалы"
              link="http://www.skf-mtusi.ru/?page_id=659"
              icon="mdi-share-variant"
              iconColor="primary"
              caption="Имеет обязательную для ЭБС версию сайта для слабовидящих."
            ></essential-link>
          </div>
          <div class="col-md-6 col-12">
            <essential-link
              title="СКФ МТУСИ Электронное портфолио студента"
              link="http://www.skf-mtusi.ru/sveden/(http://www.skf-mtusi.ru/?page_id=3773"
              icon="mdi-share-variant"
              iconColor="primary"
              caption="Имеет обязательную для ЭБС версию сайта для слабовидящих."
            ></essential-link>
          </div>
        </div>
        <q-card class="q-mt-md">
          <q-card-section>
            <span class="text-h5">Лингафонный кабинет ( ауд.101 «А» )</span>
            <p class="text-subtitle1">
              Оборудованный комплексом звукотехнической, проекционной аппаратуры Cortex LinguaMatic, позволяющей аудиовизуальным методом создавать оптимальные условия для работы учащихся , в т.ч. для инвалидов и лиц с ограниченными возможностями здоровья.
            </p>
            <ul>
              <li>автоматизированное место преподавателя,</li>
              <li>16 оборудованных рабочих мест студентов.</li>
            </ul>
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 q-mt-md">
        <span class="text-grey-10 text-h4">Информация о наличии материально-технических условий,
обеспечивающих возможность беспрепятственного доступа поступающих с ограниченными возможностями здоровья и (или) инвалидов в аудитории, туалетные и другие помещения, а также их пребывания в Филиале</span>
      </div>
      <div class="col-12 q-mt-md">
        <q-card>
          <q-card-section>
            <p class="text-subtitle1">В соответствии с Приказом Министерства образования и науки России №1309 от 09.11.2015 г. к 01.09.2016 г.</p>
            <p>В Филиале установлены:</p>
            <ul>
              <li>подъемники 2 шт.,</li>
              <li>противоскользящие полоски на ступени,</li>
              <li>специальные знаки-указатели для лиц с ОВЗ,</li>
              <li>вывеска-наименование Филиала шрифтом Брайля перед входом.</li>
            </ul>
            <p>Проведены работы по расширению дверных проемов и оборудованию туалетных помещений для лиц с ОВЗ (2 шт.).</p>
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 q-mt-md">
        <div class="q-gutter-sm">
          <ul>
            <li><q-btn to="/sveden/objects/eduCabinets" flat color="primary" tag="a" icon="mdi-share-variant" label="Учебные кабинеты"></q-btn></li>
            <li><q-btn to="/sveden/objects/labMainPhysicBZD" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Общей физики и БЖД"></q-btn></li>
            <li><q-btn to="/sveden/objects/labIVT" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Вычислительной техники и информатики"></q-btn></li>
            <li><q-btn to="/sveden/objects/labOTS" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Основ теории цепей и линий связи"></q-btn></li>
            <li><q-btn to="/sveden/objects/labTAC" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Теории электрической связи, метрологии и электроники"></q-btn></li>
            <li><q-btn to="/sveden/objects/labSRT" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Систем радиосвязи и телевещания"></q-btn></li>
            <li><q-btn to="/sveden/objects/labSCS" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Цифровых систем коммутации и сетей связи"></q-btn></li>
            <li><q-btn to="/sveden/objects/labES" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Передачи дискретных сообщений и документальной электросвязи"></q-btn></li>
            <li><q-btn to="/sveden/objects/labMTS"  flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Многоканальных телекоммуникационных систем"></q-btn></li>
            <li><q-btn to="/sveden/objects/labSMU" flat color="primary" tag="a" icon="mdi-share-variant" label="Лаборатория Современных методов управления"></q-btn></li>
            <li><q-btn to="/sveden/objects/biblio" flat color="primary" tag="a" icon="mdi-share-variant" label="Сектор библиотечного обслуживания"></q-btn></li>
          </ul>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>

import EssentialLink from "components/EssentialLink";

const edEquipKey = [
  { name: 'address', label: 'Адрес', field: 'address', align: 'left' },
  { name: 'cabinet', label: 'Наименование оборудованных учебных кабинетов', field: 'cabinet', align: 'left'},
  { name: 'equipment', label: 'Оснащенность оборудованных учебных кабинетов', field: 'equipment', align: 'left' }
]

const edEquipRow = [
  {
    address: 'г. Ростов-на-Дону, ул.Серафимовича, д.62, кафедра ИТСС',
    cabinet:'Кабинет для защиты ВКР (307)',
    equipment: [
      'Ноутбук – 8 шт.',
      'Проектор – 1 шт.',
      'Телевизор – 1 шт.'
      ]
  },
  {
    address: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, библиотека',
    cabinet: '  Кабинет самоподготовки (202)',
    equipment: ['Персональные компьютеры с выходом в сеть интернет – 16 шт.']
  },
  {
    address: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ОНП',
    cabinet: 'Лингафонный кабинет (101А)',
    equipment: [
      'Индивидуальные рабочие места, оснащенные телефонно-микрофонной гарнитурой — 17 шт.',
      'Пульт преподавателя – 1 шт.',
      'Компьютер – 1 шт.'
      ]
  }
]

const objEquipKey = [
  {name: 'adress', label: 'Адрес', field: 'adress', align: 'left'},
  {name: 'objects', label: 'Наименование объектов для проведения практических занятий', field: 'objects', align: 'left'},
  {name: 'equipment', label: 'Оснащенность объектов для проведения практических занятий', field: 'equipment', align: 'left'}
]

const objEquipRow = [
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ОНП',
    objects: 'Лаборатория Общей физики и БЖД',
    equipment: [
      'Интерактивная-доска.',
      'Модульный учебный комплекс МУК-01 – 4 шт.',
      'МУК-02 – 4 шт.',
      'МУК-ЭМ2 – 1 шт.',
      'ФПЭ, ФПВ-03 – 1 шт.',
      'ФПВ-04 – 1 шт.',
      'МУК-ОВ – 1 шт.',
      'МУК-ОК – 1 шт.',
      'Тренажер «Максим» — 1 шт.',
      'Генератор СВЧ сигнала ГЧ-109 – 1 шт.',
      'Измерительная волноводная линия Р-28 – 1 шт.',
      'Прибор Р2-54/4 – 1 шт.',
      'Персональные компьютеры с выходом в сеть интернет – 16 шт.',
      'ПО: Сафронов В.П., Конкин Б.Б. «Курс физики». Интерактивная контрольно-обучающая программа. Конкин Б.Б., Сафронов В.П. Интерактивные тесты по курсу физики.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ОНП',
    objects: 'Лаборатория Современных методов управления (101)',
    equipment: [
      'Интерактивная-доска Smart — 2 шт.',
      'Персональные компьютеры с выходом в сеть интернет – 19 шт.',
      'Ноутбук -2 шт.',
      'Проектор BENQ -2 шт.',
      'Коммутатор D-Link DGS-1016D/1024D 16/24-PORT GIGABIT DESKTOP SWITCH — 1 комплект.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Основ теории цепей и линий связи (312, 313)',
    equipment: [
      'Учебная установка по курсу: «Электропитание устройств и систем связи» (4 стенда).',
      'Универсальная установка по исследованию характеристик оптических волоконных световодов.',
      'Стенд для исследования пассивных элементов световодных трактов.',
      'Установка по курсу «Теория электрических цепей».',
      'Оптический рефлектометр типа YOKOGAWA.',
      'Цифровые фазометры.',
      'Излучатели и измерители оптической мощности типа PHOTOM.',
      'Кабельный прибор типа ИРК-ПРО.',
      'Пассивные элементы волоконно-оптических сетей (оптические муфты, оптические кроссы и др.).',
      'Персональные компьютеры с выходом в сеть интернет – 24 шт.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Систем радиосвязи и телевещания (216)',
    equipment: [
      'Учебная установка «Устройства генерирования и формирования сигналов», 2 комплекта.',
      'Учебная установка «Радиоприемные устройства», 2 комплекта.',
      'Учебная телевизионная установка УТС-97, 1 комплект.',
      'Учебная телевизионная установка УТС-2007, 1 комплект.',
      'Учебная телевизионная стойка 2010, 1 комплект.',
      'Лабораторный модуль «Исследование автогенераторов и умножителей частоты», 1 комплект.',
      'Лабораторный модуль «Исследование генератора с внешним возбуждением», 1 комплект.',
      'Лабораторный модуль «Исследование входных цепей радиоприемных устройств, 1 комплект.',
      'Ресивер/декодер профессиональный LCT DSR-1800. 1 комплект.',
      'Цифровой декодер DCH-3100 P-20S2. 1 комплект.',
      'Модулятор цифрового ТВ сигнала стандарта DVB-T/T2 ТВЦ 0,01 (РТ И РС)-формирователь DVB-T/H «Modulator DVB-TH» ДМВ диапазона. 2 комплекта.',
      'Блок системы дистанционного контроля «СДК 5v3»? 1 комплект.',
      'Мультиплексор WPX-0401. 1 комплект.',
      'Анализатор TS потоков AT4USB. 1 комплект.',
      'Анализатор TS потоков АТ78USB. 1 комплект.',
      'Формирователь/анализатор DVB потока (модуль формирования транспортного потока Dektek DTU-245 USB-2 ASI/SDI In+Out Adapter. 1 комплект.',
      'Коммутатор D-Link DGS-1016D/1024D 16/24-PORT GIGABIT DESKTOP SWITCH. 2 комплекта.',
      'Измерительный прибор Openbox SF-120. 1 комплект.',
      'GPS/GLONASS антенна с кабелем. 2 комплекта.',
      'Антенна широкодиапазонная. 1 комплект.',
      'Антенна спутниковая. Диаметр 55 мм. 1 комплект.',
      'Антенна спутниковая. Диаметр 55 мм. Мобильная. 1 комплект.',
      'Антенна спутниковая. Диаметр 90 мм. 1 комплект.',
      'Конвертор G1 124 GVADRO круговой поляризации 11,7-12,7 МHz. 2 комплекта.',
      'Конвертор G1 211. 1 комплект.',
      'Прибор SAT-Finder SF 9505 1 комплект.',
      'Телевизионные карты Prof Read S2-7300 8 комплектов.',
      'Телевизор 3D 47″ Fhilips. 2 комплекта.',
      'Персональные компьютеры с выходом в сеть интернет – 14 шт.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Многоканальных телекоммуникационных систем',
    equipment: [
      'Атмосферно-оптическая линия связи «МОСТ».',
      'Оптический мультиплексор цифровых потоков ввода-вывода «МЦП-155К».',
      'Мультиплексор каналов с гибким конфигурированием «МК-2048/ГК».',
      'Лабораторные установки «Линейный тракт цифровой системы передачи», аппаратно-программный комплекс для изучения стандартных процедур и мониторинга сетей «Wi-Fi».',
      'Интегрированная система мониторинга и управления сетью (ИСМУС);',
      'Анализатор параметров цифровых трактов.',
      'Персональные компьютеры с выходом в сеть интернет – 17 шт.',
      'ИКМ-480.',
      'ИКМ-15.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Цифровых систем коммутации и сетей связи',
    equipment: [
      'Интерактивный класс «СОТСБИ-У».',
      'Лабораторные стенды: - Устройство и алгоритм работы цифровой системы коммутации SI-2000; - Устройство и алгоритм работы цифровой системы коммутации EWSD; - Устройство и алгоритм работы цифровой системы коммутации Alcatel S-12; - Устройство и алгоритм работы сотовой сети связи стандарта GSM. - Устройстов Open Scape Office MX/LX - Устройство HiPath 3800 Unify Communications',
      'Персональные компьютеры с выходом в сеть интернет – 13 шт.',
      'ПО - GPSS World.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Передачи дискретных сообщений и документальной электросвязи (214)',
    equipment: [
      'Многофункциональная система обработки и передачи информации REX-400.',
      'Телеграфный терминал на базе ПЭВМ с модемом «Альфа-Телекс».',
      'Телеграфный аппарат F-2000;',
      'Телеграфный аппарат F-2500;',
      'Персональные компьютеры с выходом в сеть интернет – 16 шт.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИВТ',
    objects: 'Лаборатория Вычислительной техники и информатики (218)',
    equipment: [
      'Персональные компьютеры с выходом в сеть Интернет – 19 шт.',
      'проектор, интерактивная доска;',
      'комплект оборудования Cisco;',
      'AVR-studio – программное обеспечение микроконтроллеров;',
      'Proteus — программное обеспечение для моделирования аналоговых и цифровых схем и процессов;',
      'Вариант — программное обеспечение для моделирования цифровых схем;',
      'ArduinoIDE — программное обеспечение для моделирования робототехнических комплексов;',
      'Виртуальная ЭВМ;',
      'Lazarus – программное обеспечение для решения задач вычислительной математики и компьютерной графики;',
      'GIMP — программное обеспечение для компьютерной графики;',
      'AutoDesk Inventor — программное обеспечение для компьютерной графики;',
      'Oracle-VM virtual box – программное обеспечение для работы с операционными системами;',
      'MicrosoftVisio — программное обеспечение для компьютерной графики;',
      'RamusEducational – программное обеспечение для проектирования сложных систем;',
      'MicrosoftAсcess — программное обеспечение для моделирования и компьютерной графики;',
      'VisualStudio2017 (C#,C++) — программное обеспечение для моделирования и компьютерной графики;',
      'Sсratch — программное обеспечение для моделирования и анализа языков программирования.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИВТ',
    objects: 'Лаборатория Теории электрической связи, метрологии и электроники (310)',
    equipment: [
      'Лабораторные стенды по теории электрической связи с пятью сменными блоками (3 шт.);',
      'Лабораторные стенды по микроэлектронике(4 шт.);',
      'Ноутбуки (2шт.), проекторы (2 шт.);',
      'Осциллографы (8шт.), генераторы (10 шт.), измерительные приборы (8 шт.);',
      'AVR-studio – программное обеспечение микроконтроллеров;',
      'Proteus — программное обеспечение для моделирования аналоговых и цифровых схем и процессов;',
      'Вариант — программное обеспечение для моделирования цифровых схем.',
      'Персональные компьютеры с выходом в сеть Интернет – 12 шт.'
      ]
  }
]

const specDirectionKey = [
  { name: 'item', label: '№ п/п', field: 'item', align: 'center' },
  { name: 'name', label: 'Наименование специальности', field: 'name', align: 'center' },
  { name: 'direction', label: 'Направления подготовки', field: 'direction', align: 'center' }
]

const specDirectionRow = [
  {
    item: '1',
    name: '«Информатика и вычислительная техника»',
    direction: {
      link: 'http://www.skf-mtusi.ru/files/mto/mto_vmkss.pdf',
      label: 'Профиль ВМКСС'
    }
  },
  {
    item: '2',
    name: '«Информатика и вычислительная техника»',
    direction: {
      link: '#!',
      label: 'Профиль ПОиИС'
    }
  },
  {
    item: '3',
    name: '«Инфокоммуникационные технологии и системы связи»',
    direction: {
      link: 'http://www.skf-mtusi.ru/files/mto/mto_zss.pdf',
      label: 'Профиль ЗСС'
    }
  },
  {
    item: '4',
    name: '«Инфокоммуникационные технологии и системы связи»',
    direction: {
      link: 'http://www.skf-mtusi.ru/files/mto/mto_mts.pdf',
      label: 'Профиль МТС'
    }
  },
  {
    item: '5',
    name: '«Инфокоммуникационные технологии и системы связи»',
    direction: {
      link: 'http://www.skf-mtusi.ru/files/mto/mto_sssk.pdf',
      label: 'Профиль СССК'
    }
  }
]

const mtoColumns = [
  { name: 'type', field: 'type', label: 'Вид помещения', align: 'center' },
  { name: 'address', field: 'address', label: 'Адрес местонахождения', align: 'center' },
  { name: 'square', field: 'square', label: 'Площадь, м2', align: 'center' },
  { name: 'count', field: 'count', label: 'Количество мест', align: 'center' }
]

const mtoRows = [
  {
    type: 'Библиотека',
    address: 'г. Ростов-на-Дону, ул Серафимовича, 62',
    square: '99',
    count: '30'
  },
  {
    type: 'Столовая/Буфет',
    address: 'г. Ростов-на-Дону, ул Серафимовича, 62',
    square: '27',
    count: '32'
  },
  {
    type: 'Студенческая поликлиника',
    address: 'г. Ростов-на-Дону, ул. Казахская 76',
    square: '656,8',
    count: '29 кабинетов'
  },
  {
    type: 'Спортивный зал',
    address: 'г. Ростов-на-Дону, ул. Текучева, 149',
    square: '100',
    count: '-'
  }
]

const webResources = [
  {
    label: 'Министерство образования и науки Российской Федерации',
    link: 'http://минобрнауки.рф/'
  },
  {
    label: 'Федеральная служба по надзору в сфере образования и науки',
    link: 'http://obrnadzor.gov.ru/'
  },
  {
    label: 'Федеральный портал «Российское образование»',
    link: 'http://www.edu.ru/'
  },
  {
    label: 'Информационная система «Единое окно доступа к образовательным ресурсам»',
    link: 'http://window.edu.ru/'
  },
  {
    label: 'Федеральный центр информационно-образовательных ресурсов',
    link: 'http://fcior.edu.ru/'
  },
  {
    label: 'Электронно-библиотечная система «Знаниум.ком»',
    link: 'http://www.znanium.com/'
  },
  {
    label: 'Электронно- библиотечная система IPRbooks',
    link: 'http://www.iprbookshop.ru/'
  },
  {
    label: 'СКФ МТУСИ Учебно-методические материалы',
    link: 'http://www.skf-mtusi.ru/?page_id=659'
  },
  {
    label: 'СКФ МТУСИ Электронное портфолио студента',
    link: 'http://www.skf-mtusi.ru/?page_id=3773'
  }
]


export default ({
  components: {
    EssentialLink
  },
  setup() {
    return {
      edEquipKey,
      edEquipRow,
      objEquipKey,
      objEquipRow,
      specDirectionKey,
      specDirectionRow,
      mtoRows,
      mtoColumns,
      webResources
    }
  },
})
</script>
