<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-grey-10 text-h3">Лаборатория Вычислительной техники и информатики</span>
      </div>
      <div class="col-12">
        <q-card>
          <q-card-section>
            Создание лаборатории вычислительной техники и информатики было шагом, позволившим идти в ногу со временем в период совершенствования персональных компьютеров и создания новых информационных технологий. Эта лаборатория является старейшей в филиале.
          </q-card-section>
          <q-card-section>
            За сравнительно короткий срок в ней трижды происходила принципиальная смена оборудования и вычислительной техники. А начиналось все с вычислительной машины “НАИРИ” и комплекса ДВК – 3М.
          </q-card-section>
          <q-card-section>
            Данная лаборатория является материальной основой изучения следующих дисциплин:
            <ul>
              <li>Информатика;</li>
              <li>Инженерная и компьютерная графика;</li>
              <li>Операционные системы;</li>
              <li>Технологии языков программирования;</li>
              <li>Вычислительная техника;</li>
              <li>Процедурные языки программирования;</li>
              <li>Технологии баз данных</li>
              <li>Дискретная математика;</li>
              <li>Схемотехника;</li>
              <li>Электроника;</li>
              <li>Электротехника;</li>
              <li>Проектирование сложных систем;</li>
              <li>Теория автоматов;</li>
              <li>Моделирование;</li>
              <li>Основы теории управления</li>
              <li>Системное программное обеспечение.</li>
              <li>Конструкторско-технологическое обеспечение производства ЭВМ;</li>
              <li>Микропроцессорные системы;</li>
              <li>Автоматизация управления информационными системами;</li>
              <li>Основы компьютерного моделирования;</li>
              <li>Основы реляционных баз данных;</li>
              <li>Цифровая обработка сигналов;</li>
              <li>ЭВМ и периферийные устройства;</li>
              <li>Системы искусственного интеллекта;</li>
              <li>Объективно-ориентированное программирование;</li>
              <li>Интерфейсы периферийных устройств.</li>
            </ul>
          </q-card-section>
          <q-card-section>
            На базе лаборатории студенты выполняют задания по лабораторным работам:
            <ul>
              <li>Программирование циклических вычислительных процессов;</li>
              <li>Программирование процессов одномерной оптимизации (дихотомия и золотое сечение);</li>
              <li>Работа в среде САПР AutuDesk Inventor по созданию 3-х мерных изображений деталей и чертежей деталей;</li>
              <li>Работа в среде MS Visio по составлению планов помещений и размещению в них элементов ВТ, созданию организационных диаграмм и т.д.;</li>
              <li>Использование графических возможностей пакетов MS Word? MS Excel и Qucs;</li>
              <li>Работа в среде визуального программирования Lazarus и графического редактора Gimp.</li>
              <li>Преобразователь кодов;</li>
              <li>Счётчики-регистры;</li>
              <li>Подпрограммы пользователя (процедуры);</li>
              <li>Исследование функционирования МП при выполнении команд передачи управления;</li>
              <li>Создание модели данных и модели процессов. Создание модели данных с помощью BPWin и ER Win. Связывание модели данных и модели процессов. Исследование общей структуры модели. Разработка контекстной программы, словаря стрелок, построение диаграммы декомпозиции;</li>
              <li>Исследование мультиплексоров и их использование для реализации булевых функций;</li>
              <li>Система имитационного моделирования GPSS;</li>
              <li>Исследование системных средств управления ФС.</li>
            </ul>
          </q-card-section>
          <q-card-section>
            Данная лаборатория обучает студентов филиала по всем направлениям подготовки. За последние 5 лет парк компьютерной техники был полностью обновлён на более современный, работающий на процессорах Intel Core i3 и выше.
          </q-card-section>
          <q-card-section>
            Также приобретено лицензионное программное обеспечение (операционные системы, прикладные программные продукты и др.), а для большей наглядности учебного процесса была внедрена интерактивная-доска.
          </q-card-section>
          <q-card-section>
            На базе лаборатории в 2007 году была открыта Локальная Сетевая академия Cisco, которая предоставляет возможность получения профессиональных навыков, необходимых для успешной высокооплачиваемой работы практически во всех производственных сферах современного общества.
          </q-card-section>
          <q-card-section>
            Для улучшения качества образовательного процесса, на компьютерах лаборатории был установлен программный продукт Autodesk. Программное обеспечение разработано на основе технологии цифровых прототипов и предназначено для трехмерного проектирования сложных систем. В настоящее время Autodesk используется для выполнения работ по дисциплине «Инженерная и компьютерная графика», и так же используется при курсовом и дипломном проектировании.
          </q-card-section>
          <q-card-section>
            В 2010 году начал работать тестовый центр Национальной системы тестирования и сертификации Alltests – первый на Юге страны. Открытие подобного независимого центра тестирования дает вузу дополнительные инструменты для оценки компетенций студентов и сотрудников. При этом студенты и выпускники получают сертификат о владении компьютерными навыками, который послужит им дополнительным бонусом на рынке труда.
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 row q-col-gutter-sm">
        <div class="col-md-3 col-12">
          <q-img src="http://www.skf-mtusi.ru/images/sved/mto/lab/vt1.jpg"></q-img>
        </div>
        <div class="col-md-3 col-12">
          <q-img src="http://www.skf-mtusi.ru/images/sved/mto/lab/vt2.jpg"></q-img>
        </div>
        <div class="col-md-3 col-12">
          <q-img src="http://www.skf-mtusi.ru/images/sved/mto/lab/vt3.jpg"></q-img>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labIVT"
}
</script>

<style scoped>

</style>
