<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-grey-10 text-h3">
          Лаборатория Общей физики и БЖД
        </span>
      </div>
      <div class="col-12 row q-col-gutter-sm">
        <div class="col-md-10 col-12">
          <q-card>
            <q-card-section>
              Лаборатория Физики, Экологии и безопасности жизнедеятельности одной из первых приобщает студентов к эксперименту, комплексу измерений, построению системы исследований. И, несмотря на то, что физика изучается и в школе, лабораторный эксперимент в филиале по этой дисциплине является важным и имеет свои отличительные качества. Это использование компьютерных технологий, математического моделирования, системного штатного лабораторного оборудования, технологий сбора и обработки результатов экспериментов.
            </q-card-section>
            <q-card-section>
              Лаборатория физики – одна из старейших в филиале. Ее появление относится ко времени становления самого филиала. Развитие этой лаборатории также происходило адекватно этапам становления учебно-материальной базы самого филиала.
            </q-card-section>
            <q-card-section>
              На этапе становления филиала большая часть приборов и оборудования создавались руками самих студентов. Это позволило в то время в условиях трудностей приобретения штатного оборудования и установок проводить лабораторные работы на достаточном уровне.
            </q-card-section>
            <q-card-section>
              Сегодня лаборатория обеспечивает подготовку будущих связистов по всем разделам физики и выполнение более 30 лабораторных работ по темам:
              <ul>
                <li>изучение вращательного движения тела;</li>
                <li>определение вязкости жидкости по методу Стокса;</li>
                <li>изучение электрического поля;</li>
                <li>изучение стоячих волн в струне;</li>
                <li>изучение внутреннего фотоэффекта и др.</li>
              </ul>
            </q-card-section>
            <q-card-section>
              В лаборатории имеются новые установки, соответствующие современному уровню преподавания физики как базовой дисциплины. Например, комплекс «Электромагнетизм» обеспечивает выполнение более 10 лабораторных работ исследовательского характера.
              <b>Модульный комплекс позволяет проводить около 20 лабораторных работ по механике и оптике.</b>
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-2 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/Bogdanova.jpg"
            height="auto"
          ></q-img>
        </div>
      </div>
      <div class="col-12">
        <q-card>
          <q-card-section>
            Для более углубленного изучения физических процессов в электросвязи на кафедре общенаучной подготовки применяются компьютерные программы «Курс физики» и «тестирование», которые включают в себя:
            <ul>
              <li>лекции, дополненные виртуальным демонстрационным экспериментом;</li>
              <li>тесты, качественные и расчётные задачи;</li>
              <li>виртуальный лабораторный практикум;</li>
              <li>справочные материалы;</li>
            </ul>
          </q-card-section>
          <q-card-section>
            Как показывает опыт, использование данных программ наряду со стендовыми лабораторными работами в процессе обучения позволяет:
            <ul>
              <li>повысить интерес студентов к изучению физики,</li>
              <li>увеличить возможности лаборатории, расширив диапазон разделов физики, по которым проводятся лабораторные работы,</li>
              <li>проводить оценку знаний студентов по модульно-рейтинговой системе,</li>
              <li>расширить возможности студентов при подготовке к сдаче экзаменов и зачетов.</li>
            </ul>
          </q-card-section>
          <q-card-section>
            Кроме общей физики в данной лаборатории изучаются основы безопасности жизнедеятельности и охраны окружающей среды. В помощь этому существует комплекс технических средств, который позволяет с большой наглядностью и доступностью измерять, демонстрировать, осуществлять обработку данных и делать соответствующие выводы, получать практические навыки по оказанию доврачебной помощи пострадавшим.
          </q-card-section>
          <q-card-section>
            <b>Дополнительно к названным дисциплинам в лаборатории проводятся лабораторные работы по ЭМПВ (электромагнитные поля и волны) Приобретен комплект из 6 виртуальных лабораторных работ по этой дисциплине, позволяющий более глубоко понять и осмыслить данную дисциплину.</b>
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 row q-col-gutter-sm">
        <div class="col-12 col-md-3">
          <q-img src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/1_1.jpg"></q-img>
        </div>
        <div class="col-12 col-md-3">
          <q-img src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/1_2.jpg"></q-img>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labMainPhysicBZD"
}
</script>

<style scoped>

</style>
