<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-grey-10 text-h3">Лаборатория Многоканальных телекоммуникационных систем</span>
      </div>
      <div class="col-12 row q-col-gutter-sm">
        <div class="col-md-10 col-12">
          <q-card>
            <q-card-section>
              Лаборатория многоканальных телекоммуникационных систем образована в 1987 году. Прообразом современной лаборатории была лаборатория, которая создавалась с первых дней существования филиала. Как и все лаборатории, она свои истоки берет с первых макетов, демонстрационных стендов и установок, обеспечивавших учебный процесс будущих бакалавров связи.
            </q-card-section>
            <q-card-section>
              В отличие от прошлых лет сегодняшние возможности лаборатории стали обширнее, учебно-материальная база обеспечивает изучение студентами современных инфокоммуникационных технологий, что достигается проведением лабораторного практикума по следующим дисциплинам:
              <ul>
                <li>Многоканальные телекоммуникационные системы (МТС);</li>
                <li>Цифровые системы передачи (ЦСП);</li>
                <li>Введение в специальность;</li>
                <li>Протоколы и интерфейсы;</li>
                <li>Методы и средства измерения в телекоммуникациях;</li>
                <li>Функциональные узлы в ЦСП;</li>
                <li>Проектирование и эксплуатация систем передачи.</li>
                <li> Методы технического контроля и управления в ЦСП.</li>
              </ul>
            </q-card-section>
            <q-card-section>
              Лаборатория находится в составе компьютерной локальной сети и имеет выход в глобальную сеть Internet. Лабораторные работы выполняются на реальном оборудовании, в электронном варианте.
            </q-card-section>
            <q-card-section>
              Лаборатория многоканальных телекоммуникационных систем является базовой в подготовке бакалавров МТС. Такие средства связи: атмосферно-оптическая линия связи «МОСТ», оптический мультиплексор цифровых потоков ввода-вывода «МЦП-155К», мультиплексор каналов с гибким конфигурированием «МК-2048/ГК», лабораторные установки «Линейный тракт цифровой системы передачи», аппаратно-программный комплекс для изучения стандартных процедур и мониторинга сетей «Wi-Fi» позволяют выполнять лабораторные работы и практикумы в соответствии с учебными программами.
            </q-card-section>
            <q-card-section>
              За последние годы приобретены:
              <ul>
                <li>интегрированная система мониторинга и управления сетью (ИСМУС);</li>
                <li>анализатор параметров цифровых трактов.</li>
              </ul>
              <p>Они позволяют осуществлять мониторинг устройств МЦП155, производить тестовые испытания на сетях PDH/SDH.</p>
              <p>Установленное в лабораторных условиях оборудование, сконфигурированное в многофункциональную сеть, позволяет нашим выпускникам получить совершенные знания по технологиям Wi-Fi, SDH, FSO, Fast Ethernet.</p>
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-2 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/Savchenko.jpg"
          ></q-img>
        </div>
      </div>
      <div class="col-12 row justify-center q-col-gutter-sm">
        <div class="col-md-4 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/8_1.jpg"
            height="480px"
            fit="contain"
          ></q-img>
        </div>
        <div class="col-md-4 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/8_2.jpg"
            height="480px"
            fit="contain"
          ></q-img>
        </div>
        <div class="col-md-4 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/8_4.jpg"
            height="480px"
            fit="contain"
          ></q-img>
        </div>
        <div class="col-md-4 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/8_6.jpg"
            height="480px"
            fit="contain"
          ></q-img>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labMTS"
}
</script>

<style scoped>

</style>
