<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-grey-10 text-h3">Лаборатория Основ теории цепей и линий связи</span>
      </div>
      <div class="col-12 row q-col-gutter-sm text-subtitle1">
        <div class="col-md-10 col-12">
          <q-card>
            <q-card-section>
              Лаборатория обеспечивает проведение учебного процесса по нескольким направлениям:
              <ul>
                <li>Направляющие системы электросвязи.</li>
                <li>Электропитание устройств и систем электросвязи.</li>
                <li>Физические основы оптической связи.</li>
                <li>Основы теории электрических цепей.</li>
              </ul>
            </q-card-section>
            <q-card-section>
              Лаборатория располагается в двух помещениях, в которых проводятся 36 лабораторных работ по темам:
              <ul>
                <li>Исследование оптоволоконных и электрических кабелей связи.</li>
                <li>Изучение принципов действия выпрямителей, фильтров, стабилизаторов, трансформаторов.</li>
                <li>Исследование характеристик лазерных диодов, светодиодов и фотоприемников волоконно-оптических систем передачи.</li>
                <li>Изучение теории электрических цепей.</li>
              </ul>
            </q-card-section>
            <q-card-section>
              Лаборатория укомплектована 7-ю современными универсальными стендами:
              <p>1. Учебная установка по курсу:</p>
              <p>“Электропитание устройств и систем связи“ (4 стенда).</p>
              <p>Установка предназначена для проведения лабораторно-практических занятий со студентами института.</p>
              <p>Кроме того установка может быть использована для проведения занятий на курсах повышения квалификации.</p>
              <p>2. Универсальная установка по исследованию характеристик оптических волоконных световодов.</p>
              <p>3. Стенд для исследования пассивных элементов световодных трактов.</p>
              <p>4. Установка по курсу “Теория электрических цепей“.</p>
            </q-card-section>
            <q-card-section>
              Лаборатория укомплектована также новыми приборами:
              <ul>
                <li>Оптический рефлектометр типа YOKOGAWA.</li>
                <li>Цифровые фазометры.</li>
                <li>Излучатели и измерители оптической мощности типа PHOTOM.</li>
                <li>Кабельный прибор типа ИРК-ПРО.</li>
              </ul>
            </q-card-section>
            <q-card-section>
              <p>Все рабочие места для изучения теории электрических цепей укомплектованы современными осциллографами типа АСК – 1051.</p>
              <p>В плане развития предусмотрено приобретение новых универсальных стендов по теории электрических цепей и виртуальных лабораторных работ.</p>
              <p>Лаборатория № 3 оснащена компьютерами, на которых проводятся компьютерные варианты лабораторных работ по изучению оптических волокон и работы оптического рефлектометра.</p>
              <p>Лаборатория оснащена пассивными элементами волоконно- оптических сетей (оптическими муфтами, оптическими кроссами и др.)</p>
              <p>Компьютеры имеют выход в локальную и глобальную сети.</p>
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-2 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/3_zav.jpg"
              height="auto"
            ></q-img>
          </q-card>
        </div>
      </div>
      <div class="col-12 row justify-center q-col-gutter-sm">
        <div class="col-12 col-md-3">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/3_1.jpg"
            height="400px"
          ></q-img>
        </div>
        <div class="col-12 col-md-3">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/3_2.jpg"
            height="400px"
          ></q-img>
        </div>
        <div class="col-12 col-md-3">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/3_3.jpg"
            height="400px"
          ></q-img>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labOTS"
}
</script>

<style scoped>

</style>
