<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-grey-10 text-h3">Лаборатория Современных методов управления</span>
      </div>
      <div class="col-12">
        <q-card>
          <q-card-section>
            Лаборатория была создана в 2015 г. в связи с необходимостью обучения студентов современным методам управления, в том числе теми, которые уже получили достаточное распространение на многих российских предприятиях. Главной функцией лаборатории является информационно-техническое обеспечение деятельности филиала по реализации учебных программ по различным направлениям и профилям обучения.
          </q-card-section>
          <q-card-section>
            Лаборатория была оснащена современной компьютерной техникой, интерактивной доской, мультимедийным проектором, удобными рабочими местами для студентов.
            Это позволило проводить в ней не только учебные лабораторные и практические занятия, но и организовывать заседания Круглого стола, которые проводились вместе с руководителями отрасли связи и ведущими специалистами по современным актуальным проблемам связанным с эффективным управлением предприятиями.
          </q-card-section>
          <q-card-section>
            Лаборатория стала материальной основой изучения следующих дисциплин:
            <ul>
              <li>Производственный менеджмент;</li>
              <li>Маркетинг в отрасли инфокоммуникаций;</li>
              <li>Экономика;</li>
              <li>Экономика отрасли инфокоммуникаций;</li>
              <li>Искусство деловых отношений;</li>
              <li>Основы организационно-правового обеспечения информационной безопасности сетей и систем;</li>
              <li>Социология;</li>
              <li>Правоведение;</li>
              <li>Экология;</li>
              <li>Информатика;</li>
              <li>Математическая логика и теория алгоритмов;</li>
              <li>Дискретная математика;</li>
              <li>Основы компьютерного моделирования.</li>
            </ul>
          </q-card-section>
          <q-card-section>
            На базе лаборатории студенты выполняют задания по лабораторным работам:
            <ul>
              <li>Проектирование организационно-управленческих структур;</li>
              <li>Создание простых запросов;</li>
              <li>Создание сложных запросов;</li>
              <li>Разработка форм;</li>
              <li>Разработка отчетов;</li>
              <li>Работа с БД на языке SQL;</li>
              <li>Разработка структуры данных на сервере;</li>
              <li>Организация транзакций к БД;</li>
              <li>Гипертекстовые БД.</li>
            </ul>
            <p>На базе данной лаборатории преподавателями кафедр реализуются и совершенствуются интерактивные формы и методы проведения учебных занятий, позволяющие повысить понимание и усвоение студентами учебного материала на фоне общей заинтересованности.</p>
          </q-card-section>
          <q-card-section>
            В числе таких интерактивных направлений можно выделить следующие:
            <ul>
              <li>занятия, проводимые в форме дискуссий, проблемных лекций, круглых столов;</li>
              <li>разработка и выполнение творческих заданий по проектированию бизнес-процессов;</li>
              <li>активизация познавательной деятельности посредством применения на практических занятиях методов мозгового штурма;</li>
              <li>деловые игры по маркетингу.</li>
            </ul>
          </q-card-section>
          <q-card-section>
            <p>На установленном в лаборатории оборудовании всеми преподавателями систематически используется модульно-рейтинговая система с проведением компьютерного тестирования как средства рубежного контроля знаний.</p>
            <p>В целях повышения эффективности учебного процесса было приобретено лицензионное программное обеспечение (операционные системы, прикладные программные продукты и др.), а для большей наглядности учебного процесса была внедрена интерактивная-доска.</p>
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 col-md-6">
        <q-img
          src="http://www.skf-mtusi.ru/images/sved/mto/lab/ek1_1.jpg"
          height="480px"
        ></q-img>
      </div>
      <div class="col-12 col-md-6">
        <q-img
          src="http://www.skf-mtusi.ru/images/sved/mto/lab/ek2_1.jpg"
          height="480px"
        ></q-img>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labSMU"
}
</script>

<style scoped>

</style>
