<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <div class="text-grey-10 text-h3">Лаборатория Систем радиосвязи и телевещания</div>
        <span class="text-overline">Общие сведения (характеристика учебной лаборатории).</span>
      </div>
      <div class="col-12 row q-col-gutter-sm">
        <div class="col-12 col-md-10">
          <q-card>
            <q-card-section>
              Лаборатория «Систем радиосвязи и телевещания» создана в 1990 году и является структурным подразделением Северо-Кавказского филиала Московского технического университета связи и информатики.
              <br>
              Лаборатория расположена на втором этаже, в южной части здания в аудитории № 216 и имеет размеры помещения 7,5Х7,5 (м).
              <br>
              Лаборатория имеет на оснащении сплит-систему, а также жалюзи на окнах, выходящих на южную сторону, что позволяет создавать и поддерживать комфортные условия для участников учебного процесса.
            </q-card-section>
            <q-card-section>
              <p>1. Оснащение учебной лаборатории оборудованием.</p>
              <p>За годы существования лаборатории на ее оснащение поступили учебные лабораторные установки и оборудование, позволившие значительно расширить возможности учебного процесса и соответствующие современному уровню преподавания дисциплин, а именно:</p>
              <q-table
                :columns="[
                  { name: 'index', field: 'index', label: '№ п/п', align: 'center' },
                  { name: 'equipment', field: 'equipment', label: 'Наименование оборудования', align: 'center' },
                  { name: 'count', field: 'count', label: 'Количество', align: 'center' }
                ]"
                :rows="[
                  { index: '1', equipment: 'Учебная установка «Устройства генерирования и формирования сигналов»', count: '2 комплекта' },
                  { index: '2', equipment: 'Учебная установка «Радиоприемные устройства»', count: '2 комплекта' },
                  { index: '3', equipment: 'Учебная телевизионная установка УТС-97', count: '1 комплект' },
                  { index: '4', equipment: 'Учебная телевизионная установка УТС-2007', count: '1 комплект' },
                  { index: '5', equipment: 'Учебная телевизионная стойка 2010', count: '1 комплект' },
                  { index: '6', equipment: 'Лабораторный модуль «Исследование автогенераторов и умножителей частоты»', count: '1 комплект' },
                  { index: '7', equipment: 'Лабораторный модуль «Исследование генератора с внешним возбуждением»', count: '1 комплект' },
                  { index: '8', equipment: 'Лабораторный модуль «Исследование входных цепей радиоприемных устройств', count: '1 комплект' }
                ]"
                :pagination="{
                  rowsPerPage: 0
                }"
              ></q-table>
            </q-card-section>
          </q-card>
        </div>
        <div class="col-12 col-md-2">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/Bashkirova.jpg"
          ></q-img>
        </div>
      </div>
      <div class="col-12">
        <q-card>
          <q-card-section>
            Учебные лабораторные установки позволили организовать изучение принципов передачи информации по радиорелейным линиям связи, свойств частотно-модулированных сигналов в радиорелейных линиях, измерение основных характеристик оборудования, принципов передачи телевизионных сигналов и их измерение, работу радиоприемных устройств, принципов работы звуковоспроизводящих и записывающих устройств, а также проводить с их применением лабораторные работы и выполнять работы исследовательского характера.
          </q-card-section>
          <q-card-section>
            <q-table
              title="Перечень дисциплин и лабораторных работ проводимых в лаборатории"
              :rows="labRows"
              :columns="labColumns"
              :pagination="{
                rowsPerPage: 0
              }"
            >
              <template v-slot:body="props">
                <q-tr :props="props">
                  <q-td key="index" :props="props">
                    {{props.row.index}}
                  </q-td>
                  <q-td key="disciplines" :props="props">
                    {{props.row.disciplines}}
                  </q-td>
                  <q-td key="worksName" :props="props" class="text-left">
                    <template v-for="work in props.row.worksName">
                      <span>{{work}}</span><br>
                    </template>
                  </q-td>
                </q-tr>
              </template>
            </q-table>
          </q-card-section>
          <q-card-section>
            <q-table
              title="В 2013 году в соответствии с принятым решением об организации переподготовки кадров на базе СКФ МТУСИ в лабораторию поступило следующее оборудование"
              :rows="labEquipRows"
              :columns="labEquipColumns"
              :pagination="{
                rowsPerPage: 0
              }"
            ></q-table>
          </q-card-section>
          <q-card-section>
            <p>Поступившее оборудование позволило проводить занятия не только со студентами, но и со слушателями курсов повышения квалификации по теме: «Стандарты систем цифрового телерадиовещания в стандарте DVB-T2».</p>
            <p>Для проведения занятий по цифровому телевещанию в лаборатории оборудовано шесть учебных мест (по количеству имеющихся приборов).</p>
            <p>В лаборатории разработан и смонтирован коммутатор, состоящий из шести модулей, в гнездное поле которых включено все имеющееся оборудование, в том числе антенны (спутниковые, широкодиапазонная), приборы и телевизоры, что позволяет оперативно производить соединение (коммутацию) оборудования.</p>
            <p>16 августа 2013 года впервые в истории СКФ МТУСИ в лаборатории с применением аппаратно-программного комплекса был осуществлен прием и обработка сигналов спутникового телевидения.</p>
            <p>В лаборатории начат монтаж оборудования цифровых радиорелейных станций. Ввод их в эксплуатацию значительно расширит возможности лаборатории в проведении занятий со студентами, а также позволит рассмотреть возможность организации курсов повышения квалификации специалистов, как по эксплуатации радиорелейной связи, так и сотовой связи.</p>
            <p>Учебные места студентов и слушателей курсов повышения квалификации оборудованы персональными компьютерами с выходом в сеть Интернет и необходимым прикладным программным обеспечением.</p>
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 q-col-gutter-sm row">
        <div class="col-md-4 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/images/sved/mto/lab/5_1.jpg"
              height="460px"
              fit="contain"
            ></q-img>
            <q-card-section>
              Оборудование систем радиосвязи.
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-4 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/images/sved/mto/lab/5_2.jpg"
              height="460px"
              fit="contain"
            ></q-img>
            <q-card-section>
              Оборудование систем телевещания
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-4 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/images/sved/mto/lab/5_3.jpg"
              height="460px"
              fit="contain"
            ></q-img>
            <q-card-section>
              Оборудование для проведения курсов повышения квалификации
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-4 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/images/sved/mto/lab/5_4.jpg"
              height="460px"
              fit="contain"
            ></q-img>
            <q-card-section>
              Занятия со студентами проводит доцент Жуковский А.Г.
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-4 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/images/sved/mto/lab/5_5.jpg"
              height="460px"
              fit="contain"
            ></q-img>
            <q-card-section>
              Работой по настройке спутникового оборудования руководит зав. Лабораторией Захаров Ю.П.
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-4 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/images/sved/mto/lab/5_6.jpg"
              height="460px"
              fit="contain"
            ></q-img>
            <q-card-section>
              Подготовка к проведению дня открытых дверей
            </q-card-section>
          </q-card>
        </div>
        <div class="col-md-4 col-12">
          <q-card>
            <q-img
              src="http://www.skf-mtusi.ru/images/sved/mto/lab/5_7.jpg"
              height="460px"
              fit="contain"
            ></q-img>
            <q-card-section>
              День открытых дверей
            </q-card-section>
          </q-card>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labSRT",
  setup() {
    const labRows = [
      { index: '1', disciplines: 'Основы радиосвязи и телевидения', worksName: [
        'Исследование синтезаторов частоты.', 'Исследование структуры полного телевизионного сигнала (ПТВС).',
        'Исследование кадровой и строчной развертки телевизионного приемника.', 'Кодирование и декодирование цветовых сигналов в системе SECAM.'
        ] },
      { index: '2', disciplines: 'Спутниковые и радиорелейные системы передачи', worksName: [
        'Исследование автогенератора с частотной модуляцией.', 'Исследование радиорелейных станций.',
        'Исследование системы спутникового телевизионного вещания.', 'Исследование спутниковых систем с использованием программы SMW LINK.'
        ] },
      { index: '3', disciplines: 'Сети и системы радиосвязи', worksName: [
        'Исследование антенн, применяемых в системах радиосвязи.', 'Исследование антенн, применяемых в сетях радиосвязи.'
        ] },
      { index: '4', disciplines: 'Спутниковые и наземные системы радиосвязи', worksName: [
        'Конфигурирование, мониторинг и настройка параметров радиорелейных станций PASOLINK NEO, РРС MINI-LINK, NOKIA FLEXIHOPPER.',
        'Построение продольного профиля трассы РРЛ с помощью программного комплекса PROFEDIT 3.0.',
        'Исследование программы SMW LINK.', 'Расчет и установка углов спутниковых антенн с помощью специализированных программ.'
        ] },
      { index: '5', disciplines: 'Системы радиосвязи с подвижными объектами', worksName: [
        'Исследование антенн, применяемых в системах сотовой связи.', 'Исследование характеристик беспроводной сети передачи данных с использованием программы XIRRUS WI-FI INSPECTOR.',
        'Исследование характеристик беспроводной сети передачи данных с использованием программы INSIDER 2.0.'
        ] },
      { index: '6', disciplines: 'Технологии цифрового телерадиовещания', worksName: [
        'Гост р. Передающее оборудование DVB-T/T2. Технические требования. Основные параметры. Методы измерений.',
        'Исследование синтезаторов частоты.', 'Исследование принципов дискретизации и квантования ПТВС.',
        'Мультиплексирование, демультиплексирование и обработка мультиплекса.', 'Анализ транспортного потока.', 'Исследование DVB-Т2 модуляторов.'
        ] },
      { index: '7', disciplines: 'Линии радиосвязи и методы их защиты', worksName: [
        'Исследование влияния земли на распространение радиоволн.', 'Расчет и установка углов спутниковых антенн с помощью специализированных программ и измерительных систем.',
        'Исследование синтезаторов частоты.'
        ] }
    ]

    const labColumns = [
      { name: 'index', field: 'index', label: '№ п/п', align: 'center' },
      { name: 'disciplines', field: 'disciplines', label: 'Дисциплина', align: 'center' },
      { name: 'worksName', field: 'worksName', label: 'Название лабораторной работы', align: 'center' },
    ]

    const labEquipRows = [
      { index: '1', equip: 'Ресивер/декодер профессиональный LCT DSR-1800.', count: '	1 комплект' },
      { index: '2', equip: 'Цифровой декодер DCH-3100 P-20S2.', count: '	1 комплект' },
      { index: '3', equip: 'Модулятор цифрового ТВ сигнала стандарта DVB-T/T2 ТВЦ 0,01 (РТ И РС)-формирователь DVB-T/H «Modulator DVB-TH» ДМВ диапазона.', count: '2 комплекта' },
      { index: '4', equip: 'Блок системы дистанционного контроля «СДК 5v3»', count: '1 комплект' },
      { index: '5', equip: 'Мультиплексор WPX-0401.', count: '1 комплект' },
      { index: '6', equip: 'Анализатор TS потоков AT4USB.', count: '1 комплект' },
      { index: '7', equip: 'Анализатор TS потоков АТ78USB.', count: '1 комплект' },
      { index: '8', equip: 'Формирователь/анализатор DVB потока (модуль формирования транспортного потока Dektek DTU-245 USB-2 ASI/SDI In+Out Adapter.', count: '1 комплект' },
      { index: '9', equip: 'Коммутатор D-Link DGS-1016D/1024D 16/24-PORT GIGABIT DESKTOP SWITCH.', count: '2 комплекта' },
      { index: '10', equip: 'Измерительный прибор Openbox SF-120.', count: '1 комплект' },
      { index: '11', equip: 'Анализатор спектра ROHDE&SCHWARZ со следящим генератором ETL.', count: '1 комплект' },
      { index: '12', equip: 'Приемник тестовый портативный телевизионных сигналов Enensys ReFeree T2 R&S EFL 340.', count: '2 комплекта' },
      { index: '13', equip: 'Анализатор портативный транспортного потока Enensys DiviDual T2Mi.', count: '2 комплекта' },
      { index: '14', equip: 'Приемник измерительный стандарта DVB-T/Т2 тип Enensys ReFeree T2.', count: '2 комплекта' },
      { index: '15', equip: 'GPS/GLONASS антенна с кабелем.', count: '2 комплекта' },
      { index: '16', equip: 'Антенна широкодиапазонная.', count: '1 комплект' },
      { index: '17', equip: 'Антенна спутниковая. Диаметр 55 мм.', count: '1 комплект' },
      { index: '18', equip: 'Антенна спутниковая. Диаметр 55 мм. Мобильная.', count: '1 комплект' },
      { index: '19', equip: 'Антенна спутниковая. Диаметр 90 мм.', count: '1 комплект' },
      { index: '20', equip: 'Конвертор G1 124 GVADRO круговой поляризации 11,7-12,7 МHz.', count: '2 комплекта' },
      { index: '21', equip: 'Конвертор G1 211.', count: '1 комплект' },
      { index: '22', equip: 'Прибор SAT-Finder SF 9505', count: '1 комплект' },
      { index: '23', equip: 'Телевизионные карты Prof Read S2-7300', count: '8 комплектов' },
      { index: '24', equip: 'Телевизор 3D 47″ Fhilips.', count: '2 комплекта' }
    ]

    const labEquipColumns = [
      { name: 'index', field: 'index', label: '№ п/п', align: 'center' },
      { name: 'equip', field: 'equip', label: 'Наименование оборудования', align: 'left' },
      { name: 'count', field: 'count', label: 'Количество', align: 'center' },
    ]

    return {
      labColumns,
      labRows,
      labEquipColumns,
      labEquipRows
    }
  }
}
</script>

<style scoped>

</style>
