<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-grey-10 text-h3">Лаборатория Цифровых систем коммутации и сетей связи</span>
      </div>
      <div class="col-12 q-col-gutter-sm row">
        <div class="col-12 col-md-10">
          <q-card>
            <q-card-section>
              Лаборатория обеспечивает проведение теоретических и практических занятий по дисциплинам:

              <ul>
                <li>Сети связи;</li>
                <li>Мультисервисные сети связи;</li>
                <li>Теория телетрафика;</li>
                <li>Системы коммутации;</li>
                <li>Сети связи и системы коммутации;</li>
                <li>Сети и системы связи с подвижными объектами;</li>
                <li>Системы IP телефонии;</li>
                <li>Системы коммутации на ГТС и СТС;</li>
                <li>Современные офисные ИКС;</li>
                <li>Сети связи следующего поколения;</li>
                <li>Сети электросвязи и методы их защиты;</li>
                <li>Системы коммутации на стационарных и подвижных сетях связи.</li>
              </ul>
            </q-card-section>
            <q-card-section>
              На базе лаборатории, оснащенной современным оборудованием связи, студенты выполняют более 40 лабораторных и практических работ, 70% которых проводят с применением ПК. К ним относятся такие, как:
              <ul>
                <li>Изучение цифровой АТС «Протон-ССС» серии «Алмаз»;</li>
                <li>Изучение цифровой станции Alcatel S-12;</li>
                <li>Изучение современных телефонных аппаратов;</li>
                <li>Построение городской мультисервисной сети на принципах NGN;</li>
                <li>Моделирование сетей связи с помощью программы «GPSS World»;</li>
                <li>Проектирование городской телефонной сети с помощью программы «Сеть 1.6»;</li>
                <li>Изучение подсистемы ISUP стека протоколов сигнализации ОКС7;</li>
                <li>Изучение сигнализации SIP для сетей связи следующего поколения NGN;</li>
                <li>Конфигурирование офисных систем Open Scape Office и HiPath 3800 Unify Communications.</li>
              </ul>
            </q-card-section>
          </q-card>
        </div>
        <div class="col-12 col-md-2">
          <q-img
            src="http://www.skf-mtusi.ru/images/sved/mto/lab/Lukin.jpg"
          ></q-img>
        </div>
      </div>
      <div class="col-12">
        <q-card>
          <q-card-section>
            Выполнение лабораторных работ в виртуальном варианте, позволяет детально изучить и рассмотреть отдельные фрагменты построения и функционирования систем связи различного назначения, исследовать влияние на качество передачи информации по сети изменений нагрузки и конфигурации, изучить современные способы и методы обеспечения качества обслуживания.
          </q-card-section>
          <q-card-section>
            В настоящее время лабораторные работы проводятся по самым современным тематикам и проблемам развития связи и коммутационной инфраструктуры. Это обеспечивается рабочими местами, оборудованными стендами и установками, отвечающими современным требованиям и тенденциям развития связи.
          </q-card-section>
          <q-card-section>
            Интерактивный класс «СОТСБИ-У» позволяет изучать теоретический материал по подсистеме ISUP стека протоколов сигнализации ОКС7 и учебный материал по протоколу сигнализации SIP для сетей связи следующего поколения NGN, а также проводить лабораторные работы.
          </q-card-section>
          <q-card-section>
            Программно-аппаратный комплекс «Инфокоммуникационные сети», позволяет привить студентам навыки конфигурирования современных устройств, применяемых в IP — сетях.
          </q-card-section>
          <q-card-section>
            С первых дней образования филиала, лаборатории уделялось и уделяется самое пристальное внимание с точки зрения технического оснащения и методического обеспечения. Это, пожалуй, одна из первых лабораторий, которая и по сей день пополняется техническими средствами и стендами, разработанными и созданными самими студентами.
          </q-card-section>
          <q-card-section>
            Лабораторные стенды, как результат дипломного проектирования, неоднократно экспонировались на выставках средств и систем связи. Это такие стенды как:
            <ul>
              <li>Устройство и алгоритм работы цифровой системы коммутации SI-2000;</li>
              <li>Устройство и алгоритм работы цифровой системы коммутации EWSD;</li>
              <li> Устройство и алгоритм работы цифровой системы коммутации Alcatel S-12;</li>
              <li>Устройство и алгоритм работы сотовой сети связи стандарта GSM.</li>
            </ul>
          </q-card-section>
          <q-card-section>
            Сегодня ведутся работы по внедрению в учебный процесс лабораторных работ по:
            <ul>
              <li>виртуальному контролю состояния оборудования сетей связи, оперативному изменению и фиксации их параметров;</li>
              <li>контролю состояния базовых станций на сетях подвижной связи.</li>
            </ul>
            <p>
              Фундамент по созданию лабораторной базы кафедры СССК, заложенный более 40 лет назад, «обрастает» довольно быстро, прочно и современно. Такова парадигма действий руководства филиала и кафедры в условиях бурного развития средств современной связи.
            </p>
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 row q-col-gutter-sm justify-center">
        <div class="col-md-3 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/6_1.jpg"
          ></q-img>
        </div>
        <div class="col-md-3 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/6_2.jpg"
          ></q-img>
        </div>
        <div class="col-md-3 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/6_3.jpg"
          ></q-img>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labSCS"
}
</script>

<style scoped>

</style>
