<template>
  <q-page padding>
    <div class="row q-col-gutter-sm">
      <div class="col-12 q-mb-md">
        <span class="text-grey-10 text-h3">Лаборатория Теории электрической связи, метрологии и электроники</span>
      </div>
      <div class="col-12 text-subtitle1">
        <q-card>
          <q-card-section>
            Лаборатория обеспечивает учебный процесс по курсам: «Общая теория связи», «Физические основы электроники», «Электроника», «Схемотехника телекоммуникационных устройств», «Цифровая обработка сигналов» и ряду других дисциплин.
          </q-card-section>
          <q-card-section>
            Учебно-лабораторное оборудование позволяет проводить около 40 лабораторных работ. Из них более половины выполняются с использованием персональных компьютеров. Компьютеры включены в локальную сеть филиала и имеют выход в сеть Internet.
          </q-card-section>
          <q-card-section>
            Лаборатория оснащена современным оборудованием. За последние годы были приобретены:
            <ul>
              <li>Лабораторные стенды по теории электрической связи (ТЭС) с пятью сменными блоками (3 шт.);</li>
              <li>Лабораторные стенды по микроэлектронике(4 шт.);</li>
              <li>Ноутбуки (2шт.), проекторы (2 шт.), интерактивная доска;</li>
              <li>Осциллографы (8шт.), генераторы (10 шт.), измерительные приборы (8 шт.).</li>
            </ul>
          </q-card-section>
          <q-card-section>
            В настоящее время лаборатория уделяет большое внимание перспективе развития новых направлений в учебном процессе. В перспективном плане намечена программа переоснащения лаборатории новыми компьютерами, с необходимым программным обеспечением, позволяющим проводить лабораторные и практические занятия по специальности – «Вычислительные машины, комплексы, системы и сети».
          </q-card-section>
          <q-card-section>
            С точки зрения методического сопровождения изучаемых дисциплин планируется разработка технологии параллельного проведения исследований физических процессов на лабораторном оборудовании и моделирования их на компьютерах.
          </q-card-section>
        </q-card>
      </div>
      <div class="col-12 row q-col-gutter-sm justify-center">
        <div class="col-md-3 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/4_1.jpg"
            height="auto"
          ></q-img>
        </div>
        <div class="col-md-3 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/4_2.jpg"
            height="auto"
          ></q-img>
        </div>
        <div class="col-md-3 col-12">
          <q-img
            src="http://www.skf-mtusi.ru/fileadmin/page_res/struct/labs/4_3.jpg"
            height="auto"
          ></q-img>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: "labTAC"
}
</script>

<style scoped>

</style>
