<template>
  <q-page padding>
    <div class="row">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Локальная сетевая академия Cisco</span>
      </div>
      <div class="row">
        <div class="col-12 col-md-9 q-mt-xl">
          <p class="text-h6 text-grey-9">
            На базе Северо-Кавказского филиала Московского технического университета связи и информатики создана и успешно работает Локальная Сетевая Академия Cisco «MTUCI — North Caucasian Branch»<br><br>
            Компания Cisco Systems, выражая свою заинтересованность в продвижении современных знаний и представлений во всех областях, связанных с сетевыми, Интернет- и телекоммуникациоными технолгиями, основала Cisco Networking Academy Program (CNAP).<br><br>
            Десять лет на базе нашего университета успешно функционирует Локальная Сетевая Академия Cisco «MTUCI- North Caucasian Branch». С этой замечательно датой нас поздравил вице-президент компании Cisco по корпоративному развитию Харбриндер Кэнг (Harbrinder Kang).<br><br>
          </p>
        </div>
        <div class="col-md-2 col-12 q-ml-xl">
          <q-img
            width="200px" src="/images/cisko1.gif"
          ></q-img>
        </div>
      </div>
      <div class="row">
        <div class="col-12 col-md-10 q-my-xl">
          <span class="text-h4 text-grey-9 q-my-md">
            Целями данной программы являются:<br>
          </span>
          <div class="text-h6 text-grey-9 q-my-md">
            <span class="text-h4 text-primary">01.</span>&nbsp;Подготовка высококвалифицированных специалистов в области телекоммуникаций через образовательные учреждения всего мира;<br><br>
            <span class="text-h4 text-primary">02.</span>&nbsp;Продвижение всеобъемлющих академических образовательных программ, позволяющих слушателям усваивать не только практические навыки в области эксплуатации того или иного конкретного оборудования, но и создавать у них целостное представление о всей проблематике данного сегмента современных информ;<br><br>
            <span class="text-h4 text-primary">03.</span>&nbsp;Создание сети академий, проводящих обучение на беcприбыльной (компенсационной) основе, что способствует повышению доступности авторизованного обучения технологиям Cisco для слушателей.<br><br>
          </div>
        </div>
      </div>
      <div class="row">
          <div class="col-12">
            <p class="text-h6 text-grey-9">
              Уже сегодня по программе Cisco Networking Academy Program (CNAP) готовятся слушатели, уровень подготовки которых вписывается в промышленный стандарт карьерной сертификации Cisco, позволяющий создать благоприятные возможности для трудоустройства и деловой деятельности на протяжении всей жизни.<br><br>
              Примерами такой сертификации могут служить Cisco Certified Networking Associate (CCNA), предлагаемая слушателям академий уже сегодня.<br><br>
              Все это – только краткое описание того мира и тех возможностей, которые открываются перед людьми, связавшими свою подготовку с технологиями будущего.<br><br>
              Данная программа обучения предназначена для подготовки специалистов в областях проектирования, создания и эксплуатации современных телекоммуникационных компьютерных сетей.<br><br>
              Особенностью данной программы является то, что, помимо навыков по работе с оборудованием Cisco, слушатели получают широкий спектр базовых знаний в области компьютерных сетей.<br><br>
              Объем знаний, получаемых при обучении, достаточен для сертификации на CCNA (Cisco Certified Network Associate) в центрах тестирования. После окончания курса слушатели получают сертификат установленного образца.<br><br>
              Объем курса: 4 семестра (280 часов). Объем каждого семестра – 70 часов. Программа обучения предполагает прослушивание всех 4-х семестров последовательно, но допускает прослушивание семестров по выбору в соответствии с расписанием курсов.<br><br>
            </p>
          </div>
          <div class="column items-center col-12 q-ml-xl">
            <q-img
              width="400px" src="/images/cisko2.jpg"
            ></q-img>
          </div>
      </div>
      <div class="row">
          <div class="col-12 col-md-9 q-mt-xl">
            <p class="text-h6 text-grey-9">
                Материалы подготовлены на основе аннотации Cisco Networking Academy Program (CNAP) компании Cisco Systems.<br><br>
                <span class="text-h4 text-grey-9">О преподавателях</span><br><br>
                В Локальной Сетевой Академии Cisco «MTUCI — North Caucasian Branch» работает опытный инструктор Бородин Алексей Викторович — признанный эксперт в своей области и талантливый педагог. Его опыт и знания подтверждены престижными международными сертификатами и профессиональными наградами. Учебные программы постоянно дополняются реальными практическими примерами, что делает каждый курс действительно актуальным. Вы получите прочные знания и практические навыки под руководством настоящего профессионала!<br><br>
                <span class="text-h4 text-grey-9">Комплектование групп:</span><br><br>
                Комплектование проводится по заявкам от предприятий и по индивидуальным заявлениям граждан желающих пройти выбранный курс обучения.<br><br>
                В группе по 4 — 5 человек.<br><br>
                <span class="text-h4 text-grey-9">Расписание:</span><br><br>
                Курсы проводятся каждый месяц.<br><br>
                Начало занятий: по мере комплектования групп.<br><br>
                Занятия проходят два-три раза в неделю (кроме воскресенья) по 4 академических часа.<br><br>
                Вечерние группы с 17.45 до 20.45 ч.<br><br>
                <span class="text-h4 text-grey-9">По вопросам обучения обращаться:</span><br><br>
                г. Ростов-на-Дону, ул. Серафимовича 62, 2 этаж, ком. 215.<br><br>
                Методист: Романова Наталья Григорьевна.<br><br>
                Тел: (863) 310-69-67, факс: (863) 310-69-68.<br><br>
                Email: kurs@skf-mtusi.ru<br><br>
            </p>
          </div>
      </div>
    </div>
  </q-page>
</template>
