<template>
  <q-page padding>
    <div class="row" :class="!$q.screen.lt.md ? 'q-mx-xl' : ''">
      <div class="col-12 q-my-xl">
        <span class="text-grey-10 text-h3">Документы</span>
      </div>
      <div class="col-12 q-mt-md">
        <ul>
          <li
            v-for="(doc, i) in docs"
            :key="i"
            class="q-my-md text-primary"
          >{{doc.name}}</li>
        </ul>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  name: 'Documents',
  setup() {
    const docs = [
      { name: 'Устав МТУСИ', dId: '' },
      { name: 'Лицензия на осуществление образовательной деятельности', dId: '' },
      { name: 'Свидетельство о государственной аккредитации', dId: '' },
      { name: 'Приложение №1 к свидетельству о государственной аккредитации', dId: '' },
      { name: 'Приложение №2 к свидетельству о государственной аккредитаци', dId: '' },
      { name: 'План финансово-хозяйственной деятельности', dId: '' },
      { name: 'Правила приема в Северо-Кавказский филиал ордена Трудового Красного Знамени федерального государственного бюджетного образовательного учреждения высшего образования «Московский технический университет связи и информатики» (СКФ МТУСИ)', dId: '' },
      { name: 'Положение о режиме занятий обучающихся', dId: '' },
      { name: 'Положение О порядке осуществления образовательной деятельности по индивидуальным учебным планам, в том числе ускоренного обучения', dId: '' },
      { name: 'Положение о практической подготовке обучающихся в СКФ МТУСИ', dId: '' },
      { name: 'Положение об условиях и порядке зачисления экстернов в СКФ МТУСИ', dId: '' },
      { name: 'План финансово-хозяйственной деятельности', dId: '' },
      { name: 'Положение об обучении лиц с ограниченными возможностями здоровья', dId: '' },
      { name: 'Положение о текущем контроле успеваемости и промежуточной аттестации студентов очного факультета с использованием модульно-рейтинговой системы организации учебного процесса', dId: '' },
      { name: 'Положение О текущем контроле успеваемости и промежуточной аттестации студентов очной формы обучения с использованием модульно-рейтинговой системы организации учебного процесса (2019 год)', dId: '' },
      { name: 'Положение о текущем контроле и промежуточной аттестации студентов заочной формы обучения', dId: '' },
      { name: 'Положение о переводе, восстановлении и отчислении обучающихся', dId: '' },
      { name: 'Положение о переводе студентов СКФ МТУСИ с платного обучения на бесплатное', dId: '' },
      { name: 'Положение о порядке оформления возникновения, приостановления и прекращения отношений между СКФ МТУСИ и обучающимися и (или) родителями (законными представителями) несовершеннолетних обучающихся', dId: '' },
      { name: 'Правила внутреннего распорядка обучающихся', dId: '' },
      { name: 'Правила внутреннего трудового распорядка для сотрудников и преподавателей', dId: '' },
      { name: 'Коллективный договор СКФ МТУСИ', dId: '' },
      { name: 'Дополнительное соглашение №1 Коллективному договору СКФ МТУСИ', dId: '' },
      { name: 'Отчет о результатах самообследования 2020 г.', dId: '' },
      { name: 'Об утверждении стоимости платных образовательных услуг ордена Трудового Красного Знамени федерального государственного бюджетного образовательного учреждение высшего образования «Московский технический университет связи и информатики» (МТУСИ) по образовательным программам высшего и среднего профессионального образования – программам бакалавриата, специалитета, магистратуры, аспирантуры очной и заочной форм обучения на 2021-2022 учебный год', dId: '' },
      { name: 'Положение об установлении оснований и порядка снижения стоимости платных образовательных услуг', dId: '' },
      { name: 'Положение о СКФ МТУСИ', dId: '' },
      { name: 'Положение об Ученом совете СКФ МТУСИ', dId: '' },
      { name: 'Приказ о мерах по предупреждению распространения коронавирусной инфекции', dId: '' },
      { name: 'Меры по профилактике распространения коронавирусной инфекции среди работников и студентов', dId: '' },
      { name: 'Приказ по студенческому составу факультета инфокоммуникаций о мерах по противодействия распространения коронавирусной инфекции №1', dId: '' },
      { name: 'Приказ по студенческому составу факультета инфокоммуникаций о мерах по противодействия распространения коронавирусной инфекции №2', dId: '' },
      { name: 'Распоряжение о порядке взаимодействия профессорско-преподавательского состава и студентов СКФ МТУСИ в период распространения коронавирусной инфекции на территории РФ путем перехода на дистанционные методы обучения', dId: '' },
      { name: 'Приказ о мерах по реализации СКФ МТУСИ Указа Президента Российской Федерации от 02 апреля 2020 года № 239 «О мерах по обеспечению санитарно-эпидемиологического благополучия населения на территории Российской Федерации в связи с распространением новой коронавирусной инфекции (COVID-19)»»', dId: '' },
      { name: 'Положение «О реализации образовательных программ с применением электронного обучения и дистанционных образовательных технологий в условиях распространения коронавирусной инфекции на территории Российской Федерации»', dId: '' },
      { name: 'Положение об организации оформления, выдачи и использования разрешений для следования к месту (от места) осуществления деятельности (в том числе работы) на территории муниципального образования «Город Ростов-на-Дону» в СКФ МТУСИ', dId: '' },
      { name: 'Приказ о продлении нерабочих дней с сохранением заработной платы и продлении работы в дистанционном режиме', dId: '' },
      { name: 'Положение «О проведении всех видов практик в условиях применения электронного обучения и дистанционных образовательных технологий в условиях распространения коронавирусной инфекции на территории Российской Федерации»', dId: '' },
      { name: 'Положение о рабочих программах дисциплин, практик', dId: '' },
      { name: 'Положение о расписании учебных занятий СКФ МТУСИ', dId: '' },
      { name: 'Положение о порядке усвоения учебных курсов, дисциплин, модулей, не входящих в осваиваемую образовательную программу', dId: '' },
      { name: 'Положение о воспитательной работе со студентами', dId: '' },
      { name: 'Положение об аттестационных комиссиях и порядке аттестации дисциплин, практик и учебных планов', dId: '' },
      { name: 'Положение о контроле образовательной деятельности в СКФ МТУСИ ', dId: '' },
      { name: 'Положение о контрольных и курсовых работах (проектах)', dId: '' },
      { name: 'Положение о выпускных квалификационных работах бакалавра', dId: '' },
      { name: 'Положение о государственной итоговой аттестации (ГИА)', dId: '' },
      { name: 'Временное положение «О проведении государственной итоговой аттестации по образовательным программам бакалавриата с применением электронного обучения и дистанционных образовательных технологий в условиях распространения коронавирусной инфекции на территории Российской Федерации»', dId: '' },
      { name: 'Положение об основной профессиональной образовательной программе высшего образования (ОПОП ВО)', dId: '' },
      { name: 'Положение об электронной информационно-образовательной среде СКФ МТУСИ', dId: '' },
      { name: 'Положение об организации занятий по физической культуре', dId: '' },
      { name: 'Инструкция по оформлению учебной документации, отражающей выполнение студентом образовательной программы в СКФ МТУСИ', dId: '' },
      { name: 'Положение о контактной работе в СКФ МТУСИ', dId: '' },
      { name: 'Положение о порядке выбора и организации освоения дисциплин по выбору обучающихся, факультативных и элективных дисциплин', dId: '' },
      { name: 'Положение «О порядке и основаниях предоставления академического отпуска обучающимся»', dId: '' },
      { name: 'Положение о студенческом совете', dId: '' },
      { name: 'Положение о кураторе студенческой группы', dId: '' },
      { name: '///', dId: '' },
    ]

    return {
      docs
    }
  }
}
</script>