<template>
  <q-page padding>
    <div class="row" :class="!$q.screen.lt.md ? 'q-mx-xl' : ''">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Материально-техническое обеспечение и оснащенность образовательного процесса</span>
      </div>
      <div class="col-12 q-my-xl">
        <q-table
          title="Сведения о наличии оборудованных учебных кабинетов"
          :rows="edEquipRow"
          :columns="edEquipKey"
          row-key="name"
          wrap-cells
        >
          <template v-slot:body="props">
            <q-tr :props="props">
              <q-td key="name" :props="props">
                {{props.row.name}}
              </q-td>
              <q-td key="address" :props="props">
                {{props.row.address}}
              </q-td>
              <q-td key="cabinet" :props="props">
                {{props.row.cabinet}}
              </q-td>
              <q-td key="equipment" :props="props">
                <ul>
                  <li v-for="e in props.row.equipment" :key="e">{{e}}</li>
                </ul>
              </q-td>
            </q-tr>
          </template>
        </q-table>
      </div>
      <div class="col-12 q-my-xl">
        <q-table
          title="Сведения о наличии объектов для проведения практических занятий."
          :rows="objEquipRow"
          :columns="objEquipKey"
          row-key="name"
          wrap-cells
        >
          <template v-slot:body="props">
            <q-tr :props="props">
              <q-td key="name" :props="props">
                {{props.row.name}}
              </q-td>
              <q-td key="adress" :props="props">
                {{props.row.adress}}
              </q-td>
              <q-td key="objects" :props="props">
                {{props.row.objects}}
              </q-td>
              <q-td key="equipment" :props="props">
                <ul>
                  <li v-for="e in props.row.equipment" :key="e">{{e}}</li>
                </ul>
              </q-td>
            </q-tr>
          </template>
        </q-table>
      </div>
    </div>
  </q-page>
</template>

<script>

const edEquipKey = [
  { name: 'address', label: 'Адрес', field: 'address', align: 'left' },
  { name: 'cabinet', label: 'Наименование оборудованных учебных кабинетов', field: 'cabinet', align: 'left'},
  { name: 'equipment', label: 'Оснащенность оборудованных учебных кабинетов', field: 'equipment', align: 'left' }
]

const edEquipRow = [
  { 
    address: 'г. Ростов-на-Дону, ул.Серафимовича, д.62, кафедра ИТСС', 
    cabinet:'Кабинет для защиты ВКР (307)', 
    equipment: [
      'Ноутбук – 8 шт.', 
      'Проектор – 1 шт.', 
      'Телевизор – 1 шт.'
      ]
  },
  {
    address: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, библиотека',
    cabinet: '  Кабинет самоподготовки (202)',
    equipment: ['Персональные компьютеры с выходом в сеть интернет – 16 шт.']
  },
  {
    address: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ОНП',
    cabinet: 'Лингафонный кабинет (101А)',
    equipment: [
      'Индивидуальные рабочие места, оснащенные телефонно-микрофонной гарнитурой — 17 шт.',
      'Пульт преподавателя – 1 шт.',
      'Компьютер – 1 шт.'
      ]
  }
]

const objEquipKey = [
  {name: 'adress', label: 'Адрес', field: 'adress', align: 'left'},
  {name: 'objects', label: 'Наименование объектов для проведения практических занятий', field: 'objects', align: 'left'},
  {name: 'equipment', label: 'Оснащенность объектов для проведения практических занятий', field: 'equipment', align: 'left'}
]

const objEquipRow = [
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ОНП',
    objects: 'Лаборатория Общей физики и БЖД',
    equipment: [
      'Интерактивная-доска.',
      'Модульный учебный комплекс МУК-01 – 4 шт.',
      'МУК-02 – 4 шт.',
      'МУК-ЭМ2 – 1 шт.',
      'ФПЭ, ФПВ-03 – 1 шт.',
      'ФПВ-04 – 1 шт.',
      'МУК-ОВ – 1 шт.',
      'МУК-ОК – 1 шт.',
      'Тренажер «Максим» — 1 шт.',
      'Генератор СВЧ сигнала ГЧ-109 – 1 шт.',
      'Измерительная волноводная линия Р-28 – 1 шт.',
      'Прибор Р2-54/4 – 1 шт.',
      'Персональные компьютеры с выходом в сеть интернет – 16 шт.',
      'ПО: Сафронов В.П., Конкин Б.Б. «Курс физики». Интерактивная контрольно-обучающая программа. Конкин Б.Б., Сафронов В.П. Интерактивные тесты по курсу физики.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ОНП',
    objects: 'Лаборатория Современных методов управления (101)',
    equipment: [
      'Интерактивная-доска Smart — 2 шт.',
      'Персональные компьютеры с выходом в сеть интернет – 19 шт.',
      'Ноутбук -2 шт.',
      'Проектор BENQ -2 шт.',
      'Коммутатор D-Link DGS-1016D/1024D 16/24-PORT GIGABIT DESKTOP SWITCH — 1 комплект.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Основ теории цепей и линий связи (312, 313)',
    equipment: [
      'Учебная установка по курсу: «Электропитание устройств и систем связи» (4 стенда).',
      'Универсальная установка по исследованию характеристик оптических волоконных световодов.',
      'Стенд для исследования пассивных элементов световодных трактов.',
      'Установка по курсу «Теория электрических цепей».',
      'Оптический рефлектометр типа YOKOGAWA.',
      'Цифровые фазометры.',
      'Излучатели и измерители оптической мощности типа PHOTOM.',
      'Кабельный прибор типа ИРК-ПРО.',
      'Пассивные элементы волоконно-оптических сетей (оптические муфты, оптические кроссы и др.).',
      'Персональные компьютеры с выходом в сеть интернет – 24 шт.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Систем радиосвязи и телевещания (216)',
    equipment: [
      'Учебная установка «Устройства генерирования и формирования сигналов», 2 комплекта.',
      'Учебная установка «Радиоприемные устройства», 2 комплекта.',
      'Учебная телевизионная установка УТС-97, 1 комплект.',
      'Учебная телевизионная установка УТС-2007, 1 комплект.',
      'Учебная телевизионная стойка 2010, 1 комплект.',
      'Лабораторный модуль «Исследование автогенераторов и умножителей частоты», 1 комплект.',
      'Лабораторный модуль «Исследование генератора с внешним возбуждением», 1 комплект.',
      'Лабораторный модуль «Исследование входных цепей радиоприемных устройств, 1 комплект.',
      'Ресивер/декодер профессиональный LCT DSR-1800. 1 комплект.',
      'Цифровой декодер DCH-3100 P-20S2. 1 комплект.',
      'Модулятор цифрового ТВ сигнала стандарта DVB-T/T2 ТВЦ 0,01 (РТ И РС)-формирователь DVB-T/H «Modulator DVB-TH» ДМВ диапазона. 2 комплекта.',
      'Блок системы дистанционного контроля «СДК 5v3»? 1 комплект.',
      'Мультиплексор WPX-0401. 1 комплект.',
      'Анализатор TS потоков AT4USB. 1 комплект.',
      'Анализатор TS потоков АТ78USB. 1 комплект.',
      'Формирователь/анализатор DVB потока (модуль формирования транспортного потока Dektek DTU-245 USB-2 ASI/SDI In+Out Adapter. 1 комплект.',
      'Коммутатор D-Link DGS-1016D/1024D 16/24-PORT GIGABIT DESKTOP SWITCH. 2 комплекта.',
      'Измерительный прибор Openbox SF-120. 1 комплект.',
      'GPS/GLONASS антенна с кабелем. 2 комплекта.',
      'Антенна широкодиапазонная. 1 комплект.',
      'Антенна спутниковая. Диаметр 55 мм. 1 комплект.',
      'Антенна спутниковая. Диаметр 55 мм. Мобильная. 1 комплект.',
      'Антенна спутниковая. Диаметр 90 мм. 1 комплект.',
      'Конвертор G1 124 GVADRO круговой поляризации 11,7-12,7 МHz. 2 комплекта.',
      'Конвертор G1 211. 1 комплект.',
      'Прибор SAT-Finder SF 9505 1 комплект.',
      'Телевизионные карты Prof Read S2-7300 8 комплектов.',
      'Телевизор 3D 47″ Fhilips. 2 комплекта.',
      'Персональные компьютеры с выходом в сеть интернет – 14 шт.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Многоканальных телекоммуникационных систем',
    equipment: [
      'Атмосферно-оптическая линия связи «МОСТ».',
      'Оптический мультиплексор цифровых потоков ввода-вывода «МЦП-155К».',
      'Мультиплексор каналов с гибким конфигурированием «МК-2048/ГК».',
      'Лабораторные установки «Линейный тракт цифровой системы передачи», аппаратно-программный комплекс для изучения стандартных процедур и мониторинга сетей «Wi-Fi».',
      'Интегрированная система мониторинга и управления сетью (ИСМУС);',
      'Анализатор параметров цифровых трактов.',
      'Персональные компьютеры с выходом в сеть интернет – 17 шт.',
      'ИКМ-480.',
      'ИКМ-15.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Цифровых систем коммутации и сетей связи',
    equipment: [
      'Интерактивный класс «СОТСБИ-У».',
      'Лабораторные стенды: - Устройство и алгоритм работы цифровой системы коммутации SI-2000; - Устройство и алгоритм работы цифровой системы коммутации EWSD; - Устройство и алгоритм работы цифровой системы коммутации Alcatel S-12; - Устройство и алгоритм работы сотовой сети связи стандарта GSM. - Устройстов Open Scape Office MX/LX - Устройство HiPath 3800 Unify Communications',
      'Персональные компьютеры с выходом в сеть интернет – 13 шт.',
      'ПО - GPSS World.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИТСС',
    objects: 'Лаборатория Передачи дискретных сообщений и документальной электросвязи (214)',
    equipment: [
      'Многофункциональная система обработки и передачи информации REX-400.',
      'Телеграфный терминал на базе ПЭВМ с модемом «Альфа-Телекс».',
      'Телеграфный аппарат F-2000;',
      'Телеграфный аппарат F-2500;',
      'Персональные компьютеры с выходом в сеть интернет – 16 шт.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИВТ',
    objects: 'Лаборатория Вычислительной техники и информатики (218)',
    equipment: [
      'Персональные компьютеры с выходом в сеть Интернет – 19 шт.',
      'проектор, интерактивная доска;',
      'комплект оборудования Cisco;',
      'AVR-studio – программное обеспечение микроконтроллеров;',
      'Proteus — программное обеспечение для моделирования аналоговых и цифровых схем и процессов;',
      'Вариант — программное обеспечение для моделирования цифровых схем;',
      'ArduinoIDE — программное обеспечение для моделирования робототехнических комплексов;',
      'Виртуальная ЭВМ;',
      'Lazarus – программное обеспечение для решения задач вычислительной математики и компьютерной графики;',
      'GIMP — программное обеспечение для компьютерной графики;',
      'AutoDesk Inventor — программное обеспечение для компьютерной графики;',
      'Oracle-VM virtual box – программное обеспечение для работы с операционными системами;',
      'MicrosoftVisio — программное обеспечение для компьютерной графики;',
      'RamusEducational – программное обеспечение для проектирования сложных систем;',
      'MicrosoftAсcess — программное обеспечение для моделирования и компьютерной графики;',
      'VisualStudio2017 (C#,C++) — программное обеспечение для моделирования и компьютерной графики;',
      'Sсratch — программное обеспечение для моделирования и анализа языков программирования.'
      ]
  },
  {
    adress: 'г. Ростов-на-Дону, ул. Серафимовича, д.62, кафедра ИВТ',
    objects: 'Лаборатория Теории электрической связи, метрологии и электроники (310)',
    equipment: [
      'Лабораторные стенды по теории электрической связи с пятью сменными блоками (3 шт.);',
      'Лабораторные стенды по микроэлектронике(4 шт.);',
      'Ноутбуки (2шт.), проекторы (2 шт.);',
      'Осциллографы (8шт.), генераторы (10 шт.), измерительные приборы (8 шт.);',
      'AVR-studio – программное обеспечение микроконтроллеров;',
      'Proteus — программное обеспечение для моделирования аналоговых и цифровых схем и процессов;',
      'Вариант — программное обеспечение для моделирования цифровых схем.',
      'Персональные компьютеры с выходом в сеть Интернет – 12 шт.'
      ]
  }
]

export default ({
  setup() {
    return {
      edEquipKey,
      edEquipRow,
      objEquipKey,
      objEquipRow
    }
  },
})
</script>
