<template>
  <q-page padding>
    <div class="row">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Подготовительные курсы</span>
      </div>
      <div class="row">
        <div class="col-12 col-md-9 q-mt-xl">
          <p class="text-h6 text-grey-9">
            Основная цель подготовительных курсов — помочь абитуриентам успешно подготовиться к вступительным экзаменам, систематизировать знания по предметам, а также подготовиться к школьным выпускным экзаменам в форме ЕГЭ.
            На подготовительные курсы нашего университета приглашаются учащиеся старших классов общеобразовательные школ, колледжей и лицеев, а также выпускники прошлых лет, имеющие среднее общее и профессиональное образование.
            Занятия проводятся по дисциплинам, вынесенным на вступительные экзамены по математике, физике, русскому языку и обществознанию.
          </p>
        </div>
      </div>
      <div class="row">
        <div class="col-12 col-md-10 q-my-xl">
          <span class="text-h4 text-grey-9 q-my-xl">
            Формы подготовки:<br>
          </span>
          <div class="text-h6 text-grey-9 q-my-lg">
            <span class="text-h4 text-primary">01.&nbsp;Вечерние подготовительные курсы</span><br><br>
            <div class="text-h6 text-grey-9 q-mb-md q-mx-md">
              Основная цель подготовительных курсов — помочь абитуриентам успешно подготовиться к вступительным экзаменам, систематизировать знания по предметам, а также подготовиться к школьным выпускным экзаменам в форме ЕГЭ.
              На подготовительные курсы нашего университета приглашаются учащиеся старших классов общеобразовательные школ, колледжей и лицеев, а также выпускники прошлых лет, имеющие среднее общее и профессиональное образование.
              Занятия проводятся по дисциплинам, вынесенным на вступительные экзамены по математике, физике, русскому языку и обществознанию.
            </div>
            <span class="text-h4 text-primary">02.&nbsp;Заочные подготовительные курсы</span><br><br>
            <div class="text-h6 text-grey-9 q-mb-md q-mx-md">
              Прием заявлений начинается с 1 октября. Слушатели подготовительных курсов отправляют по почте заявление в свободной форме и квитанцию об оплате. По факту оплаты заключается договор. Мы высылаем методические указания и контрольные задания. Слушатели самостоятельно выполняют заданные контрольные работы и отправляют в университет. Мы рецензируем выполненные вами контрольные работы и высылаем их обратно.
              Заочные подготовительные курсы готовят к поступлению, как на заочную, так и на дневную формы обучения.
            </div>
            <span class="text-h4 text-primary">03.&nbsp;Десятидневные подготовительные курсы</span><br><br>
            <div class="text-h6 text-grey-9 q-mb-md q-mx-md">
              Начинают свою работу накануне вступительных испытаний, как правило, в июле месяце. При поступлении на курсы слушатели заполняют заявление о приеме на курсы и представляют квитанцию об оплате. По факту оплаты заключается договор, для чего необходимо иметь при себе: оплаченную квитанцию, паспорт абитуриента( для несовершеннолетних паспорт одного из родителей, с которым будет заключаться договор).
              Начало занятий по мере комплектования групп.
            </div>
          </div>
        </div>
      </div>
      <div class="row">
        <div class="col-12 col-md-9 q-mt-xl">
          <p class="text-h6 text-grey-9">
            Все слушатели подготовительных курсов обеспечиваются учебно-методическими пособиями, разработанными преподавателями СКФ МТУСИ.
          </p>
        </div>
      </div>
      <div class="row">
        <div class="col-12 col-md-9 q-my-xl">
          <span class="text-h4 text-grey-9 q-my-xl">Наши подготовительные курсы дадут вам:</span>
          <p class="text-h6 text-grey-9 q-my-md">
            — возможность успешно подготовиться к вступительным экзаменам;<br><br>
            — систематизировать знания по предметам;<br><br>
            — подготовиться к школьным выпускным экзаменам<br><br>
            — получить представление о требованиях на вступительных экзаменах, особенностях обучения в университете.
          </p>
        </div>
      </div>
    </div>
    </q-page>
  </template>
