<template>
  <q-page padding>
    <div class="row" :class="!$q.screen.lt.md ? 'q-mx-xl' : ''">
      <div class="col-12">
        <span class="text-h3 text-grey-10">Курсы повышения квалификации</span>
      </div>
      <div class="row">
          <div class="col-12 col-md-10 q-mt-xl">
            <p class="text-h6 text-grey-9">
              Сектор учебно-методической работы (СУМР) при Институте повышения квалификации Московского технического университета связи и информатики (Северо-Кавказский филиал) осуществляет свою деятельность в соответствии с лицензией № 2103 от 21.04.2016 года, дающей право на ведение образовательной деятельности по соответствующим направлениям и специальностям подготовки и выдавать слушателям удостоверения установленного образца. СУМР проводит занятия совместно с ИПК МТУСИ.<br><br>
              В условиях вхождения России в мировое телекоммуникационное сообщество, реализации крупных технических проектов в области международных телекоммуникаций и, в связи с этим, быстро растущим спросом на новые виды высококачественных услуг связи, многие предприятия испытывают сейчас некоторый дискомфорт при адаптации к новым экономическим условиям и новым требованиям к персоналу.<br><br>
              Лидирующие телекоммуникационные компании мира давно поняли, что в условиях рыночной конкуренции наиболее важным капиталом является их собственные служащие. Такие компании как «France Telekom», «British Telecom», «Bundes Post», «Deutsche Telecom» и др. имеют целую сеть учебных центров по всему миру, поскольку в условиях усиливающейся конкуренции между операторами связи, — компетентность и квалификация сотрудников становится решающим фактором успеха в работе.<br><br>
              Это означает, что успех в работе будет гарантирован только там, где за дело отвечает компетентный, сознательный персонал, имеющий представление о новых высокорентабельных услугах связи и новых технологиях в телекоммуникациях.<br><br>
              СУМР СКФ МТУСИ предлагает Вам подготовку кадров высшего и среднего звена по всем аспектам телекоммуникационных технологий, ориентированных на инфраструктуру связи Северо-Кавказского региона.<br><br>
              Обучение проводится с использованием современных методов и технологий обучения. Учебный процесс включает деловые и инновационные игры, а также психологические личностные тесты, которые повышают эффективность работы руководителей при выработке и принятии управленческих решений.<br><br>
              Выбирая обучение и переподготовку кадров у нас, Вы получаете целый ряд преимуществ:<br><br>
            </p>
          </div>
          <div class="col-md-6 col-12 q-mb-xl" v-for="(a, i) in adv" :key="i">
            <div class="row q-mb-xl">
              <div class="col-2"><span class="text-h4 text-primary">0{{i+1}}.&nbsp;</span></div>
              <div class="col-10"><span class="text-h4">{{a.title}}</span></div>
              <div class="col-10 offset-2">
                <ul v-for="(u, k) in a.list" :key="k">
                  <li>{{u}}</li>
                </ul>
              </div>
            </div>
          </div>
      </div>
      <div class="row">
        <div class="col-12 col-md-10 q-mt-xl">
          <p class="text-h6 text-grey-9">
            СКФ МТУСИ располагает широкими организационными и техническими возможностями для проведения занятий:
          </p>
          <ul>
            <li>класс дистанционного обучения с комплексом технических средств мультимедиа, позволяющий обеспечить доступ слушателей к широкому набору информационных и учебных ресурсов (как Российских, так и международных);</li>
            <li>компьютерный класс, позволяющий слушателям в короткий срок овладеть навыками работы с ПК, новейшими компьютерными технологиями;</li>
            <li>для проведения занятий используются самые современные технологии обучения: деловые игры, психологические практикумы, трейнинг общения и др.</li>
          </ul>
        </div>
      </div>
      <div class="row">
        <div class="col-12 col-md-10 q-mt-xl">
          <p class="text-h6 text-grey-9">
            СКФ МТУСИ имеет творческое сотрудничество с ведущими НИИ России в области связи и телекоммуникаций: Центральным НИИ связи и Институтом автоматизированных систем (г. Москва), НИИ радиосвязи и ВНИИ «Градиент» (г. Ростов-на-Дону). Эти ВУЗы и НИИ являются головными исполнителями и координаторами ряда государственных программ в области телекоммуникаций и автоматизированного обмена информацией. Все это позволяет нашим преподавателям всегда быть в курсе новейших достижений в области телеинформатики и телекоммуникаций. Кроме того, к обучению слушателей привлекаются ведущие специалисты Министерства РФ по связи и информатизации, учёные перечисленных НИИ, профессора Московских ВУЗов, специалисты предприятий связи Северо-Кавказского региона.<br><br>
            Мы поможем Вашим сотрудникам быстро и при разумных затратах стать высокопрофессиональными специалистами, что, в свою очередь, повысит рейтинг Вашего предприятия на рынке телекоммуникаций.<br><br>
            Сделайте свой выбор, а СКФ МТУСИ поможет Вам по всем ниже перечисленным аспектам телекоммуникационных технологий и менеджмента, сформированных в учебные блоки.<br><br>
            Принципиальным отличием учебных программ в СКФ МТУСИ является реализуемый на практике СИСТЕМНЫЙ ПОДХОД к образовательному процессу, в рамках которого учебные услуги предоставляются слушателям в комплексе с соответствующим практическим, нормативно — информационным и методическим обеспечением.<br><br>
          </p>
        </div>
      </div>
      <div class="row"> 
        <div class="col-12">
          <q-table
            title="Сведения о численности слушателей, обученных по дополнительным профессиональным программам 2020-2021г"
            :rows="studentsRow"
            :columns="studentsKey"
            row-key="name"
            wrap-cells
          ></q-table>
        </div>
      </div>
      <div class="col-12">
        <div class="row">
          <div class="col-4 q-pt-md">
            <q-card>
              <q-item>
                <q-item-avatar>
                  <q-avatar size="64px">
                    <q-icon name="mdi-pdf-box" color="red"></q-icon>
                  </q-avatar>
                </q-item-avatar>
                <q-item-section class="text-body1">
                  <q-item-label>Календарно-тематический план-график курсов повышения квалификации СКФ МТУСИ на 2021 год</q-item-label>
                </q-item-section>
              </q-item>
              <q-card-actions>
                <q-space></q-space>
                <q-btn flat type="a" color="primary" href="http://www.skf-mtusi.ru/files/info/platnye/plan_pk_2021.pdf" target="_blank">Читать</q-btn>
              </q-card-actions>
            </q-card>
          </div>
          <div class="col-4 q-pa-md">
            <q-card>
              <q-item>
                <q-item-avatar>
                  <q-avatar size="64px">
                    <q-icon name="mdi-pdf-box" color="red"></q-icon>
                  </q-avatar>
                </q-item-avatar>
                <q-item-section class="text-body1">
                  <q-item-label>Календарно-тематический план-график курсов повышения квалификации СКФ МТУСИ на 2022 год</q-item-label>
                </q-item-section>
              </q-item>
              <q-card-actions>
                <q-space></q-space>
                <q-btn flat type="a" color="primary" href="http://www.skf-mtusi.ru/files/info/platnye/plan_pk_2022.pdf" target="_blank">Читать</q-btn>
              </q-card-actions>
            </q-card>
          </div>
          <div class="col-4 q-pt-md">
            <q-card>
              <q-item>
                <q-item-avatar>
                  <q-avatar size="64px">
                    <q-icon name="mdi-file-document" color="blue"></q-icon>
                  </q-avatar>
                </q-item-avatar>
                <q-item-section class="text-body1">
                  <q-item-label>Бланк предварительной заявки</q-item-label>
                </q-item-section>
              </q-item>
              <q-card-actions>
                <q-space></q-space>
                <q-btn flat type="a" color="primary" href="http://www.skf-mtusi.ru/files/info/platnye/zayavka_2019.doc" target="_blank">Скачать</q-btn>
              </q-card-actions>
            </q-card>
          </div>
        </div>
        <div class="row">
          <div class="col-4 q-my-xl">
            <q-icon name="ion-open"></q-icon>
            <q-btn flat color="primary" type="a" to="/sveden/dpo">Программы по ДПО</q-btn>
          </div>
        </div>
      </div>
    </div>
  </q-page>
</template>

<script>
export default {
  setup() {
    const adv = [
      {title: "Экономия средств ", list: ["Вам нет необходимости посылать своих работников в дорогостоящие командировки в г. Москву, в г. С. Петербург или за рубеж."]},
      {title: "Стратегические преимущества", list: ["программы обучения позволяют подробно ознакомиться Вашему персоналу с новейшими направлениями развития систем и средств связи;", "курс сетевого планирования и управления поможет Вашим сотрудникам использовать Ваши системы связи с максимальной отдачей;","курс маркетинга и менеджмента позволит Вашим сотрудникам достичь максимальной эффективности в работе;","курсы по психологии облегчат Вашу работу по формированию коллектива и управлению им, разрешению конфликтных ситуаций и преодолению последствий вынужденной смены профессии и коллектива."]},
      {title: "Коммерческие выгоды", list: ["наличие квалифицированного персонала улучшает сервисное обслуживание и уменьшает потери, вызванные остановками и простоями систем связи;","хорошо обученный персонал позволяет уменьшить накладные расходы;","если персонал своевременно прошел переподготовку, повышение доходности Вашего предприятия связи гарантировано, т. к. наши учебные программы максимально соответствуют уровню телекоммуникационного развития Северо-Кавказского региона."]},
      {title: "Имидж предприятия", list: ["Ваши пользователи будут иметь лучшее мнение о Вашем предприятии, если системы связи обслуживаются хорошо обученным персоналом;","по окончании курсов слушателям выдаются «Удостоверения о повышении квалификации» Института повышения квалификации Московского технического университета связи и информатики. Эти документы способствуют созданию положительного имиджа Вашего предприятия."]}
    ]
    const studentsKey = [
        { name: 'named', label: 'Наименование', field: 'named', align: 'left' },
        { name: 'total', label: 'Всего слушателей, обученных по дополнительным профессиональным программам', field: 'total', align: 'left' },
        { name: 'confrontTotal', label: 'Слушателей очно (всего)', field: 'confrontTotal', align: 'left' },
        { name: 'confront', label: 'Слушателей очно (за счёт бюджетных ассигнований)', field: 'confront', align: 'left' },
        { name: 'confrontDistantTotal', label: 'Слушателей очно-заочно (всего)', field: 'confrontDistantTotal', align: 'left' },
        { name: 'confrontDistant', label: 'Слушателей очно-заочно (за счёт бюджетных ассигнований)', field: 'confrontDistant', align: 'left' },
        { name: 'distantTotal', label: 'Слушателей заочно (всего)', field: 'distantTotal', align: 'left' },
        { name: 'distant', label: 'Слушателей заочно (за счёт бюджетных ассигнований)', field: 'distant', align: 'left' }
      ]
      const studentsRow = [
        { named: 'Всего', total: '91', confrontTotal: '91', confront: '0', confrontDistantTotal: '0', confrontDistant: '0', distantTotal: '0', distant: '0'},
        { named: 'В том числе по программам: повышение квалификации', total: '91', confrontTotal: '91', confront: '0', confrontDistantTotal: '0', confrontDistant: '0', distantTotal: '0', distant: '0'},
        { named: 'В том числе в объёме: от 16 до 72 часов', total: '51', confrontTotal: '51', confront: '', confrontDistantTotal: '', confrontDistant: '', distantTotal: '', distant: ''},
        { named: '72 часа и выше', total: '40', confrontTotal: '40', confront: '', confrontDistantTotal: '', confrontDistant: '', distantTotal: '', distant: ''},
        { named: 'Профессиональная переподготовка', total: '0', confrontTotal: '0', confront: '0', confrontDistantTotal: '0', confrontDistant: '0', distantTotal: '0', distant: '0'},
        { named: 'В том числе в объёме: от 250 до 500 часов', total: '0', confrontTotal: '', confront: '', confrontDistantTotal: '', confrontDistant: '', distantTotal: '', distant: ''},
        { named: '500 часов и выше', total: '0', confrontTotal: '', confront: '', confrontDistantTotal: '', confrontDistant: '', distantTotal: '', distant: ''},
        { named: 'С присвоением новой квалификации', total: '0', confrontTotal: '', confront: '', confrontDistantTotal: '', confrontDistant: '', distantTotal: '', distant: ''},
        { named: 'Численность слушателей на конец отчётного года', total: '0', confrontTotal: '', confront: '', confrontDistantTotal: '', confrontDistant: '', distantTotal: '', distant: ''}
      ]
  return {adv,
          studentsRow,
          studentsKey}
  }
}
</script>